[
    {
        "Name":  "Defender Accessibility Settings",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Accessibility Settings\",\r\n    \"payloadName\":  \"accessibility\",\r\n    \"payloadFileName\":  \"accessibility.mobileconfig\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KPGRpY3Q+CjxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KPHN0cmluZz4xQzE0NjMwNC1ERjVCLTQxRjItOEFENC0xN0VBOUE5NUQwOTU8L3N0cmluZz4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+CjxzdHJpbmc+TWljcm9zb2Z0IENvcnBvcmF0aW9uPC9zdHJpbmc+CjxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXYudGNjLmFjY2Vzc2liaWxpdHk8L3N0cmluZz4KPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KPHN0cmluZz5EZWZlbmRlciAtIEFjY2Vzc2liaWxpdHkgQWNjZXNzPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+CjxzdHJpbmcvPgo8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjxrZXk+UGF5bG9hZEVuYWJsZWQ8L2tleT4KPHRydWUvPgo8a2V5PlBheWxvYWRSZW1vdmFsRGlzYWxsb3dlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+CjxzdHJpbmc+U3lzdGVtPC9zdHJpbmc+CjxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KPGFycmF5Pgo8ZGljdD4KPGtleT5QYXlsb2FkVVVJRDwva2V5Pgo8c3RyaW5nPkUyM0NBNEJFLTY1QkEtNDY4NS04OUQ2LTA0MUY4Mjk5NDYwNjwvc3RyaW5nPgo8a2V5PlBheWxvYWRUeXBlPC9rZXk+CjxzdHJpbmc+Y29tLmFwcGxlLlRDQy5jb25maWd1cmF0aW9uLXByb2ZpbGUtcG9saWN5PC9zdHJpbmc+CjxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5Pgo8c3RyaW5nPk1pY3Jvc29mdCBDb3Jwb3JhdGlvbjwvc3RyaW5nPgo8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+CjxzdHJpbmc+RTIzQ0E0QkUtNjVCQS00Njg1LTg5RDYtMDQxRjgyOTk0NjA2PC9zdHJpbmc+CjxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CjxzdHJpbmc+UHJpdmFjeSBQcmVmZXJlbmNlcyBQb2xpY3kgQ29udHJvbDwvc3RyaW5nPgo8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5Pgo8c3RyaW5nLz4KPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5Pgo8aW50ZWdlcj4xPC9pbnRlZ2VyPgo8a2V5PlBheWxvYWRFbmFibGVkPC9rZXk+Cjx0cnVlLz4KPGtleT5TZXJ2aWNlczwva2V5Pgo8ZGljdD4KPGtleT5BY2Nlc3NpYmlsaXR5PC9rZXk+CjxhcnJheT4KPGRpY3Q+CjxrZXk+SWRlbnRpZmllcjwva2V5Pgo8c3RyaW5nPmNvbS5taWNyb3NvZnQuZGxwLmRhZW1vbjwvc3RyaW5nPgo8a2V5PkNvZGVSZXF1aXJlbWVudDwva2V5Pgo8c3RyaW5nPmlkZW50aWZpZXIgImNvbS5taWNyb3NvZnQuZGxwLmRhZW1vbiIgYW5kIGFuY2hvciBhcHBsZSBnZW5lcmljIGFuZCBjZXJ0aWZpY2F0ZSAxW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjIuNl0gLyogZXhpc3RzICovIGFuZCBjZXJ0aWZpY2F0ZSBsZWFmW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjEuMTNdIC8qIGV4aXN0cyAqLyBhbmQgY2VydGlmaWNhdGUgbGVhZltzdWJqZWN0Lk9VXSA9IFVCRjhUMzQ2Rzk8L3N0cmluZz4KPGtleT5JZGVudGlmaWVyVHlwZTwva2V5Pgo8c3RyaW5nPmJ1bmRsZUlEPC9zdHJpbmc+CjxrZXk+U3RhdGljQ29kZTwva2V5Pgo8aW50ZWdlcj4wPC9pbnRlZ2VyPgo8a2V5PkFsbG93ZWQ8L2tleT4KPGludGVnZXI+MTwvaW50ZWdlcj4KPC9kaWN0Pgo8L2FycmF5Pgo8L2RpY3Q+CjwvZGljdD4KPC9hcnJheT4KPC9kaWN0Pgo8L3BsaXN0Pgo=\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "9dab94af-71d8-4b58-9e81-6de6427a64c5"
    },
    {
        "Name":  "Defender Auto Update",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Auto Update\",\r\n    \"payloadName\":  \"autoupdate\",\r\n    \"payloadFileName\":  \"com.microsoft.autoupdate2.mobileconfig\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KICAgIDxkaWN0PgogICAgICAgIDxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KICAgICAgICA8c3RyaW5nPkI3NjJGRjYwLTZBQ0ItNEE3Mi05RTcyLTQ1OUQwMEM5MzZGMzwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZFR5cGU8L2tleT4KICAgICAgICA8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KICAgICAgICA8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KICAgICAgICA8c3RyaW5nPk1pY3Jvc29mdDwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KICAgICAgICA8c3RyaW5nPmNvbS5taWNyb3NvZnQuYXV0b3VwZGF0ZTI8L3N0cmluZz4KICAgICAgICA8a2V5PlBheWxvYWREaXNwbGF5TmFtZTwva2V5PgogICAgICAgIDxzdHJpbmc+TWljcm9zb2Z0IEF1dG9VcGRhdGUgc2V0dGluZ3M8L3N0cmluZz4KICAgICAgICA8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5PgogICAgICAgIDxzdHJpbmc+TWljcm9zb2Z0IEF1dG9VcGRhdGUgY29uZmlndXJhdGlvbiBzZXR0aW5nczwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KICAgICAgICA8aW50ZWdlcj4xPC9pbnRlZ2VyPgogICAgICAgIDxrZXk+UGF5bG9hZEVuYWJsZWQ8L2tleT4KICAgICAgICA8dHJ1ZS8+CiAgICAgICAgPGtleT5QYXlsb2FkUmVtb3ZhbERpc2FsbG93ZWQ8L2tleT4KICAgICAgICA8dHJ1ZS8+CiAgICAgICAgPGtleT5QYXlsb2FkU2NvcGU8L2tleT4KICAgICAgICA8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KICAgICAgICA8YXJyYXk+CiAgICAgICAgICAgIDxkaWN0PgogICAgICAgICAgICA8a2V5PlBheWxvYWRVVUlEPC9rZXk+CiAgICAgICAgICAgIDxzdHJpbmc+NUE2RjM1MEEtQ0MyQy00NDBCLUEwNzQtNjhFM0YzNEVCQUU5PC9zdHJpbmc+CiAgICAgICAgICAgIDxrZXk+UGF5bG9hZFR5cGU8L2tleT4KICAgICAgICAgICAgPHN0cmluZz5jb20ubWljcm9zb2Z0LmF1dG91cGRhdGUyPC9zdHJpbmc+CiAgICAgICAgICAgIDxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgogICAgICAgICAgICA8c3RyaW5nPk1pY3Jvc29mdDwvc3RyaW5nPgogICAgICAgICAgICA8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+CiAgICAgICAgICAgIDxzdHJpbmc+Y29tLm1pY3Jvc29mdC5hdXRvdXBkYXRlMjwvc3RyaW5nPgogICAgICAgICAgICA8a2V5PlBheWxvYWREaXNwbGF5TmFtZTwva2V5PgogICAgICAgICAgICA8c3RyaW5nPk1pY3Jvc29mdCBBdXRvVXBkYXRlIGNvbmZpZ3VyYXRpb24gc2V0dGluZ3M8L3N0cmluZz4KICAgICAgICAgICAgPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KICAgICAgICAgICAgPHN0cmluZy8+CiAgICAgICAgICAgIDxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KICAgICAgICAgICAgPGludGVnZXI+MTwvaW50ZWdlcj4KICAgICAgICAgICAgPGtleT5QYXlsb2FkRW5hYmxlZDwva2V5PgogICAgICAgICAgICA8dHJ1ZS8+CiAgICAgICAgICAgIDxrZXk+Q2hhbm5lbE5hbWU8L2tleT4KICAgICAgICAgICAgPHN0cmluZz5Qcm9kdWN0aW9uPC9zdHJpbmc+CiAgICAgICAgICAgIDxrZXk+SG93VG9DaGVjazwva2V5PgogICAgICAgICAgICA8c3RyaW5nPkF1dG9tYXRpY0Rvd25sb2FkPC9zdHJpbmc+CiAgICAgICAgICAgIDxrZXk+RW5hYmxlQ2hlY2tGb3JVcGRhdGVzQnV0dG9uPC9rZXk+CiAgICAgICAgICAgIDx0cnVlLz4KICAgICAgICAgICAgPGtleT5EaXNhYmxlSW5zaWRlckNoZWNrYm94PC9rZXk+CiAgICAgICAgICAgIDxmYWxzZS8+CiAgICAgICAgICAgIDxrZXk+U2VuZEFsbFRlbGVtZXRyeUVuYWJsZWQ8L2tleT4KICAgICAgICAgICAgPHRydWUvPgogICAgICAgICAgICA8L2RpY3Q+CiAgICAgICAgPC9hcnJheT4KICAgIDwvZGljdD4KPC9wbGlzdD4K\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "60d63045-2418-47ca-8770-37cd0890de75"
    },
    {
        "Name":  "Defender Background Services",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Background Services\",\r\n    \"payloadName\":  \"background services\",\r\n    \"payloadFileName\":  \"background_services.mobileconfig\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KPGRpY3Q+CjxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KPHN0cmluZz42OUREOTgyNS0wNjdCLTRDNkMtOEI1NC1FREE4M0M3RjE3OUQ8L3N0cmluZz4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+CjxzdHJpbmc+TWljcm9zb2Z0IENvcnBvcmF0aW9uPC9zdHJpbmc+CjxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXYuYmFja2dyb3VuZDwvc3RyaW5nPgo8a2V5PlBheWxvYWREaXNwbGF5TmFtZTwva2V5Pgo8c3RyaW5nPkRlZmVuZGVyIC0gQmFja2dyb3VuZCBTZXJ2aWNlczwvc3RyaW5nPgo8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5Pgo8c3RyaW5nLz4KPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5Pgo8aW50ZWdlcj4xPC9pbnRlZ2VyPgo8a2V5PlBheWxvYWRFbmFibGVkPC9rZXk+Cjx0cnVlLz4KPGtleT5QYXlsb2FkUmVtb3ZhbERpc2FsbG93ZWQ8L2tleT4KPHRydWUvPgo8a2V5PlBheWxvYWRTY29wZTwva2V5Pgo8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgo8a2V5PlBheWxvYWRDb250ZW50PC9rZXk+CjxhcnJheT4KPGRpY3Q+CjxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+CjxzdHJpbmc+QmFja2dyb3VuZCBTZXJ2aWNlIE1hbmFnZW1lbnQgZm9yIE1pY3Jvc29mdCBEZWZlbmRlcjwvc3RyaW5nPgo8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+CjxzdHJpbmc+NERCOTYyNzYtMjMxMC00NEMyLUFFMTEtQzZFNzYxRkIwMzA0LnByaXZhY3kuMDQxMDI0ODEtQzFGMS00NEYyLUI1NDgtRTBCNTU0ODkwNDkzPC9zdHJpbmc+CjxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KPHN0cmluZz5BOUJGOEZBOS1DRUEzLTQyQTItQjhDMS1FMTk5OEI4NENCQjA8L3N0cmluZz4KPGtleT5SdWxlczwva2V5Pgo8YXJyYXk+CjxkaWN0Pgo8a2V5PlJ1bGVUeXBlPC9rZXk+CjxzdHJpbmc+TGFiZWxQcmVmaXg8L3N0cmluZz4KPGtleT5SdWxlVmFsdWU8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LmZyZXNubzwvc3RyaW5nPgo8L2RpY3Q+CjxkaWN0Pgo8a2V5PlJ1bGVUeXBlPC9rZXk+CjxzdHJpbmc+TGFiZWxQcmVmaXg8L3N0cmluZz4KPGtleT5SdWxlVmFsdWU8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LmRscDwvc3RyaW5nPgo8L2RpY3Q+CjwvYXJyYXk+CjxrZXk+UGF5bG9hZFR5cGU8L2tleT4KPHN0cmluZz5jb20uYXBwbGUuc2VydmljZW1hbmFnZW1lbnQ8L3N0cmluZz4KPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KPHN0cmluZz5CYWNrZ3JvdW5kIFNlcnZpY2UgTWFuYWdlbWVudCBmb3IgTWljcm9zb2Z0IERlZmVuZGVyPC9zdHJpbmc+CjwvZGljdD4KPC9hcnJheT4KPC9kaWN0Pgo8L3BsaXN0Pgo=\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "b81f679c-608f-4dc0-81f7-421b08cec804"
    },
    {
        "Name":  "Defender Bluetooth Permissions",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Bluetooth Permissions\",\r\n    \"payloadName\":  \"bluetooth\",\r\n    \"payloadFileName\":  \"bluetooth.mobileconfig\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KPGRpY3Q+CjxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KPHN0cmluZz41OTZFQ0M0Ri04Q0UzLTREQjAtOTI3Ny0zQjYwRkY2MjA5RTA8L3N0cmluZz4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+CjxzdHJpbmc+TWljcm9zb2Z0IENvcnBvcmF0aW9uPC9zdHJpbmc+CjxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXYudGNjLmJsdWV0b290aDwvc3RyaW5nPgo8a2V5PlBheWxvYWREaXNwbGF5TmFtZTwva2V5Pgo8c3RyaW5nPkRlZmVuZGVyIC0gQmx1ZXRvb3RoPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+CjxzdHJpbmcvPgo8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjxrZXk+UGF5bG9hZEVuYWJsZWQ8L2tleT4KPHRydWUvPgo8a2V5PlBheWxvYWRSZW1vdmFsRGlzYWxsb3dlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+CjxzdHJpbmc+U3lzdGVtPC9zdHJpbmc+CjxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KPGFycmF5Pgo8ZGljdD4KPGtleT5QYXlsb2FkVVVJRDwva2V5Pgo8c3RyaW5nPjAzQkMyMUQ0LTRFREUtNEFCOS05Nzg1LTg3QUNCQ0NFMzU5Mzwvc3RyaW5nPgo8a2V5PlBheWxvYWRUeXBlPC9rZXk+CjxzdHJpbmc+Y29tLmFwcGxlLlRDQy5jb25maWd1cmF0aW9uLXByb2ZpbGUtcG9saWN5PC9zdHJpbmc+CjxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5Pgo8c3RyaW5nPk1pY3Jvc29mdCBDb3Jwb3JhdGlvbjwvc3RyaW5nPgo8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+CjxzdHJpbmc+MDNCQzIxRDQtNEVERS00QUI5LTk3ODUtODdBQ0JDQ0UzNTkzPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CjxzdHJpbmc+UHJpdmFjeSBQcmVmZXJlbmNlcyBQb2xpY3kgQ29udHJvbDwvc3RyaW5nPgo8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5Pgo8c3RyaW5nLz4KPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5Pgo8aW50ZWdlcj4xPC9pbnRlZ2VyPgo8a2V5PlBheWxvYWRFbmFibGVkPC9rZXk+Cjx0cnVlLz4KPGtleT5TZXJ2aWNlczwva2V5Pgo8ZGljdD4KPGtleT5CbHVldG9vdGhBbHdheXM8L2tleT4KPGFycmF5Pgo8ZGljdD4KPGtleT5JZGVudGlmaWVyPC9rZXk+CjxzdHJpbmc+Y29tLm1pY3Jvc29mdC5kbHAuYWdlbnQ8L3N0cmluZz4KPGtleT5Db2RlUmVxdWlyZW1lbnQ8L2tleT4KPHN0cmluZz5pZGVudGlmaWVyICJjb20ubWljcm9zb2Z0LmRscC5hZ2VudCIgYW5kIGFuY2hvciBhcHBsZSBnZW5lcmljIGFuZCBjZXJ0aWZpY2F0ZSAxW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjIuNl0gLyogZXhpc3RzICovIGFuZCBjZXJ0aWZpY2F0ZSBsZWFmW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjEuMTNdIC8qIGV4aXN0cyAqLyBhbmQgY2VydGlmaWNhdGUgbGVhZltzdWJqZWN0Lk9VXSA9IFVCRjhUMzQ2Rzk8L3N0cmluZz4KPGtleT5JZGVudGlmaWVyVHlwZTwva2V5Pgo8c3RyaW5nPmJ1bmRsZUlEPC9zdHJpbmc+CjxrZXk+U3RhdGljQ29kZTwva2V5Pgo8aW50ZWdlcj4wPC9pbnRlZ2VyPgo8a2V5PkFsbG93ZWQ8L2tleT4KPGludGVnZXI+MTwvaW50ZWdlcj4KPC9kaWN0Pgo8L2FycmF5Pgo8L2RpY3Q+CjwvZGljdD4KPC9hcnJheT4KPC9kaWN0Pgo8L3BsaXN0Pgo=\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "bd3a9199-21d8-478e-ae47-e1744f7ecbff"
    },
    {
        "Name":  "Defender Extension Policies",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSExtensionsConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Extension Policies\",\r\n    \"kernelExtensionOverridesAllowed\":  false,\r\n    \"kernelExtensionAllowedTeamIdentifiers\":  [\r\n\r\n                                              ],\r\n    \"systemExtensionsBlockOverride\":  false,\r\n    \"systemExtensionsAllowedTeamIdentifiers\":  [\r\n\r\n                                               ],\r\n    \"kernelExtensionsAllowed\":  [\r\n\r\n                                ],\r\n    \"systemExtensionsAllowed\":  [\r\n                                    {\r\n                                        \"teamIdentifier\":  \"UBF8T346G9\",\r\n                                        \"bundleId\":  \"com.microsoft.wdav.epsext\"\r\n                                    },\r\n                                    {\r\n                                        \"teamIdentifier\":  \"UBF8T346G9\",\r\n                                        \"bundleId\":  \"com.microsoft.wdav.netext\"\r\n                                    }\r\n                                ],\r\n    \"systemExtensionsAllowedTypes\":  [\r\n\r\n                                     ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "614ceee1-cb94-4cea-8c43-863a94d65630"
    },
    {
        "Name":  "Defender Full Disk Access",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Full Disk Access\",\r\n    \"payloadName\":  \"fulldiskaccess\",\r\n    \"payloadFileName\":  \"fulldisk.mobileconfig\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KPGRpY3Q+CjxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KPHN0cmluZz4xODZEQjI2RS1COTZGLTREMUItOUM4MC02QUQ3RUZGODdEMDE8L3N0cmluZz4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+CjxzdHJpbmc+TWljcm9zb2Z0IENvcnBvcmF0aW9uPC9zdHJpbmc+CjxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXYudGNjLmZ1bGxkaXNrYWNjZXNzPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CjxzdHJpbmc+RGVmZW5kZXIgLSBGdWxsIERpc2sgQWNjZXNzPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+CjxzdHJpbmcvPgo8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjxrZXk+UGF5bG9hZEVuYWJsZWQ8L2tleT4KPHRydWUvPgo8a2V5PlBheWxvYWRSZW1vdmFsRGlzYWxsb3dlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+CjxzdHJpbmc+U3lzdGVtPC9zdHJpbmc+CjxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KPGFycmF5Pgo8ZGljdD4KPGtleT5QYXlsb2FkVVVJRDwva2V5Pgo8c3RyaW5nPjc4MkVGRkJBLUExNTgtNDU3MS04MjJELUQwODVCQTQzRUQ3QTwvc3RyaW5nPgo8a2V5PlBheWxvYWRUeXBlPC9rZXk+CjxzdHJpbmc+Y29tLmFwcGxlLlRDQy5jb25maWd1cmF0aW9uLXByb2ZpbGUtcG9saWN5PC9zdHJpbmc+CjxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5Pgo8c3RyaW5nPk1pY3Jvc29mdCBDb3Jwb3JhdGlvbjwvc3RyaW5nPgo8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+CjxzdHJpbmc+NzgyRUZGQkEtQTE1OC00NTcxLTgyMkQtRDA4NUJBNDNFRDdBPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CjxzdHJpbmc+UHJpdmFjeSBQcmVmZXJlbmNlcyBQb2xpY3kgQ29udHJvbDwvc3RyaW5nPgo8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5Pgo8c3RyaW5nLz4KPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5Pgo8aW50ZWdlcj4xPC9pbnRlZ2VyPgo8a2V5PlBheWxvYWRFbmFibGVkPC9rZXk+Cjx0cnVlLz4KPGtleT5TZXJ2aWNlczwva2V5Pgo8ZGljdD4KPGtleT5TeXN0ZW1Qb2xpY3lBbGxGaWxlczwva2V5Pgo8YXJyYXk+CjxkaWN0Pgo8a2V5PklkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXY8L3N0cmluZz4KPGtleT5Db2RlUmVxdWlyZW1lbnQ8L2tleT4KPHN0cmluZz5pZGVudGlmaWVyICJjb20ubWljcm9zb2Z0LndkYXYiIGFuZCBhbmNob3IgYXBwbGUgZ2VuZXJpYyBhbmQgY2VydGlmaWNhdGUgMVtmaWVsZC4xLjIuODQwLjExMzYzNS4xMDAuNi4yLjZdIC8qIGV4aXN0cyAqLyBhbmQgY2VydGlmaWNhdGUgbGVhZltmaWVsZC4xLjIuODQwLjExMzYzNS4xMDAuNi4xLjEzXSAvKiBleGlzdHMgKi8gYW5kIGNlcnRpZmljYXRlIGxlYWZbc3ViamVjdC5PVV0gPSBVQkY4VDM0Nkc5PC9zdHJpbmc+CjxrZXk+SWRlbnRpZmllclR5cGU8L2tleT4KPHN0cmluZz5idW5kbGVJRDwvc3RyaW5nPgo8a2V5PlN0YXRpY0NvZGU8L2tleT4KPGludGVnZXI+MDwvaW50ZWdlcj4KPGtleT5BbGxvd2VkPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjwvZGljdD4KPGRpY3Q+CjxrZXk+SWRlbnRpZmllcjwva2V5Pgo8c3RyaW5nPmNvbS5taWNyb3NvZnQud2Rhdi5lcHNleHQ8L3N0cmluZz4KPGtleT5Db2RlUmVxdWlyZW1lbnQ8L2tleT4KPHN0cmluZz5pZGVudGlmaWVyICJjb20ubWljcm9zb2Z0LndkYXYuZXBzZXh0IiBhbmQgYW5jaG9yIGFwcGxlIGdlbmVyaWMgYW5kIGNlcnRpZmljYXRlIDFbZmllbGQuMS4yLjg0MC4xMTM2MzUuMTAwLjYuMi42XSAvKiBleGlzdHMgKi8gYW5kIGNlcnRpZmljYXRlIGxlYWZbZmllbGQuMS4yLjg0MC4xMTM2MzUuMTAwLjYuMS4xM10gLyogZXhpc3RzICovIGFuZCBjZXJ0aWZpY2F0ZSBsZWFmW3N1YmplY3QuT1VdID0gVUJGOFQzNDZHOTwvc3RyaW5nPgo8a2V5PklkZW50aWZpZXJUeXBlPC9rZXk+CjxzdHJpbmc+YnVuZGxlSUQ8L3N0cmluZz4KPGtleT5TdGF0aWNDb2RlPC9rZXk+CjxpbnRlZ2VyPjA8L2ludGVnZXI+CjxrZXk+QWxsb3dlZDwva2V5Pgo8aW50ZWdlcj4xPC9pbnRlZ2VyPgo8L2RpY3Q+CjxkaWN0Pgo8a2V5PklkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LmRscC5kYWVtb248L3N0cmluZz4KPGtleT5Db2RlUmVxdWlyZW1lbnQ8L2tleT4KPHN0cmluZz5pZGVudGlmaWVyICJjb20ubWljcm9zb2Z0LmRscC5kYWVtb24iIGFuZCBhbmNob3IgYXBwbGUgZ2VuZXJpYyBhbmQgY2VydGlmaWNhdGUgMVtmaWVsZC4xLjIuODQwLjExMzYzNS4xMDAuNi4yLjZdIC8qIGV4aXN0cyAqLyBhbmQgY2VydGlmaWNhdGUgbGVhZltmaWVsZC4xLjIuODQwLjExMzYzNS4xMDAuNi4xLjEzXSAvKiBleGlzdHMgKi8gYW5kIGNlcnRpZmljYXRlIGxlYWZbc3ViamVjdC5PVV0gPSBVQkY4VDM0Nkc5PC9zdHJpbmc+CjxrZXk+SWRlbnRpZmllclR5cGU8L2tleT4KPHN0cmluZz5idW5kbGVJRDwvc3RyaW5nPgo8a2V5PlN0YXRpY0NvZGU8L2tleT4KPGludGVnZXI+MDwvaW50ZWdlcj4KPGtleT5BbGxvd2VkPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjwvZGljdD4KPC9hcnJheT4KPC9kaWN0Pgo8L2RpY3Q+CjwvYXJyYXk+CjwvZGljdD4KPC9wbGlzdD4K\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "494bac80-ea35-4db2-b3e7-8b761450f3ab"
    },
    {
        "Name":  "Defender NetFilter",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender NetFilter\",\r\n    \"payloadName\":  \"netfilter\",\r\n    \"payloadFileName\":  \"netfilter.mobileconfig\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KPGRpY3Q+CjxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KPHN0cmluZz4xQTg1M0REQi0zN0FCLTRENEYtQjc0RC0xNTE5N0ZFRjY0MjM8L3N0cmluZz4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+CjxzdHJpbmc+TWljcm9zb2Z0IENvcnBvcmF0aW9uPC9zdHJpbmc+CjxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXYud2ViY29udGVudGZpbHRlcjwvc3RyaW5nPgo8a2V5PlBheWxvYWREaXNwbGF5TmFtZTwva2V5Pgo8c3RyaW5nPkRlZmVuZGVyIC0gTmV0d29yayBGaWx0ZXI8L3N0cmluZz4KPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KPHN0cmluZy8+CjxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KPGludGVnZXI+MTwvaW50ZWdlcj4KPGtleT5QYXlsb2FkRW5hYmxlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+UGF5bG9hZFJlbW92YWxEaXNhbGxvd2VkPC9rZXk+Cjx0cnVlLz4KPGtleT5QYXlsb2FkU2NvcGU8L2tleT4KPHN0cmluZz5TeXN0ZW08L3N0cmluZz4KPGtleT5QYXlsb2FkQ29udGVudDwva2V5Pgo8YXJyYXk+CjxkaWN0Pgo8a2V5PkZpbHRlckRhdGFQcm92aWRlckJ1bmRsZUlkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXYubmV0ZXh0PC9zdHJpbmc+CjxrZXk+RmlsdGVyRGF0YVByb3ZpZGVyRGVzaWduYXRlZFJlcXVpcmVtZW50PC9rZXk+CjxzdHJpbmc+aWRlbnRpZmllciAiY29tLm1pY3Jvc29mdC53ZGF2Lm5ldGV4dCIgYW5kIGFuY2hvciBhcHBsZSBnZW5lcmljIGFuZCBjZXJ0aWZpY2F0ZSAxW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjIuNl0gLyogZXhpc3RzICovIGFuZCBjZXJ0aWZpY2F0ZSBsZWFmW2ZpZWxkLjEuMi44NDAuMTEzNjM1LjEwMC42LjEuMTNdIC8qIGV4aXN0cyAqLyBhbmQgY2VydGlmaWNhdGUgbGVhZltzdWJqZWN0Lk9VXSA9IFVCRjhUMzQ2Rzk8L3N0cmluZz4KPGtleT5GaWx0ZXJHcmFkZTwva2V5Pgo8c3RyaW5nPmluc3BlY3Rvcjwvc3RyaW5nPgo8a2V5PkZpbHRlclBhY2tldHM8L2tleT4KPGZhbHNlLz4KPGtleT5GaWx0ZXJTb2NrZXRzPC9rZXk+Cjx0cnVlLz4KPGtleT5GaWx0ZXJUeXBlPC9rZXk+CjxzdHJpbmc+UGx1Z2luPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CjxzdHJpbmc+V2ViIENvbnRlbnQgRmlsdGVyIFBheWxvYWQ8L3N0cmluZz4KPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5Pgo8c3RyaW5nPjI4M0Y0QkYwLTc4OEEtNDQzNS05QjYyLTNFMDA4OTYzNThENzwvc3RyaW5nPgo8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KPHN0cmluZz5KQU1GIFNvZnR3YXJlPC9zdHJpbmc+CjxrZXk+UGF5bG9hZFR5cGU8L2tleT4KPHN0cmluZz5jb20uYXBwbGUud2ViY29udGVudC1maWx0ZXI8L3N0cmluZz4KPGtleT5QYXlsb2FkVVVJRDwva2V5Pgo8c3RyaW5nPjI4M0Y0QkYwLTc4OEEtNDQzNS05QjYyLTNFMDA4OTYzNThENzwvc3RyaW5nPgo8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjxrZXk+UGx1Z2luQnVuZGxlSUQ8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXY8L3N0cmluZz4KPGtleT5Vc2VyRGVmaW5lZE5hbWU8L2tleT4KPHN0cmluZz5NaWNyb3NvZnQgRGVmZW5kZXIgQ29udGVudCBGaWx0ZXI8L3N0cmluZz4KPC9kaWN0Pgo8L2FycmF5Pgo8L2RpY3Q+CjwvcGxpc3Q+Cg==\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "f6e5ff81-4dbd-4e75-84e6-2a25f47fde75"
    },
    {
        "Name":  "Defender Notifications",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Notifications\",\r\n    \"payloadName\":  \"notifications\",\r\n    \"payloadFileName\":  \"notif.mobileconfig\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KPGRpY3Q+CjxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KPHN0cmluZz5FMUUwRDNGNy01NDZGLTQ4NjctQjY1NS02NjlFMTM2MUFCRTU8L3N0cmluZz4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+CjxzdHJpbmc+TWljcm9zb2Z0IENvcnBvcmF0aW9uPC9zdHJpbmc+CjxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LndkYXYubm90aWZpY2F0aW9uPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CjxzdHJpbmc+RGVmZW5kZXIgLSBOb3RpZmljYXRpb25zPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+CjxzdHJpbmcvPgo8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjxrZXk+UGF5bG9hZEVuYWJsZWQ8L2tleT4KPHRydWUvPgo8a2V5PlBheWxvYWRSZW1vdmFsRGlzYWxsb3dlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+CjxzdHJpbmc+U3lzdGVtPC9zdHJpbmc+CjxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KPGFycmF5Pgo8ZGljdD4KPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KPHN0cmluZz5Ob3RpZmljYXRpb25zIFBheWxvYWQ8L3N0cmluZz4KPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5Pgo8c3RyaW5nPjA1QkY3MjIxLTI0NzAtNDc3RC05OUIzLTE3MjlCMTkzMkJEQjwvc3RyaW5nPgo8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KPHN0cmluZz5NaWNyb3NvZnQgQ29ycG9yYXRpb248L3N0cmluZz4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPmNvbS5hcHBsZS5ub3RpZmljYXRpb25zZXR0aW5nczwvc3RyaW5nPgo8a2V5PlBheWxvYWRVVUlEPC9rZXk+CjxzdHJpbmc+MDVCRjcyMjEtMjQ3MC00NzdELTk5QjMtMTcyOUIxOTMyQkRCPC9zdHJpbmc+CjxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KPGludGVnZXI+MTwvaW50ZWdlcj4KPGtleT5Ob3RpZmljYXRpb25TZXR0aW5nczwva2V5Pgo8YXJyYXk+CjxkaWN0Pgo8a2V5PkFsZXJ0VHlwZTwva2V5Pgo8aW50ZWdlcj4xPC9pbnRlZ2VyPgo8a2V5PkJhZGdlc0VuYWJsZWQ8L2tleT4KPHRydWUvPgo8a2V5PkJ1bmRsZUlkZW50aWZpZXI8L2tleT4KPHN0cmluZz5jb20ubWljcm9zb2Z0LmF1dG91cGRhdGUyPC9zdHJpbmc+CjxrZXk+Q3JpdGljYWxBbGVydEVuYWJsZWQ8L2tleT4KPGZhbHNlLz4KPGtleT5Ob3RpZmljYXRpb25zRW5hYmxlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+U2hvd0luTG9ja1NjcmVlbjwva2V5Pgo8ZmFsc2UvPgo8a2V5PlNob3dJbk5vdGlmaWNhdGlvbkNlbnRlcjwva2V5Pgo8dHJ1ZS8+CjxrZXk+U291bmRzRW5hYmxlZDwva2V5Pgo8dHJ1ZS8+CjwvZGljdD4KPGRpY3Q+CjxrZXk+QWxlcnRUeXBlPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjxrZXk+QmFkZ2VzRW5hYmxlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+QnVuZGxlSWRlbnRpZmllcjwva2V5Pgo8c3RyaW5nPmNvbS5taWNyb3NvZnQud2Rhdi50cmF5PC9zdHJpbmc+CjxrZXk+Q3JpdGljYWxBbGVydEVuYWJsZWQ8L2tleT4KPGZhbHNlLz4KPGtleT5Ob3RpZmljYXRpb25zRW5hYmxlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+U2hvd0luTG9ja1NjcmVlbjwva2V5Pgo8ZmFsc2UvPgo8a2V5PlNob3dJbk5vdGlmaWNhdGlvbkNlbnRlcjwva2V5Pgo8dHJ1ZS8+CjxrZXk+U291bmRzRW5hYmxlZDwva2V5Pgo8dHJ1ZS8+CjwvZGljdD4KPC9hcnJheT4KPC9kaWN0Pgo8L2FycmF5Pgo8L2RpY3Q+CjwvcGxpc3Q+Cg==\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "d6493194-3a80-456f-91db-ec4de51bf95b"
    },
    {
        "Name":  "Defender Onboarding Package",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Onboarding Package\",\r\n    \"payloadName\":  \"onboarding\",\r\n    \"payloadFileName\":  \"WindowsDefenderATPOnboarding.xml\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KICAgIDxkaWN0PgogICAgICAgIDxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KICAgICAgICA8c3RyaW5nPkEyN0Y1MjRGLTdBNTQtNEU5QS1CNDU5LUI1MEEzMjFDNDI5NTwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZFR5cGU8L2tleT4KICAgICAgICA8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KICAgICAgICA8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KICAgICAgICA8c3RyaW5nPk1pY3Jvc29mdDwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KICAgICAgICA8c3RyaW5nPkEyN0Y1MjRGLTdBNTQtNEU5QS1CNDU5LUI1MEEzMjFDNDI5NTwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CiAgICAgICAgPHN0cmluZz5XREFUUCBzZXR0aW5nczwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+CiAgICAgICAgPHN0cmluZz5XREFUUCBjb25maWd1cmF0aW9uIHNldHRpbmdzLjwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KICAgICAgICA8aW50ZWdlcj4xPC9pbnRlZ2VyPgogICAgICAgIDxrZXk+UGF5bG9hZEVuYWJsZWQ8L2tleT4KICAgICAgICA8dHJ1ZS8+CiAgICAgICAgPGtleT5QYXlsb2FkUmVtb3ZhbERpc2FsbG93ZWQ8L2tleT4KICAgICAgICA8dHJ1ZS8+CiAgICAgICAgPGtleT5QYXlsb2FkU2NvcGU8L2tleT4KICAgICAgICA8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KICAgICAgICA8YXJyYXk+CiAgICAgICAgICAgIDxkaWN0PgogICAgICAgICAgICAgICAgPGtleT5QYXlsb2FkVVVJRDwva2V5PgogICAgICAgICAgICAgICAgPHN0cmluZz5ENzExNDNFOS04RjQxLTQ3RUUtOENEMi02OTQ5NUU4MkM2QUM8L3N0cmluZz4KICAgICAgICAgICAgICAgIDxrZXk+UGF5bG9hZFR5cGU8L2tleT4KICAgICAgICAgICAgICAgIDxzdHJpbmc+Y29tLm1pY3Jvc29mdC53ZGF2LmF0cDwvc3RyaW5nPgogICAgICAgICAgICAgICAgPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+CiAgICAgICAgICAgICAgICA8c3RyaW5nPk1pY3Jvc29mdDwvc3RyaW5nPgogICAgICAgICAgICAgICAgPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgogICAgICAgICAgICAgICAgPHN0cmluZz5ENzExNDNFOS04RjQxLTQ3RUUtOENEMi02OTQ5NUU4MkM2QUM8L3N0cmluZz4KICAgICAgICAgICAgICAgIDxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CiAgICAgICAgICAgICAgICA8c3RyaW5nPldEQVRQIGNvbmZpZ3VyYXRpb24gc2V0dGluZ3M8L3N0cmluZz4KICAgICAgICAgICAgICAgIDxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+CiAgICAgICAgICAgICAgICA8c3RyaW5nLz4KICAgICAgICAgICAgICAgIDxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KICAgICAgICAgICAgICAgIDxpbnRlZ2VyPjE8L2ludGVnZXI+CiAgICAgICAgICAgICAgICA8a2V5PlBheWxvYWRFbmFibGVkPC9rZXk+CiAgICAgICAgICAgICAgICA8dHJ1ZS8+CiAgICAgICAgICAgICAgICA8a2V5PkFsbG93VXNlck92ZXJyaWRlczwva2V5PgogICAgICAgICAgICAgICAgPHRydWUvPgogICAgICAgICAgICAgICAgPGtleT5PcmdJZDwva2V5PgogICAgICAgICAgICAgICAgPHN0cmluZz4wMWVmOWI2Zi0wMGU1LTQyOTgtYTk2MS0yYmU1NGEyYWNlYzU8L3N0cmluZz4KICAgICAgICAgICAgICAgIDxrZXk+T25ib2FyZGluZ0luZm88L2tleT4KICAgICAgICAgICAgICAgIDxzdHJpbmc+eyJib2R5Ijoie1wicHJldmlvdXNPcmdJZHNcIjpbXSxcIm9yZ0lkXCI6XCIwMWVmOWI2Zi0wMGU1LTQyOTgtYTk2MS0yYmU1NGEyYWNlYzVcIixcImdlb0xvY2F0aW9uVXJsXCI6XCJodHRwczovL2Vkci1hdXMuYXUuZW5kcG9pbnQuc2VjdXJpdHkubWljcm9zb2Z0LmNvbS9lZHIvXCIsXCJkYXRhY2VudGVyXCI6XCJTb3V0aGVhc3RBdVwiLFwidm9ydGV4R2VvTG9jYXRpb25cIjpcIkFVXCIsXCJ2b3J0ZXhTZXJ2ZXJVcmxcIjpcImh0dHBzOi8vYXUtdjIwLmV2ZW50cy5lbmRwb2ludC5zZWN1cml0eS5taWNyb3NvZnQuY29tL09uZUNvbGxlY3Rvci8xLjBcIixcInZvcnRleFRpY2tldFVybFwiOlwiaHR0cHM6Ly9ldmVudHMuZGF0YS5taWNyb3NvZnQuY29tXCIsXCJwYXJ0bmVyR2VvTG9jYXRpb25cIjpcIkdXX0FVXCIsXCJ2ZXJzaW9uXCI6XCIxLjY4XCJ9Iiwic2lnIjoiSVZZNHpsajZEOHBkMDJlZmpzZUxMcHdRWTEwWmhsdmIvVk05OXlmM0hjRi9uK2hXUlkvUWhlN1d1RzNzdWc0K1U0aHc4OWt6cGVuYjNuMS9jR28veitIc21NdHhEbnBHQUlVUUorVGhueCtHN2ZndlRySG1hOEVlY2hhZTdWT2ZqRWVYanF1Vk5FcjhSWmIvdkt2emRPRDdpb3VuMGNJT2h1NUVIK083RXcvWjBiNHlsVnVHcG5LUHhRR3hndlR5SXhJQUloYk5JYndlY2tSL3N6Q3RBODNFaWxsSXVxck5BN3EwQXZPOWNqbnZhZFlPeUNNVm5PSWkxNDJ3c2oxUDdOZkRwVVNlck5oeDVQM0ViNERGNnhHRXFLTkNkYnNJa0VoUU9RM2ZUclZyQnR1ZForQWg4VEpQZStqZ1BPMkdNVVRiWHl5WmxzQXRwSC9JTjVkbFZRPT0iLCJzaGEyNTZzaWciOiJJVlk0emxqNkQ4cGQwMmVmanNlTExwd1FZMTBaaGx2Yi9WTTk5eWYzSGNGL24raFdSWS9RaGU3V3VHM3N1ZzQrVTRodzg5a3pwZW5iM24xL2NHby96K0hzbU10eERucEdBSVVRSitUaG54K0c3Zmd2VHJIbWE4RWVjaGFlN1ZPZmpFZVhqcXVWTkVyOFJaYi92S3Z6ZE9EN2lvdW4wY0lPaHU1RUgrTzdFdy9aMGI0eWxWdUdwbktQeFFHeGd2VHlJeElBSWhiTklid2Vja1Ivc3pDdEE4M0VpbGxJdXFyTkE3cTBBdk85Y2pudmFkWU95Q01Wbk9JaTE0MndzajFQN05mRHBVU2VyTmh4NVAzRWI0REY2eEdFcUtOQ2Ric0lrRWhRT1EzZlRyVnJCdHVkWitBaDhUSlBlK2pnUE8yR01VVGJYeXlabHNBdHBIL0lONWRsVlE9PSIsImNlcnQiOiJNSUlGZ3pDQ0EydWdBd0lCQWdJVE13QUFBbkM5SlFhVVhkbmJPUUFBQUFBQ2NEQU5CZ2txaGtpRzl3MEJBUXNGQURCK01Rc3dDUVlEVlFRR0V3SlZVekVUTUJFR0ExVUVDQk1LVjJGemFHbHVaM1J2YmpFUU1BNEdBMVVFQnhNSFVtVmtiVzl1WkRFZU1Cd0dBMVVFQ2hNVlRXbGpjbTl6YjJaMElFTnZjbkJ2Y21GMGFXOXVNU2d3SmdZRFZRUURFeDlOYVdOeWIzTnZablFnVTJWamRYSmxJRk5sY25abGNpQkRRU0F5TURFeE1CNFhEVEl6TVRFeE5qRTVOVFF6TjFvWERUSTBNVEV4TmpFNU5UUXpOMW93SGpFY01Cb0dBMVVFQXhNVFUyVjJhV3hzWlM1WGFXNWtiM2R6TG1OdmJUQ0NBU0l3RFFZSktvWklodmNOQVFFQkJRQURnZ0VQQURDQ0FRb0NnZ0VCQU5RWmZOY0ZhZnhTZEIvZWdkQWRTZ09odDFhTWZIZ092Z1ZQNnk2MHNkRnQ2WFRoTjJ1clBWL0plK04zRmR4N3RuVVUzYnJ0N0ZlVUJKVkxTUkZqVWgvbXJubzlSNDVOR082U2U5MnJkSXBnRzlVN0dHbDh2bHNSRjk0cU1XM29CelNCRG9ON0ZhLzhNS3c0QStnckFEdVRvcmZHaDliRHhjcGs2cDhzdjBEVWlnSW9tQnJCNzdXcmtxY1JEckJoWDVIWFpDUk5GUDljN3hnR0tPTEJUYVREYTJVT2wzeTBQMWExOU50Y0JiZ2o1NE14YUhiWUhvL085NDZGdUU4c21DTlNqTGYvbGJnY2NjUzREOHJROG8xcmZRL00rTE5naEFEelpGWW1kY2RSWVh3andLZEE5akpYSjJTUWllY0QwSndSM3RzNk5ZVkNmOXdlbHlGME1mRUNBd0VBQWFPQ0FWZ3dnZ0ZVTUE0R0ExVWREd0VCL3dRRUF3SUZJREFkQmdOVkhTVUVGakFVQmdnckJnRUZCUWNEQVFZSUt3WUJCUVVIQXdJd0RBWURWUjBUQVFIL0JBSXdBREFlQmdOVkhSRUVGekFWZ2hOVFpYWnBiR3hsTGxkcGJtUnZkM011WTI5dE1CMEdBMVVkRGdRV0JCUnBpRnMzRjVaSGtsTk1FY3RnVGZvK1J5WHJxakFmQmdOVkhTTUVHREFXZ0JRMlZvbGxTY3RibXk4OHJFSVdVRTJSdVRQWGtUQlRCZ05WSFI4RVREQktNRWlnUnFCRWhrSm9kSFJ3T2k4dmQzZDNMbTFwWTNKdmMyOW1kQzVqYjIwdmNHdHBiM0J6TDJOeWJDOU5hV05UWldOVFpYSkRRVEl3TVRGZk1qQXhNUzB4TUMweE9DNWpjbXd3WUFZSUt3WUJCUVVIQVFFRVZEQlNNRkFHQ0NzR0FRVUZCekFDaGtSb2RIUndPaTh2ZDNkM0xtMXBZM0p2YzI5bWRDNWpiMjB2Y0d0cGIzQnpMMk5sY25SekwwMXBZMU5sWTFObGNrTkJNakF4TVY4eU1ERXhMVEV3TFRFNExtTnlkREFOQmdrcWhraUc5dzBCQVFzRkFBT0NBZ0VBeHNicjlUQ0VJTXFRTElRdjJQQW8rcWU2TDJXSVFDV1o3aERPcUt2Qzl3ZUo3RFZXbEVpVG9uc2c3bHJSeGNVZTNQQW9lSVZ6cFd0czJaUnc1YnNERWRaMVZON3U2SVp1RXBCOUorUkdYR2hIU0wvSHpiOEhXY2pBVE03UW5XQ05HWEp5T2owbndJaDE4REhOTmxRYUNkOVE1UlZaQkVMbGQ4WGJWYnRSdTJvbEJFbjZFeDA5aXVGR3VhWGMwY3dwN3YyUkh2eXBpaHhpMDk5SGFSMmJuN05lZjRaSFBWbXhubFVFSzZnZFVTWTJNU0dVeHlNRUpldkRpUFk3eTRuU1pJbG5zUGljRmc5NldmV2hQbXlISWFmbEtnVDJid0V5NnBnU1hDcWdHYzNPeEVWZVFUYVlvK0NYZUFZZnRocnY2djVkT1VTL3hQYVExenhEdkVaVDVrOUhCTys1MkZrT1dxaHY2cWxadTB5UW1vMGVhNGg5aVE4ZW05SCsvTGxDUm5HS25KaVFQU3h3bHg4UDVzbGhFTXh0R3JRelpmMmVqZVl6djN2NUV1S1cyUnlYNG1UVG9WeGtIS3FYc1l0dStFVERjY0JobzRLRVd2WjY3NzFmRHAwZjk3Uys2NE5NUVIyL3dMK0ZHS0x5WGxTcFJBRGUxSVJCV1ZCOVRubVZ0MXNpZXgvQlQ2dncyQnZkZmtzenRHRjNKRGE3YzdQdHZ1cldBRWlNRGE3QXFwRG93b1dBd1lYMldKTGNvQTVJUHpUdERUZG0xUkxJTTBUQXVtRlIvbDMwUXRZNlJWMFh1cWZDMGVWNmRlWXNLd2FkdWdKcVFwenhkeHZnSkV4aG83T1p5RzFPclpqSlFQdEl4TnJhSzdTdWtsMnpKSUtDb0hrMTdSaENoZzA9IiwiY2hhaW4iOlsiTUlJRzJEQ0NCTUNnQXdJQkFnSUtZVCszR0FBQUFBQUFCREFOQmdrcWhraUc5dzBCQVFzRkFEQ0JpREVMTUFrR0ExVUVCaE1DVlZNeEV6QVJCZ05WQkFnVENsZGhjMmhwYm1kMGIyNHhFREFPQmdOVkJBY1RCMUpsWkcxdmJtUXhIakFjQmdOVkJBb1RGVTFwWTNKdmMyOW1kQ0JEYjNKd2IzSmhkR2x2YmpFeU1EQUdBMVVFQXhNcFRXbGpjbTl6YjJaMElGSnZiM1FnUTJWeWRHbG1hV05oZEdVZ1FYVjBhRzl5YVhSNUlESXdNVEV3SGhjTk1URXhNREU0TWpJMU5URTVXaGNOTWpZeE1ERTRNak13TlRFNVdqQitNUXN3Q1FZRFZRUUdFd0pWVXpFVE1CRUdBMVVFQ0JNS1YyRnphR2x1WjNSdmJqRVFNQTRHQTFVRUJ4TUhVbVZrYlc5dVpERWVNQndHQTFVRUNoTVZUV2xqY205emIyWjBJRU52Y25CdmNtRjBhVzl1TVNnd0pnWURWUVFERXg5TmFXTnliM052Wm5RZ1UyVmpkWEpsSUZObGNuWmxjaUJEUVNBeU1ERXhNSUlDSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQWc4QU1JSUNDZ0tDQWdFQTBBdkFwS2daZ2VJMjVlS3E1Zk95RlZoMXZyVGxTZkhnaFBtN0RXVHZoY0dCVmJqejUvRnRRRlU5em90cTBZU1Q5WFY4VzZUVWRCREtNdk1qMDY3dXo1NEVXTUxaUjh2UmZBQkJTSEViQVdjWEdLL0cvbk1EZnVUdlE1enZBWEVxSDRFbVEzZVlWRmR6blZVcjhKNk9mUVlPckJ0VTh5YjMrQ01JSW91ZUJoMDNPUDF5MHNybFk4R2FXbjJ5YmJOU3FXN3Byclg4aXpiNW52cjJIRmdibDFhbEVlVzNVdHU3NmZCVXY3VC9MR3k0WFNiT29BclgzNVB0ZjkyczhTeHpHdGtaTjFXNjNTSjRqcUhVbXduNEJ5SXhjYkNVcnVDdzV5WkVWNUNCbHhYT1lleGw0a3Z4aFZJV012aTFlS3ArelUzc2d5R2txSnUrbW1vRTRLTWN6VllZYlAxckwwSSs0amZ5Y3F2UWVITnllOTdzQUZqbElUQ2pDRHFaNzUvRDkzb1dsbVcxdzRHdjlEbHdTYS8ycWZacUFEajV0QWdaNEJvMXBWWjJJbDlxOG1tdVBxMVlSazI0VlBhSlFVUWVjckc4RWlkVDBzSC9zczFRbUI2MTlMdTJ3b0k1MmF3Yjhqc25oR3F3eGlZTDF6b1E1N1BiZk5OV3JGTk1DL283TVRkMDJGa3IrUUI1R1FaNy9Sd2RRdFJCRFM4RkR0VnJTU1AvejgzNGVvTFAyand0MytqWUVnUVl1aDZJZDdpWUh4QUh1OGdGZmdzSnYydmQ0MDVic1BuSGhLWTd5a3lmVzJJcDk4ZWlxSldJY0N6bHdUODhVaU5QUUpyRE1ZV0RMNzhwOFIxUWp5R1dCODd2OG9EQ1JIMmJZdTh2dzNlSnEwVk5VejRDZWRNQ0F3RUFBYU9DQVVzd2dnRkhNQkFHQ1NzR0FRUUJnamNWQVFRREFnRUFNQjBHQTFVZERnUVdCQlEyVm9sbFNjdGJteTg4ckVJV1VFMlJ1VFBYa1RBWkJna3JCZ0VFQVlJM0ZBSUVEQjRLQUZNQWRRQmlBRU1BUVRBTEJnTlZIUThFQkFNQ0FZWXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QWZCZ05WSFNNRUdEQVdnQlJ5TFRvQ01aQkR1UlFGVHVIcXA4Y3gwU09KTkRCYUJnTlZIUjhFVXpCUk1FK2dUYUJMaGtsb2RIUndPaTh2WTNKc0xtMXBZM0p2YzI5bWRDNWpiMjB2Y0d0cEwyTnliQzl3Y205a2RXTjBjeTlOYVdOU2IyOURaWEpCZFhReU1ERXhYekl3TVRGZk1ETmZNakl1WTNKc01GNEdDQ3NHQVFVRkJ3RUJCRkl3VURCT0JnZ3JCZ0VGQlFjd0FvWkNhSFIwY0RvdkwzZDNkeTV0YVdOeWIzTnZablF1WTI5dEwzQnJhUzlqWlhKMGN5OU5hV05TYjI5RFpYSkJkWFF5TURFeFh6SXdNVEZmTUROZk1qSXVZM0owTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElDQVFCQnlHSEI5VnVlUHBFeDhiREd2d2tCdEoyMmtIVFhDZHVtTGcyZnlPZDJORWF2QjJDSlRJR3pQTlgwRWpWMXduT2w5VTJFak11a1hhKy9rdllYQ0ZkQ2xYSmxCWFo1cmU3UnVyZ3VWS05SQjZ4bzZ5RU00eVdCd3MwcThzUC96OEs5U1JpYXgvQ0V4ZmtVdkd1VjVaYnZzMExTVTlWS29CTEVyaEoyVXdsV0RwMzMwNlpKaUZEeWlpeVhJS0srVG5qdkJXVzNTNkVXaU40eHh3aENKSHlrZTU2ZHZHQUFYbUtYNDVQOHAvNWJleVhmNUZOL1M3N21QdkRiQVhsQ0hHNkZiSDIyUkREN3BUZVNrN0tsN2lDdFAxUFZ5ZlFvYTFmQitCMXF0MVlxdGllQkhLWXRuK2YwMERHRGw2Z3F0cXkrRzBIMTVJbGZWdnZhV3ROZWZWV1VFSDVUVi9SS1BVQXF5TDFubjRUaEVPNzkybXNWZ2tuOFJoMy9SUVowbkVJVTdjVTUwN1BOQzRNbmtFTlJrdkpFZ3E1dW1oVVhzaG42eDBWc21BRjd2emVwc0lpa2tydzRPT0FkNUh5WG1Cb3VYKzg0WmJjMUw3MS9UeUg2eEl6U2J3YjVTVFhxM3lBUEphcnFZS3NzSDB1Si9MZjZYRlNRU3o2aUtFOXM1Rkpsd2YyUUhJV0NpRzdwcGxYZElTaDVSYkFVNVFyTTVsL0V1OXRoTkdtZnJDWTQ5OEVwUVFnVkxreWc5L2tNUHQ1ZnF3Z0pMWU9zckRTRFl2VEpTVUtKSmJWdXNrZkZzem1nc1NBYkxMR09CRytsTUVrYzBFYnBRRnYwclc2NjI0SktoeEpLZ0FsTjI5OTJ1UVZiRytDN0lIQmZBQ1hIMHc3NkZxMTdJcDV4Q0E9PSIsIk1JSUY3VENDQTlXZ0F3SUJBZ0lRUDR2SXRmeWZzcFpEdFduV2JFTGhSREFOQmdrcWhraUc5dzBCQVFzRkFEQ0JpREVMTUFrR0ExVUVCaE1DVlZNeEV6QVJCZ05WQkFnVENsZGhjMmhwYm1kMGIyNHhFREFPQmdOVkJBY1RCMUpsWkcxdmJtUXhIakFjQmdOVkJBb1RGVTFwWTNKdmMyOW1kQ0JEYjNKd2IzSmhkR2x2YmpFeU1EQUdBMVVFQXhNcFRXbGpjbTl6YjJaMElGSnZiM1FnUTJWeWRHbG1hV05oZEdVZ1FYVjBhRzl5YVhSNUlESXdNVEV3SGhjTk1URXdNekl5TWpJd05USTRXaGNOTXpZd016SXlNakl4TXpBMFdqQ0JpREVMTUFrR0ExVUVCaE1DVlZNeEV6QVJCZ05WQkFnVENsZGhjMmhwYm1kMGIyNHhFREFPQmdOVkJBY1RCMUpsWkcxdmJtUXhIakFjQmdOVkJBb1RGVTFwWTNKdmMyOW1kQ0JEYjNKd2IzSmhkR2x2YmpFeU1EQUdBMVVFQXhNcFRXbGpjbTl6YjJaMElGSnZiM1FnUTJWeWRHbG1hV05oZEdVZ1FYVjBhRzl5YVhSNUlESXdNVEV3Z2dJaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQ0R3QXdnZ0lLQW9JQ0FRQ3lnRUdxTlRoTkUzSXlhQ0pOdUxMeC85VlN2R3pIOWRKS2pEYnUwY0pjZm95S3JxOFRLRy9BYytNNnp0QWxxRm82YmUrb3VGbXJFeU5velF3cGg5RnZnRnlQUkg5ZGtBRlNXS3hSeFY4cWg5emMyQW9kd1FPNWU3Qlc2S1BlWkdIQ252anpmTG5zRGJWVS9reTJaVStJOEp4SW1ReENDd2w4TVZrWGVRWjRLSTJKT2t3REpiNXhhbHdMNTRSZ3BKa2k0OUt2aEtTbis5R1k3UXlwM3BTSjRRNmczTURPbVQzcUNGSzdWbm5rSDRTNkhyaTB4RWxjVHpGTGg5M2RCV2NtbVlEZ2NSR2p1S1ZCNHFSVHVmY3lLWU1NRTc4MlhnU3pTME5ITDJ2aWtSN1RtRS9kUWdmSTZCMFMvSm1wYXo2U2ZzaldhVHI4WkwyMkNaM0svUXdMb3B0M1lFc0RsS1F3YVJMV1FpM0JRVXpLM0tyOWoxdURScHJaL0xIUjQ3UEpmMGg2elNUd1FZOWNkTkNzc0JBZ0JrbTN4eTBoeUZmajBJYnpBMmo3ME01eHdZbVpTbVFCYlAzc01KSFBRVHlTeCtXNmhoMWhoTWRmZ3psaXJyU1NMMGZ6Qy9oVjY2QWZXZEM3ZEpzZTBIYm04dWtHMXhEbyttVGVhY1kxbG9nQzhFYTRQeWVaYjh0eGlTazE5MGdXQWpXUDFYbDhUUUxQWCt1S2cwOUZjWWo1cVExT2N1bkNuQWZQU1J0T0JBNWpVWXhlMkFEQlZTeTJ4dURDWlU3Sk5EbjFuTFBFZnVoaGJoTmZGY1JmMlg3dEhjN3VST3pMTG9heDdEajJjTzJyWEJQQjJROE54NEN5VmUwMDk2eWI1TVBhNTBjOHByV1BNZC9GUzYvcjhRSURBUUFCbzFFd1R6QUxCZ05WSFE4RUJBTUNBWVl3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVY2kwNkFqR1FRN2tVQlU3aDZxZkhNZEVqaVRRd0VBWUpLd1lCQkFHQ054VUJCQU1DQVFBd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dJQkFIOXl6dyszeFJYYm04Qkp5aVpiL3A0VDV0UHcwdHVYWC9KTFAwMnpyaG11N2RlWG9LenZxVHFqd2tHdzViaVJuaE9CSkFQbUNmMC9WMEE1SVNSVzBSQXZTMENwTm9aTHRGTlhtdnZ4Zm9tUEVmNFliRkdxNk8wSmxiWGxjY21oNllkMXBoVi95WDQzVkY1MGs4WERaOHdOVDJ1b0Z3eHRDSkoraTkyQnFpMXdJY005QmhTN3Z5UmVwNFRYUHc4aElyMUxBQWJibHh6WVh0VEZDMXlIYmxDazZNTTRwUHZMTE1XU1pwdUZYc3Q2YkpOOGdDbFlXMWUxUUdtNkNIbW1aR0lWblllV1JiVm1JeUFEaXh4em9OT2llVFBnVUZtRzJ5L2xBaVhxY3lxZkFCVElOc2VTTytsT0FPellWZ201TTBrUzBsUUxBYXVzUjdhUktYMU10SFdBVWdIb3lvTDJuOHlzbkk4WDZpOG1zS3R5ckF2K25sRWV4ME5WWjA5UnMxZld0dXp1VXJjNjZVN2gxNEdJdkUrT2RidExxUEExcWliVVoyZEpzbkJNTzVQY0hkOTRrSVp5c2ppazBkeVNUY2xZNnlzU1hOUTdyb3hyc0lQbEFULzRDVEwya3pVMElxL2ROdzEzQ1lBcnpVZ0E4WXlaR1VjRkFlblJ2OUZPME9Zb1F6ZVpwQXBLQ05tYWNYUFNxczB4RTJOMm9UZHZramdlZlJJOFpqTG55MjNoL0ZLSjNjcldaZ1dhbG1HK29pakhIS09uTmxBOE9xVGZTbTdtaHp2TzYvRGdnVGVkRXp4U2pyMjVIVFRHSGRVS2FqMllLWENNaVNyUnE0SVFTQi9jOU8rbHhidFZHamhqaEU2M2JLMlZWT3hsSWhCSkY3akFIc2NQckZSSCJdfTwvc3RyaW5nPgogICAgICAgICAgICA8L2RpY3Q+CiAgICAgICAgPC9hcnJheT4KICAgIDwvZGljdD4KPC9wbGlzdD4K\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "faeed813-dbd1-4996-9123-e30204a81f4d"
    },
    {
        "Name":  "Defender Protection Settings",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCustomConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Defender Protection Settings\",\r\n    \"payloadName\":  \"defendersettings\",\r\n    \"payloadFileName\":  \"defendersettings.xml\",\r\n    \"payload\":  \"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KICAgIDxkaWN0PgogICAgICAgIDxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KICAgICAgICA8c3RyaW5nPkM0RTZBNzgyLTBDOEQtNDRBQi1BMDI1LUVCODkzOTg3QTI5NTwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZFR5cGU8L2tleT4KICAgICAgICA8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KICAgICAgICA8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KICAgICAgICA8c3RyaW5nPk1pY3Jvc29mdDwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KICAgICAgICA8c3RyaW5nPmNvbS5taWNyb3NvZnQud2Rhdjwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+CiAgICAgICAgPHN0cmluZz5NaWNyb3NvZnQgRGVmZW5kZXIgZm9yIEVuZHBvaW50IHNldHRpbmdzPC9zdHJpbmc+CiAgICAgICAgPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KICAgICAgICA8c3RyaW5nPk1pY3Jvc29mdCBEZWZlbmRlciBmb3IgRW5kcG9pbnQgY29uZmlndXJhdGlvbiBzZXR0aW5nczwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KICAgICAgICA8aW50ZWdlcj4xPC9pbnRlZ2VyPgogICAgICAgIDxrZXk+UGF5bG9hZEVuYWJsZWQ8L2tleT4KICAgICAgICA8dHJ1ZS8+CiAgICAgICAgPGtleT5QYXlsb2FkUmVtb3ZhbERpc2FsbG93ZWQ8L2tleT4KICAgICAgICA8dHJ1ZS8+CiAgICAgICAgPGtleT5QYXlsb2FkU2NvcGU8L2tleT4KICAgICAgICA8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgogICAgICAgIDxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KICAgICAgICA8YXJyYXk+CiAgICAgICAgICAgIDxkaWN0PgogICAgICAgICAgICAgICAgPGtleT5QYXlsb2FkVVVJRDwva2V5PgogICAgICAgICAgICAgICAgPHN0cmluZz45OURCQzJCQy0zQjNBLTQ2QTItQTQxMy1DOEY5QkI5QTcyOTU8L3N0cmluZz4KICAgICAgICAgICAgICAgIDxrZXk+UGF5bG9hZFR5cGU8L2tleT4KICAgICAgICAgICAgICAgIDxzdHJpbmc+Y29tLm1pY3Jvc29mdC53ZGF2PC9zdHJpbmc+CiAgICAgICAgICAgICAgICA8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KICAgICAgICAgICAgICAgIDxzdHJpbmc+TWljcm9zb2Z0PC9zdHJpbmc+CiAgICAgICAgICAgICAgICA8a2V5PlBheWxvYWRJZGVudGlmaWVyPC9rZXk+CiAgICAgICAgICAgICAgICA8c3RyaW5nPmNvbS5taWNyb3NvZnQud2Rhdjwvc3RyaW5nPgogICAgICAgICAgICAgICAgPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KICAgICAgICAgICAgICAgIDxzdHJpbmc+TWljcm9zb2Z0IERlZmVuZGVyIGZvciBFbmRwb2ludCBjb25maWd1cmF0aW9uIHNldHRpbmdzPC9zdHJpbmc+CiAgICAgICAgICAgICAgICA8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5PgogICAgICAgICAgICAgICAgPHN0cmluZy8+CiAgICAgICAgICAgICAgICA8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CiAgICAgICAgICAgICAgICA8aW50ZWdlcj4xPC9pbnRlZ2VyPgogICAgICAgICAgICAgICAgPGtleT5QYXlsb2FkRW5hYmxlZDwva2V5PgogICAgICAgICAgICAgICAgPHRydWUvPgogICAgICAgICAgICAgICAgPGtleT5hbnRpdmlydXNFbmdpbmU8L2tleT4KICAgICAgICAgICAgICAgIDxkaWN0PgogICAgICAgICAgICAgICAgICAgIDxrZXk+ZW5mb3JjZW1lbnRMZXZlbDwva2V5PgogICAgICAgICAgICAgICAgICAgIDxzdHJpbmc+cmVhbF90aW1lPC9zdHJpbmc+CiAgICAgICAgICAgICAgICAgICAgPGtleT50aHJlYXRUeXBlU2V0dGluZ3M8L2tleT4KICAgICAgICAgICAgICAgICAgICA8YXJyYXk+CiAgICAgICAgICAgICAgICAgICAgICAgIDxkaWN0PgogICAgICAgICAgICAgICAgICAgICAgICAgICAgPGtleT5rZXk8L2tleT4KICAgICAgICAgICAgICAgICAgICAgICAgICAgIDxzdHJpbmc+cG90ZW50aWFsbHlfdW53YW50ZWRfYXBwbGljYXRpb248L3N0cmluZz4KICAgICAgICAgICAgICAgICAgICAgICAgICAgIDxrZXk+dmFsdWU8L2tleT4KICAgICAgICAgICAgICAgICAgICAgICAgICAgIDxzdHJpbmc+YmxvY2s8L3N0cmluZz4KICAgICAgICAgICAgICAgICAgICAgICAgPC9kaWN0PgogICAgICAgICAgICAgICAgICAgICAgICA8ZGljdD4KICAgICAgICAgICAgICAgICAgICAgICAgICAgIDxrZXk+a2V5PC9rZXk+CiAgICAgICAgICAgICAgICAgICAgICAgICAgICA8c3RyaW5nPmFyY2hpdmVfYm9tYjwvc3RyaW5nPgogICAgICAgICAgICAgICAgICAgICAgICAgICAgPGtleT52YWx1ZTwva2V5PgogICAgICAgICAgICAgICAgICAgICAgICAgICAgPHN0cmluZz5hdWRpdDwvc3RyaW5nPgogICAgICAgICAgICAgICAgICAgICAgICA8L2RpY3Q+CiAgICAgICAgICAgICAgICAgICAgPC9hcnJheT4KICAgICAgICAgICAgICAgIDwvZGljdD4KICAgICAgICAgICAgICAgIDxrZXk+Y2xvdWRTZXJ2aWNlPC9rZXk+CiAgICAgICAgICAgICAgICA8ZGljdD4KICAgICAgICAgICAgICAgICAgICA8a2V5PmVuYWJsZWQ8L2tleT4KICAgICAgICAgICAgICAgICAgICA8dHJ1ZS8+CiAgICAgICAgICAgICAgICAgICAgPGtleT5hdXRvbWF0aWNTYW1wbGVTdWJtaXNzaW9uPC9rZXk+CiAgICAgICAgICAgICAgICAgICAgPHRydWUvPgogICAgICAgICAgICAgICAgICAgIDxrZXk+YXV0b21hdGljRGVmaW5pdGlvblVwZGF0ZUVuYWJsZWQ8L2tleT4KICAgICAgICAgICAgICAgICAgICA8dHJ1ZS8+CiAgICAgICAgICAgICAgICA8L2RpY3Q+CiAgICAgICAgICAgICAgICA8a2V5PnRhbXBlclByb3RlY3Rpb248L2tleT4KICAgICAgICAgICAgICAgIDxkaWN0PgogICAgICAgICAgICAgICAgICAgIDxrZXk+ZW5mb3JjZW1lbnRMZXZlbDwva2V5PgogICAgICAgICAgICAgICAgICAgIDxzdHJpbmc+YmxvY2s8L3N0cmluZz4KICAgICAgICAgICAgICAgIDwvZGljdD4KICAgICAgICAgICAgPC9kaWN0PgogICAgICAgIDwvYXJyYXk+CiAgICA8L2RpY3Q+CjwvcGxpc3Q+\",\r\n    \"deploymentChannel\":  \"deviceChannel\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "85b52786-72f1-4611-842b-f4d714a2ecda"
    },
    {
        "Name":  "iOS device restriction to block Game Center",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.iosGeneralDeviceConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  \"\",\r\n    \"displayName\":  \"iOS device restriction to block Game Center\",\r\n    \"accountBlockModification\":  false,\r\n    \"activationLockAllowWhenSupervised\":  false,\r\n    \"airDropBlocked\":  false,\r\n    \"airDropForceUnmanagedDropTarget\":  false,\r\n    \"airPlayForcePairingPasswordForOutgoingRequests\":  false,\r\n    \"appleWatchBlockPairing\":  false,\r\n    \"appleWatchForceWristDetection\":  false,\r\n    \"appleNewsBlocked\":  false,\r\n    \"appsVisibilityListType\":  \"none\",\r\n    \"appStoreBlockAutomaticDownloads\":  false,\r\n    \"appStoreBlocked\":  false,\r\n    \"appStoreBlockInAppPurchases\":  false,\r\n    \"appStoreBlockUIAppInstallation\":  false,\r\n    \"appStoreRequirePassword\":  false,\r\n    \"autoFillForceAuthentication\":  false,\r\n    \"bluetoothBlockModification\":  false,\r\n    \"cameraBlocked\":  false,\r\n    \"cellularBlockDataRoaming\":  false,\r\n    \"cellularBlockGlobalBackgroundFetchWhileRoaming\":  false,\r\n    \"cellularBlockPerAppDataModification\":  false,\r\n    \"cellularBlockPersonalHotspot\":  false,\r\n    \"cellularBlockPlanModification\":  false,\r\n    \"cellularBlockVoiceRoaming\":  false,\r\n    \"certificatesBlockUntrustedTlsCertificates\":  false,\r\n    \"classroomAppBlockRemoteScreenObservation\":  false,\r\n    \"classroomAppForceUnpromptedScreenObservation\":  false,\r\n    \"classroomForceAutomaticallyJoinClasses\":  false,\r\n    \"classroomForceUnpromptedAppAndDeviceLock\":  false,\r\n    \"compliantAppListType\":  \"none\",\r\n    \"configurationProfileBlockChanges\":  false,\r\n    \"definitionLookupBlocked\":  false,\r\n    \"deviceBlockEnableRestrictions\":  false,\r\n    \"deviceBlockEraseContentAndSettings\":  false,\r\n    \"deviceBlockNameModification\":  false,\r\n    \"diagnosticDataBlockSubmission\":  false,\r\n    \"diagnosticDataBlockSubmissionModification\":  false,\r\n    \"documentsBlockManagedDocumentsInUnmanagedApps\":  false,\r\n    \"documentsBlockUnmanagedDocumentsInManagedApps\":  false,\r\n    \"emailInDomainSuffixes\":  [\r\n\r\n                              ],\r\n    \"enterpriseAppBlockTrust\":  false,\r\n    \"enterpriseAppBlockTrustModification\":  false,\r\n    \"esimBlockModification\":  false,\r\n    \"faceTimeBlocked\":  false,\r\n    \"findMyFriendsBlocked\":  false,\r\n    \"gamingBlockGameCenterFriends\":  false,\r\n    \"gamingBlockMultiplayer\":  false,\r\n    \"gameCenterBlocked\":  false,\r\n    \"hostPairingBlocked\":  false,\r\n    \"iBooksStoreBlocked\":  false,\r\n    \"iBooksStoreBlockErotica\":  false,\r\n    \"iCloudBlockActivityContinuation\":  false,\r\n    \"iCloudBlockBackup\":  false,\r\n    \"iCloudBlockDocumentSync\":  false,\r\n    \"iCloudBlockManagedAppsSync\":  false,\r\n    \"iCloudBlockPhotoLibrary\":  false,\r\n    \"iCloudBlockPhotoStreamSync\":  false,\r\n    \"iCloudBlockSharedPhotoStream\":  false,\r\n    \"iCloudRequireEncryptedBackup\":  false,\r\n    \"iTunesBlockExplicitContent\":  false,\r\n    \"iTunesBlockMusicService\":  false,\r\n    \"iTunesBlockRadio\":  false,\r\n    \"keyboardBlockAutoCorrect\":  false,\r\n    \"keyboardBlockDictation\":  false,\r\n    \"keyboardBlockPredictive\":  false,\r\n    \"keyboardBlockShortcuts\":  false,\r\n    \"keyboardBlockSpellCheck\":  false,\r\n    \"kioskModeAllowAssistiveSpeak\":  false,\r\n    \"kioskModeAllowAssistiveTouchSettings\":  false,\r\n    \"kioskModeAllowAutoLock\":  false,\r\n    \"kioskModeBlockAutoLock\":  false,\r\n    \"kioskModeAllowColorInversionSettings\":  false,\r\n    \"kioskModeAllowRingerSwitch\":  false,\r\n    \"kioskModeBlockRingerSwitch\":  false,\r\n    \"kioskModeAllowScreenRotation\":  false,\r\n    \"kioskModeBlockScreenRotation\":  false,\r\n    \"kioskModeAllowSleepButton\":  false,\r\n    \"kioskModeBlockSleepButton\":  false,\r\n    \"kioskModeAllowTouchscreen\":  false,\r\n    \"kioskModeBlockTouchscreen\":  false,\r\n    \"kioskModeEnableVoiceControl\":  false,\r\n    \"kioskModeAllowVoiceControlModification\":  false,\r\n    \"kioskModeAllowVoiceOverSettings\":  false,\r\n    \"kioskModeAllowVolumeButtons\":  false,\r\n    \"kioskModeBlockVolumeButtons\":  false,\r\n    \"kioskModeAllowZoomSettings\":  false,\r\n    \"kioskModeAppStoreUrl\":  null,\r\n    \"kioskModeBuiltInAppId\":  null,\r\n    \"kioskModeRequireAssistiveTouch\":  false,\r\n    \"kioskModeRequireColorInversion\":  false,\r\n    \"kioskModeRequireMonoAudio\":  false,\r\n    \"kioskModeRequireVoiceOver\":  false,\r\n    \"kioskModeRequireZoom\":  false,\r\n    \"kioskModeManagedAppId\":  null,\r\n    \"lockScreenBlockControlCenter\":  false,\r\n    \"lockScreenBlockNotificationView\":  false,\r\n    \"lockScreenBlockPassbook\":  false,\r\n    \"lockScreenBlockTodayView\":  false,\r\n    \"mediaContentRatingAustralia\":  null,\r\n    \"mediaContentRatingCanada\":  null,\r\n    \"mediaContentRatingFrance\":  null,\r\n    \"mediaContentRatingGermany\":  null,\r\n    \"mediaContentRatingIreland\":  null,\r\n    \"mediaContentRatingJapan\":  null,\r\n    \"mediaContentRatingNewZealand\":  null,\r\n    \"mediaContentRatingUnitedKingdom\":  null,\r\n    \"mediaContentRatingUnitedStates\":  null,\r\n    \"mediaContentRatingApps\":  \"allAllowed\",\r\n    \"messagesBlocked\":  false,\r\n    \"notificationsBlockSettingsModification\":  false,\r\n    \"passcodeBlockFingerprintUnlock\":  false,\r\n    \"passcodeBlockFingerprintModification\":  false,\r\n    \"passcodeBlockModification\":  false,\r\n    \"passcodeBlockSimple\":  false,\r\n    \"passcodeExpirationDays\":  null,\r\n    \"passcodeMinimumLength\":  null,\r\n    \"passcodeMinutesOfInactivityBeforeLock\":  null,\r\n    \"passcodeMinutesOfInactivityBeforeScreenTimeout\":  null,\r\n    \"passcodeMinimumCharacterSetCount\":  null,\r\n    \"passcodePreviousPasscodeBlockCount\":  null,\r\n    \"passcodeSignInFailureCountBeforeWipe\":  null,\r\n    \"passcodeRequiredType\":  \"deviceDefault\",\r\n    \"passcodeRequired\":  false,\r\n    \"podcastsBlocked\":  false,\r\n    \"proximityBlockSetupToNewDevice\":  false,\r\n    \"safariBlockAutofill\":  false,\r\n    \"safariBlockJavaScript\":  false,\r\n    \"safariBlockPopups\":  false,\r\n    \"safariBlocked\":  false,\r\n    \"safariCookieSettings\":  \"browserDefault\",\r\n    \"safariManagedDomains\":  [\r\n\r\n                             ],\r\n    \"safariPasswordAutoFillDomains\":  [\r\n\r\n                                      ],\r\n    \"safariRequireFraudWarning\":  false,\r\n    \"screenCaptureBlocked\":  false,\r\n    \"siriBlocked\":  false,\r\n    \"siriBlockedWhenLocked\":  false,\r\n    \"siriBlockUserGeneratedContent\":  false,\r\n    \"siriRequireProfanityFilter\":  false,\r\n    \"softwareUpdatesEnforcedDelayInDays\":  null,\r\n    \"softwareUpdatesForceDelayed\":  false,\r\n    \"spotlightBlockInternetResults\":  false,\r\n    \"voiceDialingBlocked\":  false,\r\n    \"wallpaperBlockModification\":  false,\r\n    \"wiFiConnectOnlyToConfiguredNetworks\":  false,\r\n    \"classroomForceRequestPermissionToLeaveClasses\":  false,\r\n    \"keychainBlockCloudSync\":  false,\r\n    \"pkiBlockOTAUpdates\":  false,\r\n    \"privacyForceLimitAdTracking\":  false,\r\n    \"enterpriseBookBlockBackup\":  false,\r\n    \"enterpriseBookBlockMetadataSync\":  false,\r\n    \"airPrintBlocked\":  false,\r\n    \"airPrintBlockCredentialsStorage\":  false,\r\n    \"airPrintForceTrustedTLS\":  false,\r\n    \"airPrintBlockiBeaconDiscovery\":  false,\r\n    \"filesNetworkDriveAccessBlocked\":  false,\r\n    \"filesUsbDriveAccessBlocked\":  false,\r\n    \"wifiPowerOnForced\":  false,\r\n    \"blockSystemAppRemoval\":  false,\r\n    \"vpnBlockCreation\":  false,\r\n    \"appRemovalBlocked\":  false,\r\n    \"usbRestrictedModeBlocked\":  false,\r\n    \"passwordBlockAutoFill\":  false,\r\n    \"passwordBlockProximityRequests\":  false,\r\n    \"passwordBlockAirDropSharing\":  false,\r\n    \"dateAndTimeForceSetAutomatically\":  false,\r\n    \"contactsAllowManagedToUnmanagedWrite\":  false,\r\n    \"contactsAllowUnmanagedToManagedRead\":  false,\r\n    \"cellularBlockPersonalHotspotModification\":  false,\r\n    \"continuousPathKeyboardBlocked\":  false,\r\n    \"findMyDeviceInFindMyAppBlocked\":  false,\r\n    \"findMyFriendsInFindMyAppBlocked\":  false,\r\n    \"iTunesBlocked\":  false,\r\n    \"sharedDeviceBlockTemporarySessions\":  false,\r\n    \"appClipsBlocked\":  false,\r\n    \"applePersonalizedAdsBlocked\":  false,\r\n    \"nfcBlocked\":  false,\r\n    \"autoUnlockBlocked\":  false,\r\n    \"unpairedExternalBootToRecoveryAllowed\":  false,\r\n    \"onDeviceOnlyDictationForced\":  false,\r\n    \"wiFiConnectToAllowedNetworksOnlyForced\":  false,\r\n    \"onDeviceOnlyTranslationForced\":  false,\r\n    \"managedPasteboardRequired\":  false,\r\n    \"iCloudPrivateRelayBlocked\":  false,\r\n    \"kioskModeAppType\":  \"notConfigured\",\r\n    \"appsSingleAppModeList\":  [\r\n\r\n                              ],\r\n    \"appsVisibilityList\":  [\r\n\r\n                           ],\r\n    \"compliantAppsList\":  [\r\n\r\n                          ],\r\n    \"networkUsageRules\":  [\r\n\r\n                          ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "5440b0be-7da5-4898-84c7-45db42f3c936"
    },
    {
        "Name":  "Lockscreen Message",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSDeviceFeaturesConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"Lockscreen Message\",\r\n    \"adminShowHostInfo\":  false,\r\n    \"loginWindowText\":  \"This Device Is Managed By COBTECH - If Found Contact +61434239585\",\r\n    \"authorizedUsersListHidden\":  false,\r\n    \"authorizedUsersListHideLocalUsers\":  false,\r\n    \"authorizedUsersListHideMobileAccounts\":  false,\r\n    \"authorizedUsersListIncludeNetworkUsers\":  false,\r\n    \"authorizedUsersListHideAdminUsers\":  false,\r\n    \"authorizedUsersListShowOtherManagedUsers\":  false,\r\n    \"shutDownDisabled\":  false,\r\n    \"restartDisabled\":  false,\r\n    \"sleepDisabled\":  false,\r\n    \"consoleAccessDisabled\":  false,\r\n    \"shutDownDisabledWhileLoggedIn\":  false,\r\n    \"restartDisabledWhileLoggedIn\":  false,\r\n    \"powerOffDisabledWhileLoggedIn\":  false,\r\n    \"logOutDisabledWhileLoggedIn\":  false,\r\n    \"screenLockDisableImmediate\":  false,\r\n    \"singleSignOnExtension\":  null,\r\n    \"macOSSingleSignOnExtension\":  null,\r\n    \"contentCachingEnabled\":  false,\r\n    \"contentCachingType\":  \"notConfigured\",\r\n    \"contentCachingMaxSizeBytes\":  null,\r\n    \"contentCachingDataPath\":  null,\r\n    \"contentCachingDisableConnectionSharing\":  false,\r\n    \"contentCachingForceConnectionSharing\":  false,\r\n    \"contentCachingClientPolicy\":  \"notConfigured\",\r\n    \"contentCachingPeerPolicy\":  \"notConfigured\",\r\n    \"contentCachingParentSelectionPolicy\":  \"notConfigured\",\r\n    \"contentCachingParents\":  [\r\n\r\n                              ],\r\n    \"contentCachingLogClientIdentities\":  false,\r\n    \"contentCachingBlockDeletion\":  false,\r\n    \"contentCachingShowAlerts\":  false,\r\n    \"contentCachingKeepAwake\":  false,\r\n    \"contentCachingPort\":  null,\r\n    \"airPrintDestinations\":  [\r\n\r\n                             ],\r\n    \"autoLaunchItems\":  [\r\n\r\n                        ],\r\n    \"associatedDomains\":  [\r\n\r\n                          ],\r\n    \"appAssociatedDomains\":  [\r\n\r\n                             ],\r\n    \"contentCachingClientListenRanges\":  [\r\n\r\n                                         ],\r\n    \"contentCachingPeerListenRanges\":  [\r\n\r\n                                       ],\r\n    \"contentCachingPeerFilterRanges\":  [\r\n\r\n                                       ],\r\n    \"contentCachingPublicRanges\":  [\r\n\r\n                                   ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "1e504c26-f685-453d-b27a-fd9f6398ac88"
    },
    {
        "Name":  "30 Minute Config Refresh",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"30 Minute Config Refresh\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  1,\r\n    \"technologies\":  \"mdm\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"\",\r\n                              \"templateFamily\":  \"none\",\r\n                              \"templateDisplayName\":  null,\r\n                              \"templateDisplayVersion\":  null\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_dmclient_provider_{providerid}\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"groupSettingCollectionValue\":  [\r\n                                                                                     {\r\n                                                                                         \"settingValueTemplateReference\":  null,\r\n                                                                                         \"children\":  [\r\n                                                                                                          {\r\n                                                                                                              \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                                                                              \"settingDefinitionId\":  \"device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled\",\r\n                                                                                                              \"settingInstanceTemplateReference\":  null,\r\n                                                                                                              \"choiceSettingValue\":  {\r\n                                                                                                                                         \"settingValueTemplateReference\":  null,\r\n                                                                                                                                         \"value\":  \"device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled_true\",\r\n                                                                                                                                         \"children\":  [\r\n\r\n                                                                                                                                                      ]\r\n                                                                                                                                     }\r\n                                                                                                          },\r\n                                                                                                          {\r\n                                                                                                              \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                              \"settingDefinitionId\":  \"device_vendor_msft_dmclient_provider_{providerid}_configrefresh_cadence\",\r\n                                                                                                              \"settingInstanceTemplateReference\":  null,\r\n                                                                                                              \"simpleSettingValue\":  {\r\n                                                                                                                                         \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                                         \"settingValueTemplateReference\":  null,\r\n                                                                                                                                         \"value\":  30\r\n                                                                                                                                     }\r\n                                                                                                          }\r\n                                                                                                      ]\r\n                                                                                     }\r\n                                                                                 ]\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Add",
        "PolicyID":  "aadc24fa-088c-4dd8-8214-b1186aa1f8f8"
    },
    {
        "Name":  "Microsoft Apps Autoupdate",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"Microsoft Apps Autoupdate\",\r\n    \"platforms\":  \"macOS\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  3,\r\n    \"technologies\":  \"mdm,appleRemoteManagement\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"\",\r\n                              \"templateFamily\":  \"none\",\r\n                              \"templateDisplayName\":  null,\r\n                              \"templateDisplayVersion\":  null\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.managedclient.preferences_howtocheck\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"com.apple.managedclient.preferences_howtocheck_0\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.managedclient.preferences_enablecheckforupdatesbutton\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"com.apple.managedclient.preferences_enablecheckforupdatesbutton_true\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.managedclient.preferences_updateroptimization\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"com.apple.managedclient.preferences_updateroptimization_2\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Add",
        "PolicyID":  "bb6b58e9-e6ad-4d0a-8056-f7642e09f4b2"
    },
    {
        "Name":  "One Drive Settings",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"One Drive Settings\",\r\n    \"platforms\":  \"macOS\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  5,\r\n    \"technologies\":  \"mdm,appleRemoteManagement\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"\",\r\n                              \"templateFamily\":  \"none\",\r\n                              \"templateDisplayName\":  null,\r\n                              \"templateDisplayVersion\":  null\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.managedclient.preferences_kfmsilentoptin\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"db2ad788-3fbe-4c72-b8ba-0c9edcb57c4b\"\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.managedclient.preferences_disabletutorial\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"com.apple.managedclient.preferences_disabletutorial_true\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.managedclient.preferences_filesondemandenabled\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"com.apple.managedclient.preferences_filesondemandenabled_true\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.managedclient.preferences_enableallocsiclients\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"com.apple.managedclient.preferences_enableallocsiclients_true\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.managedclient.preferences_openatlogin\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"com.apple.managedclient.preferences_openatlogin_true\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Add",
        "PolicyID":  "de6dbf47-3c3d-4de3-848a-47e84fc1f2b1"
    },
    {
        "Name":  "Set account lockout threshold to 5 or lower in macOS",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"Set account lockout threshold to 5 or lower in macOS\",\r\n    \"platforms\":  \"macOS\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  1,\r\n    \"technologies\":  \"mdm,appleRemoteManagement\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"\",\r\n                              \"templateFamily\":  \"none\",\r\n                              \"templateDisplayName\":  null,\r\n                              \"templateDisplayVersion\":  null\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance\",\r\n                                                 \"settingDefinitionId\":  \"com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"groupSettingCollectionValue\":  [\r\n                                                                                     {\r\n                                                                                         \"settingValueTemplateReference\":  null,\r\n                                                                                         \"children\":  [\r\n                                                                                                          {\r\n                                                                                                              \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                              \"settingDefinitionId\":  \"com.apple.mobiledevice.passwordpolicy_maxfailedattempts\",\r\n                                                                                                              \"settingInstanceTemplateReference\":  null,\r\n                                                                                                              \"simpleSettingValue\":  {\r\n                                                                                                                                         \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                                         \"settingValueTemplateReference\":  null,\r\n                                                                                                                                         \"value\":  5\r\n                                                                                                                                     }\r\n                                                                                                          },\r\n                                                                                                          {\r\n                                                                                                              \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                              \"settingDefinitionId\":  \"com.apple.mobiledevice.passwordpolicy_minutesuntilfailedloginreset\",\r\n                                                                                                              \"settingInstanceTemplateReference\":  null,\r\n                                                                                                              \"simpleSettingValue\":  {\r\n                                                                                                                                         \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                                         \"settingValueTemplateReference\":  null,\r\n                                                                                                                                         \"value\":  30\r\n                                                                                                                                     }\r\n                                                                                                          }\r\n                                                                                                      ]\r\n                                                                                     }\r\n                                                                                 ]\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Add",
        "PolicyID":  "9442aacc-f6a3-42dd-9d69-220e7b314d48"
    },
    {
        "Name":  "Win - OIB - Windows LAPS - D - LAPS Configuration - v3.0",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"Win - OIB - Windows LAPS - D - LAPS Configuration - v3.0\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  5,\r\n    \"technologies\":  \"mdm\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1\",\r\n                              \"templateFamily\":  \"endpointSecurityAccountProtection\",\r\n                              \"templateDisplayName\":  \"Local admin password solution (Windows LAPS)\",\r\n                              \"templateDisplayVersion\":  \"Version 1\"\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_backupdirectory\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"a3270f64-e493-499d-8900-90290f61ed8a\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"device_vendor_msft_laps_policies_backupdirectory_1\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"4d90f03d-e14c-43c4-86da-681da96a2f92\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_passwordagedays_aad\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  7\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_passwordcomplexity\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"8a7459e8-1d1c-458a-8906-7b27d216de52\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"device_vendor_msft_laps_policies_passwordcomplexity_4\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"aa883ab5-625e-4e3b-b830-a37a4bb8ce01\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_passwordlength\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"da7a1dbd-caf7-4341-ab63-ece6f994ff02\"\r\n                                                                                      },\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                            \"value\":  21,\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"d08f1266-5345-4f53-8ae1-4c20e6cb5ec9\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              }\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_postauthenticationactions\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"d9282eb1-d187-42ae-b366-7081f32dcfff\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"device_vendor_msft_laps_policies_postauthenticationactions_3\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"68ff4f78-baa8-4b32-bf3d-5ad5566d8142\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_postauthenticationresetdelay\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"a9e21166-4055-4042-9372-efaf3ef41868\"\r\n                                                                                      },\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                            \"value\":  1,\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"0deb6aee-8dac-40c4-a9dd-c3718e5c1d52\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              }\r\n                                                                        }\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Add",
        "PolicyID":  "745d8146-3f37-4e60-a026-786da53d77f6"
    },
    {
        "Name":  "Windows Autopilot Device Preparation",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"Windows Autopilot Device Preparation\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  10,\r\n    \"technologies\":  \"enrollment\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"80d33118-b7b4-40d8-b15f-81be745e053f_1\",\r\n                              \"templateFamily\":  \"enrollmentConfiguration\",\r\n                              \"templateDisplayName\":  \"Device Preparation\",\r\n                              \"templateDisplayVersion\":  \"Version 1\"\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_deploymentmode\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"5180aeab-886e-4589-97d4-40855c646315\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_deploymentmode_0\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"5874c2f6-bcf1-463b-a9eb-bee64e2f2d82\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_deploymenttype\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"f4184296-fa9f-4b67-8b12-1723b3f8456b\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_deploymenttype_0\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"e0af022f-37f3-4a40-916d-1ab7281c88d9\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_jointype\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"6310e95d-6cfa-4d2f-aae0-1e7af12e2182\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_jointype_0\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"1fa84eb3-fcfa-4ed6-9687-0f3d486402c4\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_accountype\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"d4f2a840-86d5-4162-9a08-fa8cc608b94e\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_accountype_0\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"bf13bb47-69ef-4e06-97c1-50c2859a49c2\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_timeout\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"6dec0657-dfb8-4906-a7ee-3ac6ee1edecb\"\r\n                                                                                      },\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                            \"value\":  30,\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"0bbcce5b-a55a-4e05-821a-94bf576d6cc8\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              }\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"5\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_customerrormessage\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"2ddf0619-2b7a-46de-b29b-c6191e9dda6e\"\r\n                                                                                      },\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                            \"value\":  \"Contact your oganization\\u0027s support person for help.\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"fe5002d5-fbe9-4920-9e2d-26bfc4b4cc97\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              }\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"6\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_allowskip\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"2a71dc89-0f17-4ba9-bb27-af2521d34710\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_allowskip_1\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"a2323e5e-ac56-4517-8847-b0a6fdb467e7\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"7\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_allowdiagnostics\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"e2b7a81b-f243-4abd-bce3-c1856345f405\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_allowdiagnostics_1\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"c59d26fd-3460-4b26-b47a-f7e202e7d5a3\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"8\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_allowedappids\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"70d22a8a-a03c-4f62-b8df-dded3e327639\"\r\n                                                                                      },\r\n                                                 \"simpleSettingCollectionValue\":  [\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"{\\\"id\\\":\\\"0162f7a3-9cec-4548-adf6-b06fb5633604\\\",\\\"type\\\":\\\"#microsoft.graph.winGetApp\\\"}\"\r\n                                                                                      },\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"{\\\"id\\\":\\\"8b1155c7-f157-4beb-a5f8-f381dbb283ca\\\",\\\"type\\\":\\\"#microsoft.graph.officeSuiteApp\\\"}\"\r\n                                                                                      },\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"{\\\"id\\\":\\\"17557e01-936f-47d4-8022-1735ff518270\\\",\\\"type\\\":\\\"#microsoft.graph.winGetApp\\\"}\"\r\n                                                                                      }\r\n                                                                                  ]\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"9\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_allowedscriptids\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"1bc67702-800c-4271-8fd9-609351cc19cf\"\r\n                                                                                      },\r\n                                                 \"simpleSettingCollectionValue\":  [\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"d7324712-b33f-461b-908f-fb9fee877995\"\r\n                                                                                      },\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"176e6114-3e23-457a-bb69-28a9e1cfe437\"\r\n                                                                                      }\r\n                                                                                  ]\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Add",
        "PolicyID":  "e8f9c7e8-4ea0-4571-bb3c-d80283d29523"
    },
    {
        "Name":  "Mac Compliance Policy",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSCompliancePolicy\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"description\":  null,\r\n    \"displayName\":  \"Mac Compliance Policy\",\r\n    \"passwordRequired\":  false,\r\n    \"passwordBlockSimple\":  false,\r\n    \"passwordExpirationDays\":  null,\r\n    \"passwordMinimumLength\":  null,\r\n    \"passwordMinutesOfInactivityBeforeLock\":  null,\r\n    \"passwordPreviousPasswordBlockCount\":  null,\r\n    \"passwordMinimumCharacterSetCount\":  null,\r\n    \"passwordRequiredType\":  \"deviceDefault\",\r\n    \"osMinimumVersion\":  null,\r\n    \"osMaximumVersion\":  null,\r\n    \"osMinimumBuildVersion\":  null,\r\n    \"osMaximumBuildVersion\":  null,\r\n    \"systemIntegrityProtectionEnabled\":  false,\r\n    \"deviceThreatProtectionEnabled\":  false,\r\n    \"deviceThreatProtectionRequiredSecurityLevel\":  \"unavailable\",\r\n    \"advancedThreatProtectionRequiredSecurityLevel\":  \"unavailable\",\r\n    \"storageRequireEncryption\":  true,\r\n    \"gatekeeperAllowedAppSource\":  \"notConfigured\",\r\n    \"firewallEnabled\":  true,\r\n    \"firewallBlockAllIncoming\":  false,\r\n    \"firewallEnableStealthMode\":  false,\r\n    \"scheduledActionsForRule\":  [\r\n                                    {\r\n                                        \"scheduledActionConfigurations\":  [\r\n                                                                              {\r\n                                                                                  \"actionType\":  \"block\",\r\n                                                                                  \"notificationTemplateId\":  \"\",\r\n                                                                                  \"gracePeriodHours\":  0\r\n                                                                              }\r\n                                                                          ],\r\n                                        \"ruleName\":  \"PasswordRequired\"\r\n                                    }\r\n                                ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies",
        "Type":  "Add",
        "PolicyID":  "bb60179e-20da-46e8-95db-5f2cdb45806d"
    },
    {
        "Name":  "Autopilot Profile",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.azureADWindowsAutopilotDeploymentProfile\",\r\n    \"displayName\":  \"Autopilot Profile\",\r\n    \"description\":  \"\",\r\n    \"language\":  \"os-default\",\r\n    \"locale\":  \"os-default\",\r\n    \"enrollmentStatusScreenSettings\":  null,\r\n    \"extractHardwareHash\":  false,\r\n    \"hardwareHashExtractionEnabled\":  false,\r\n    \"deviceNameTemplate\":  \"\",\r\n    \"deviceType\":  \"windowsPc\",\r\n    \"enableWhiteGlove\":  false,\r\n    \"preprovisioningAllowed\":  false,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"managementServiceAppId\":  null,\r\n    \"outOfBoxExperienceSettings\":  {\r\n                                       \"hidePrivacySettings\":  true,\r\n                                       \"hideEULA\":  true,\r\n                                       \"userType\":  \"standard\",\r\n                                       \"deviceUsageType\":  \"singleUser\",\r\n                                       \"skipKeyboardSelectionPage\":  false,\r\n                                       \"hideEscapeLink\":  false\r\n                                   },\r\n    \"outOfBoxExperienceSetting\":  {\r\n                                      \"privacySettingsHidden\":  true,\r\n                                      \"eulaHidden\":  true,\r\n                                      \"userType\":  \"standard\",\r\n                                      \"deviceUsageType\":  \"singleUser\",\r\n                                      \"keyboardSelectionPageSkipped\":  false,\r\n                                      \"escapeLinkHidden\":  false\r\n                                  }\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles",
        "Type":  "Add",
        "PolicyID":  "eb85c0ac-b555-4b0f-89cf-9629c1a3119f"
    },
    {
        "Name":  "Workstations (Autopilot)",
        "Source":  {
                       "value":  "{\r\n    \"description\":  null,\r\n    \"displayName\":  \"Workstations (Autopilot)\",\r\n    \"groupTypes\":  [\r\n                       \"DynamicMembership\"\r\n                   ],\r\n    \"mailEnabled\":  false,\r\n    \"mailNickname\":  \"13ac31b6-7\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  \"(device.devicePhysicalIDs -any (_ -contains \\\"[ZTDId]\\\"))\",\r\n    \"membershipRuleProcessingState\":  \"On\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "03074ac8-49c6-411b-82b5-eaa98a2c6fee"
    },
    {
        "Name":  "Cloud Signature",
        "Source":  {
                       "value":  "{\r\n    \"description\":  \"Cloud Signature\",\r\n    \"displayName\":  \"Cloud Signature\",\r\n    \"groupTypes\":  [\r\n\r\n                   ],\r\n    \"mailEnabled\":  true,\r\n    \"mailNickname\":  \"cloudsignature\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  null,\r\n    \"membershipRuleProcessingState\":  null\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "365f2a31-37bd-4241-8f82-357c5c5e6f9d"
    },
    {
        "Name":  "All Company",
        "Source":  {
                       "value":  "{\r\n    \"description\":  \"This is the default group for everyone in the network\",\r\n    \"displayName\":  \"All Company\",\r\n    \"groupTypes\":  [\r\n                       \"Unified\"\r\n                   ],\r\n    \"mailEnabled\":  true,\r\n    \"mailNickname\":  \"allcompany\",\r\n    \"securityEnabled\":  false,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  null,\r\n    \"membershipRuleProcessingState\":  null\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "371a1ec2-4a63-450c-8183-e2e744ab6437"
    },
    {
        "Name":  "mbp+std Intune Policies",
        "Source":  {
                       "value":  "{\r\n    \"description\":  null,\r\n    \"displayName\":  \"mbp+std Intune Policies\",\r\n    \"groupTypes\":  [\r\n\r\n                   ],\r\n    \"mailEnabled\":  false,\r\n    \"mailNickname\":  \"eb753512-0\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  null,\r\n    \"membershipRuleProcessingState\":  null\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "7268f348-c4ef-4c6b-8f82-a7c489aa98fd"
    },
    {
        "Name":  "AutoPilot V2 User Group",
        "Source":  {
                       "value":  "{\r\n    \"description\":  null,\r\n    \"displayName\":  \"AutoPilot V2 User Group\",\r\n    \"groupTypes\":  [\r\n\r\n                   ],\r\n    \"mailEnabled\":  false,\r\n    \"mailNickname\":  \"a7de723d-d\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  null,\r\n    \"membershipRuleProcessingState\":  null\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "928e7f50-1c00-45e9-9808-3add53341ea7"
    },
    {
        "Name":  "Workstations (Non-Autopilot)",
        "Source":  {
                       "value":  "{\r\n    \"description\":  null,\r\n    \"displayName\":  \"Workstations (Non-Autopilot)\",\r\n    \"groupTypes\":  [\r\n                       \"DynamicMembership\"\r\n                   ],\r\n    \"mailEnabled\":  false,\r\n    \"mailNickname\":  \"66ff244e-d\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  \"((device.deviceOSType -eq \\\"Windows\\\") or (device.deviceOSType -StartsWith \\\"Mac\\\")) and (device.managementType -eq \\\"MDM\\\") and (device.devicePhysicalIDs -all _ -notContains \\\"[ZTDId]\\\")\",\r\n    \"membershipRuleProcessingState\":  \"On\"\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "ab839e06-d8a9-4f26-9b62-86fe0bfe44ca"
    },
    {
        "Name":  "Autopilot V2 Device Group",
        "Source":  {
                       "value":  "{\r\n    \"description\":  null,\r\n    \"displayName\":  \"Autopilot V2 Device Group\",\r\n    \"groupTypes\":  [\r\n\r\n                   ],\r\n    \"mailEnabled\":  false,\r\n    \"mailNickname\":  \"352f59d9-d\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  null,\r\n    \"membershipRuleProcessingState\":  null\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "fa026533-80f9-4031-b187-49146a78c0df"
    },
    {
        "Name":  "Android apps data leak prevention policy",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.androidManagedAppProtection\",\r\n    \"displayName\":  \"Android apps data leak prevention policy\",\r\n    \"description\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"periodOfflineBeforeAccessCheck\":  \"PT12H\",\r\n    \"periodOnlineBeforeAccessCheck\":  \"PT30M\",\r\n    \"allowedInboundDataTransferSources\":  \"allApps\",\r\n    \"allowedOutboundDataTransferDestinations\":  \"managedApps\",\r\n    \"organizationalCredentialsRequired\":  false,\r\n    \"allowedOutboundClipboardSharingLevel\":  \"managedAppsWithPasteIn\",\r\n    \"dataBackupBlocked\":  true,\r\n    \"deviceComplianceRequired\":  true,\r\n    \"managedBrowserToOpenLinksRequired\":  true,\r\n    \"saveAsBlocked\":  true,\r\n    \"periodOfflineBeforeWipeIsEnforced\":  \"P90D\",\r\n    \"pinRequired\":  true,\r\n    \"maximumPinRetries\":  5,\r\n    \"simplePinBlocked\":  false,\r\n    \"minimumPinLength\":  4,\r\n    \"pinCharacterSet\":  \"alphanumericAndSymbol\",\r\n    \"periodBeforePinReset\":  \"PT0S\",\r\n    \"allowedDataStorageLocations\":  [\r\n                                        \"oneDriveForBusiness\",\r\n                                        \"sharePoint\"\r\n                                    ],\r\n    \"contactSyncBlocked\":  false,\r\n    \"printBlocked\":  false,\r\n    \"fingerprintBlocked\":  false,\r\n    \"disableAppPinIfDevicePinIsSet\":  false,\r\n    \"maximumRequiredOsVersion\":  null,\r\n    \"maximumWarningOsVersion\":  null,\r\n    \"maximumWipeOsVersion\":  null,\r\n    \"minimumRequiredOsVersion\":  null,\r\n    \"minimumWarningOsVersion\":  null,\r\n    \"minimumRequiredAppVersion\":  null,\r\n    \"minimumWarningAppVersion\":  null,\r\n    \"minimumWipeOsVersion\":  null,\r\n    \"minimumWipeAppVersion\":  null,\r\n    \"appActionIfDeviceComplianceRequired\":  \"block\",\r\n    \"appActionIfMaximumPinRetriesExceeded\":  \"block\",\r\n    \"pinRequiredInsteadOfBiometricTimeout\":  null,\r\n    \"allowedOutboundClipboardSharingExceptionLength\":  0,\r\n    \"notificationRestriction\":  \"allow\",\r\n    \"previousPinBlockCount\":  0,\r\n    \"managedBrowser\":  \"notConfigured\",\r\n    \"maximumAllowedDeviceThreatLevel\":  \"notConfigured\",\r\n    \"mobileThreatDefenseRemediationAction\":  \"block\",\r\n    \"mobileThreatDefensePartnerPriority\":  null,\r\n    \"blockDataIngestionIntoOrganizationDocuments\":  false,\r\n    \"allowedDataIngestionLocations\":  [\r\n\r\n                                      ],\r\n    \"appActionIfUnableToAuthenticateUser\":  null,\r\n    \"dialerRestrictionLevel\":  \"allApps\",\r\n    \"gracePeriodToBlockAppsDuringOffClockHours\":  null,\r\n    \"protectedMessagingRedirectAppType\":  \"anyApp\",\r\n    \"isAssigned\":  false,\r\n    \"targetedAppManagementLevels\":  \"unspecified\",\r\n    \"appGroupType\":  \"selectedPublicApps\",\r\n    \"screenCaptureBlocked\":  false,\r\n    \"disableAppEncryptionIfDeviceEncryptionIsEnabled\":  false,\r\n    \"encryptAppData\":  false,\r\n    \"deployedAppCount\":  0,\r\n    \"minimumRequiredPatchVersion\":  \"0000-00-00\",\r\n    \"minimumWarningPatchVersion\":  \"0000-00-00\",\r\n    \"minimumWipePatchVersion\":  \"0000-00-00\",\r\n    \"allowedAndroidDeviceManufacturers\":  null,\r\n    \"appActionIfAndroidDeviceManufacturerNotAllowed\":  \"block\",\r\n    \"appActionIfAccountIsClockedOut\":  null,\r\n    \"appActionIfSamsungKnoxAttestationRequired\":  null,\r\n    \"requiredAndroidSafetyNetDeviceAttestationType\":  \"none\",\r\n    \"appActionIfAndroidSafetyNetDeviceAttestationFailed\":  \"block\",\r\n    \"requiredAndroidSafetyNetAppsVerificationType\":  \"none\",\r\n    \"appActionIfAndroidSafetyNetAppsVerificationFailed\":  \"block\",\r\n    \"customBrowserPackageId\":  null,\r\n    \"customBrowserDisplayName\":  null,\r\n    \"minimumRequiredCompanyPortalVersion\":  null,\r\n    \"minimumWarningCompanyPortalVersion\":  null,\r\n    \"minimumWipeCompanyPortalVersion\":  null,\r\n    \"keyboardsRestricted\":  false,\r\n    \"allowedAndroidDeviceModels\":  [\r\n\r\n                                   ],\r\n    \"appActionIfAndroidDeviceModelNotAllowed\":  \"block\",\r\n    \"customDialerAppPackageId\":  null,\r\n    \"customDialerAppDisplayName\":  null,\r\n    \"biometricAuthenticationBlocked\":  false,\r\n    \"requiredAndroidSafetyNetEvaluationType\":  \"basic\",\r\n    \"blockAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"warnAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"wipeAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"deviceLockRequired\":  false,\r\n    \"appActionIfDeviceLockNotSet\":  \"block\",\r\n    \"connectToVpnOnLaunch\":  false,\r\n    \"appActionIfDevicePasscodeComplexityLessThanLow\":  null,\r\n    \"appActionIfDevicePasscodeComplexityLessThanMedium\":  null,\r\n    \"appActionIfDevicePasscodeComplexityLessThanHigh\":  null,\r\n    \"requireClass3Biometrics\":  false,\r\n    \"requirePinAfterBiometricChange\":  false,\r\n    \"fingerprintAndBiometricEnabled\":  null,\r\n    \"messagingRedirectAppPackageId\":  null,\r\n    \"messagingRedirectAppDisplayName\":  null,\r\n    \"exemptedAppPackages\":  [\r\n                                {\r\n                                    \"name\":  \"Default\",\r\n                                    \"value\":  \"\"\r\n                                }\r\n                            ],\r\n    \"approvedKeyboards\":  [\r\n\r\n                          ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
        "Type":  "Add",
        "PolicyID":  "T_d01e705d-4625-4dac-9adc-df0bb6831369"
    },
    {
        "Name":  "Android - Baseline - BYOD - App Protection",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.androidManagedAppProtection\",\r\n    \"displayName\":  \"Android - Baseline - BYOD - App Protection\",\r\n    \"description\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"periodOfflineBeforeAccessCheck\":  \"PT12H\",\r\n    \"periodOnlineBeforeAccessCheck\":  \"PT30M\",\r\n    \"allowedInboundDataTransferSources\":  \"allApps\",\r\n    \"allowedOutboundDataTransferDestinations\":  \"managedApps\",\r\n    \"organizationalCredentialsRequired\":  false,\r\n    \"allowedOutboundClipboardSharingLevel\":  \"managedAppsWithPasteIn\",\r\n    \"dataBackupBlocked\":  true,\r\n    \"deviceComplianceRequired\":  true,\r\n    \"managedBrowserToOpenLinksRequired\":  true,\r\n    \"saveAsBlocked\":  true,\r\n    \"periodOfflineBeforeWipeIsEnforced\":  \"P90D\",\r\n    \"pinRequired\":  true,\r\n    \"maximumPinRetries\":  5,\r\n    \"simplePinBlocked\":  true,\r\n    \"minimumPinLength\":  6,\r\n    \"pinCharacterSet\":  \"numeric\",\r\n    \"periodBeforePinReset\":  \"PT0S\",\r\n    \"allowedDataStorageLocations\":  [\r\n                                        \"oneDriveForBusiness\",\r\n                                        \"sharePoint\"\r\n                                    ],\r\n    \"contactSyncBlocked\":  false,\r\n    \"printBlocked\":  true,\r\n    \"fingerprintBlocked\":  false,\r\n    \"disableAppPinIfDevicePinIsSet\":  false,\r\n    \"maximumRequiredOsVersion\":  null,\r\n    \"maximumWarningOsVersion\":  null,\r\n    \"maximumWipeOsVersion\":  null,\r\n    \"minimumRequiredOsVersion\":  null,\r\n    \"minimumWarningOsVersion\":  null,\r\n    \"minimumRequiredAppVersion\":  null,\r\n    \"minimumWarningAppVersion\":  null,\r\n    \"minimumWipeOsVersion\":  null,\r\n    \"minimumWipeAppVersion\":  null,\r\n    \"appActionIfDeviceComplianceRequired\":  \"block\",\r\n    \"appActionIfMaximumPinRetriesExceeded\":  \"block\",\r\n    \"pinRequiredInsteadOfBiometricTimeout\":  \"PT12H\",\r\n    \"allowedOutboundClipboardSharingExceptionLength\":  0,\r\n    \"notificationRestriction\":  \"blockOrganizationalData\",\r\n    \"previousPinBlockCount\":  0,\r\n    \"managedBrowser\":  \"microsoftEdge\",\r\n    \"maximumAllowedDeviceThreatLevel\":  \"notConfigured\",\r\n    \"mobileThreatDefenseRemediationAction\":  \"block\",\r\n    \"mobileThreatDefensePartnerPriority\":  null,\r\n    \"blockDataIngestionIntoOrganizationDocuments\":  false,\r\n    \"allowedDataIngestionLocations\":  [\r\n                                          \"oneDriveForBusiness\",\r\n                                          \"sharePoint\",\r\n                                          \"camera\"\r\n                                      ],\r\n    \"appActionIfUnableToAuthenticateUser\":  \"block\",\r\n    \"dialerRestrictionLevel\":  \"allApps\",\r\n    \"gracePeriodToBlockAppsDuringOffClockHours\":  null,\r\n    \"protectedMessagingRedirectAppType\":  \"anyApp\",\r\n    \"isAssigned\":  false,\r\n    \"targetedAppManagementLevels\":  \"unmanaged\",\r\n    \"appGroupType\":  \"allMicrosoftApps\",\r\n    \"screenCaptureBlocked\":  true,\r\n    \"disableAppEncryptionIfDeviceEncryptionIsEnabled\":  false,\r\n    \"encryptAppData\":  true,\r\n    \"deployedAppCount\":  41,\r\n    \"minimumRequiredPatchVersion\":  \"0000-00-00\",\r\n    \"minimumWarningPatchVersion\":  \"0000-00-00\",\r\n    \"minimumWipePatchVersion\":  \"0000-00-00\",\r\n    \"allowedAndroidDeviceManufacturers\":  null,\r\n    \"appActionIfAndroidDeviceManufacturerNotAllowed\":  \"block\",\r\n    \"appActionIfAccountIsClockedOut\":  null,\r\n    \"appActionIfSamsungKnoxAttestationRequired\":  null,\r\n    \"requiredAndroidSafetyNetDeviceAttestationType\":  \"basicIntegrityAndDeviceCertification\",\r\n    \"appActionIfAndroidSafetyNetDeviceAttestationFailed\":  \"block\",\r\n    \"requiredAndroidSafetyNetAppsVerificationType\":  \"enabled\",\r\n    \"appActionIfAndroidSafetyNetAppsVerificationFailed\":  \"block\",\r\n    \"customBrowserPackageId\":  \"\",\r\n    \"customBrowserDisplayName\":  \"\",\r\n    \"minimumRequiredCompanyPortalVersion\":  null,\r\n    \"minimumWarningCompanyPortalVersion\":  null,\r\n    \"minimumWipeCompanyPortalVersion\":  null,\r\n    \"keyboardsRestricted\":  false,\r\n    \"allowedAndroidDeviceModels\":  [\r\n\r\n                                   ],\r\n    \"appActionIfAndroidDeviceModelNotAllowed\":  \"block\",\r\n    \"customDialerAppPackageId\":  \"\",\r\n    \"customDialerAppDisplayName\":  \"\",\r\n    \"biometricAuthenticationBlocked\":  false,\r\n    \"requiredAndroidSafetyNetEvaluationType\":  \"hardwareBacked\",\r\n    \"blockAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"warnAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"wipeAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"deviceLockRequired\":  false,\r\n    \"appActionIfDeviceLockNotSet\":  \"block\",\r\n    \"connectToVpnOnLaunch\":  false,\r\n    \"appActionIfDevicePasscodeComplexityLessThanLow\":  null,\r\n    \"appActionIfDevicePasscodeComplexityLessThanMedium\":  \"block\",\r\n    \"appActionIfDevicePasscodeComplexityLessThanHigh\":  null,\r\n    \"requireClass3Biometrics\":  true,\r\n    \"requirePinAfterBiometricChange\":  true,\r\n    \"fingerprintAndBiometricEnabled\":  null,\r\n    \"messagingRedirectAppPackageId\":  null,\r\n    \"messagingRedirectAppDisplayName\":  null,\r\n    \"exemptedAppPackages\":  [\r\n\r\n                            ],\r\n    \"approvedKeyboards\":  [\r\n\r\n                          ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
        "Type":  "Add",
        "PolicyID":  "T_a70ad863-fbc3-4482-98fb-7ba5c609ebc8"
    },
    {
        "Name":  "iOS apps data leak prevention policy",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.iosManagedAppProtection\",\r\n    \"displayName\":  \"iOS apps data leak prevention policy\",\r\n    \"description\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"periodOfflineBeforeAccessCheck\":  \"PT12H\",\r\n    \"periodOnlineBeforeAccessCheck\":  \"PT30M\",\r\n    \"allowedInboundDataTransferSources\":  \"allApps\",\r\n    \"allowedOutboundDataTransferDestinations\":  \"managedApps\",\r\n    \"organizationalCredentialsRequired\":  false,\r\n    \"allowedOutboundClipboardSharingLevel\":  \"managedAppsWithPasteIn\",\r\n    \"dataBackupBlocked\":  true,\r\n    \"deviceComplianceRequired\":  true,\r\n    \"managedBrowserToOpenLinksRequired\":  true,\r\n    \"saveAsBlocked\":  true,\r\n    \"periodOfflineBeforeWipeIsEnforced\":  \"P90D\",\r\n    \"pinRequired\":  true,\r\n    \"maximumPinRetries\":  5,\r\n    \"simplePinBlocked\":  false,\r\n    \"minimumPinLength\":  4,\r\n    \"pinCharacterSet\":  \"alphanumericAndSymbol\",\r\n    \"periodBeforePinReset\":  \"PT0S\",\r\n    \"allowedDataStorageLocations\":  [\r\n                                        \"oneDriveForBusiness\",\r\n                                        \"sharePoint\"\r\n                                    ],\r\n    \"contactSyncBlocked\":  false,\r\n    \"printBlocked\":  false,\r\n    \"fingerprintBlocked\":  false,\r\n    \"disableAppPinIfDevicePinIsSet\":  false,\r\n    \"maximumRequiredOsVersion\":  null,\r\n    \"maximumWarningOsVersion\":  null,\r\n    \"maximumWipeOsVersion\":  null,\r\n    \"minimumRequiredOsVersion\":  null,\r\n    \"minimumWarningOsVersion\":  null,\r\n    \"minimumRequiredAppVersion\":  null,\r\n    \"minimumWarningAppVersion\":  null,\r\n    \"minimumWipeOsVersion\":  null,\r\n    \"minimumWipeAppVersion\":  null,\r\n    \"appActionIfDeviceComplianceRequired\":  \"block\",\r\n    \"appActionIfMaximumPinRetriesExceeded\":  \"block\",\r\n    \"pinRequiredInsteadOfBiometricTimeout\":  null,\r\n    \"allowedOutboundClipboardSharingExceptionLength\":  0,\r\n    \"notificationRestriction\":  \"allow\",\r\n    \"previousPinBlockCount\":  0,\r\n    \"managedBrowser\":  \"notConfigured\",\r\n    \"maximumAllowedDeviceThreatLevel\":  \"notConfigured\",\r\n    \"mobileThreatDefenseRemediationAction\":  \"block\",\r\n    \"mobileThreatDefensePartnerPriority\":  null,\r\n    \"blockDataIngestionIntoOrganizationDocuments\":  false,\r\n    \"allowedDataIngestionLocations\":  [\r\n\r\n                                      ],\r\n    \"appActionIfUnableToAuthenticateUser\":  null,\r\n    \"dialerRestrictionLevel\":  \"allApps\",\r\n    \"gracePeriodToBlockAppsDuringOffClockHours\":  null,\r\n    \"protectedMessagingRedirectAppType\":  \"anyApp\",\r\n    \"isAssigned\":  false,\r\n    \"targetedAppManagementLevels\":  \"unspecified\",\r\n    \"appGroupType\":  \"selectedPublicApps\",\r\n    \"appDataEncryptionType\":  \"whenDeviceLocked\",\r\n    \"minimumRequiredSdkVersion\":  null,\r\n    \"deployedAppCount\":  0,\r\n    \"faceIdBlocked\":  false,\r\n    \"allowWidgetContentSync\":  false,\r\n    \"minimumWipeSdkVersion\":  null,\r\n    \"allowedIosDeviceModels\":  null,\r\n    \"appActionIfIosDeviceModelNotAllowed\":  \"block\",\r\n    \"appActionIfAccountIsClockedOut\":  null,\r\n    \"thirdPartyKeyboardsBlocked\":  false,\r\n    \"filterOpenInToOnlyManagedApps\":  false,\r\n    \"disableProtectionOfManagedOutboundOpenInData\":  false,\r\n    \"protectInboundDataFromUnknownSources\":  false,\r\n    \"customBrowserProtocol\":  null,\r\n    \"customDialerAppProtocol\":  null,\r\n    \"managedUniversalLinks\":  [\r\n                                  \"http://*.sharepoint.com/*\",\r\n                                  \"http://*.sharepoint-df.com/*\",\r\n                                  \"http://*.yammer.com/*\",\r\n                                  \"http://*.onedrive.com/*\",\r\n                                  \"http://tasks.office.com/*\",\r\n                                  \"http://to-do.microsoft.com/sharing*\",\r\n                                  \"http://web.microsoftstream.com/video/*\",\r\n                                  \"http://msit.microsoftstream.com/video/*\",\r\n                                  \"http://*.powerbi.com/*\",\r\n                                  \"http://app.powerbi.cn/*\",\r\n                                  \"http://app.powerbigov.us/*\",\r\n                                  \"http://app.powerbi.de/*\",\r\n                                  \"http://*.service-now.com/*\",\r\n                                  \"http://*.appsplatform.us/*\",\r\n                                  \"http://*.powerapps.cn/*\",\r\n                                  \"http://*.powerapps.com/*\",\r\n                                  \"http://*.powerapps.us/*\",\r\n                                  \"http://*teams.microsoft.com/l/*\",\r\n                                  \"http://*devspaces.skype.com/l/*\",\r\n                                  \"http://*teams.live.com/l/*\",\r\n                                  \"http://*collab.apps.mil/l/*\",\r\n                                  \"http://*teams.microsoft.us/l/*\",\r\n                                  \"http://*teams-fl.microsoft.com/l/*\",\r\n                                  \"http://*.zoom.us/*\",\r\n                                  \"http://zoom.us/*\",\r\n                                  \"https://*.sharepoint.com/*\",\r\n                                  \"https://*.sharepoint-df.com/*\",\r\n                                  \"https://*.yammer.com/*\",\r\n                                  \"https://*.onedrive.com/*\",\r\n                                  \"https://tasks.office.com/*\",\r\n                                  \"https://to-do.microsoft.com/sharing*\",\r\n                                  \"https://web.microsoftstream.com/video/*\",\r\n                                  \"https://msit.microsoftstream.com/video/*\",\r\n                                  \"https://*.powerbi.com/*\",\r\n                                  \"https://app.powerbi.cn/*\",\r\n                                  \"https://app.powerbigov.us/*\",\r\n                                  \"https://app.powerbi.de/*\",\r\n                                  \"https://*.service-now.com/*\",\r\n                                  \"https://*.appsplatform.us/*\",\r\n                                  \"https://*.powerapps.cn/*\",\r\n                                  \"https://*.powerapps.com/*\",\r\n                                  \"https://*.powerapps.us/*\",\r\n                                  \"https://*teams.microsoft.com/l/*\",\r\n                                  \"https://*devspaces.skype.com/l/*\",\r\n                                  \"https://*teams.live.com/l/*\",\r\n                                  \"https://*collab.apps.mil/l/*\",\r\n                                  \"https://*teams.microsoft.us/l/*\",\r\n                                  \"https://*teams-fl.microsoft.com/l/*\",\r\n                                  \"https://*.zoom.us/*\",\r\n                                  \"https://zoom.us/*\"\r\n                              ],\r\n    \"exemptedUniversalLinks\":  [\r\n                                   \"http://maps.apple.com\",\r\n                                   \"https://maps.apple.com\",\r\n                                   \"http://facetime.apple.com\",\r\n                                   \"https://facetime.apple.com\"\r\n                               ],\r\n    \"minimumWarningSdkVersion\":  null,\r\n    \"messagingRedirectAppUrlScheme\":  null,\r\n    \"exemptedAppProtocols\":  [\r\n                                 {\r\n                                     \"name\":  \"Default\",\r\n                                     \"value\":  \"skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;\"\r\n                                 }\r\n                             ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
        "Type":  "Add",
        "PolicyID":  "T_36a3a205-ca09-44d0-9e98-3745037134cb"
    },
    {
        "Name":  "iOS - Baseline - BYOD - App Protection",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.iosManagedAppProtection\",\r\n    \"displayName\":  \"iOS - Baseline - BYOD - App Protection\",\r\n    \"description\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"periodOfflineBeforeAccessCheck\":  \"PT12H\",\r\n    \"periodOnlineBeforeAccessCheck\":  \"PT30M\",\r\n    \"allowedInboundDataTransferSources\":  \"allApps\",\r\n    \"allowedOutboundDataTransferDestinations\":  \"managedApps\",\r\n    \"organizationalCredentialsRequired\":  false,\r\n    \"allowedOutboundClipboardSharingLevel\":  \"managedAppsWithPasteIn\",\r\n    \"dataBackupBlocked\":  true,\r\n    \"deviceComplianceRequired\":  true,\r\n    \"managedBrowserToOpenLinksRequired\":  true,\r\n    \"saveAsBlocked\":  true,\r\n    \"periodOfflineBeforeWipeIsEnforced\":  \"P90D\",\r\n    \"pinRequired\":  true,\r\n    \"maximumPinRetries\":  5,\r\n    \"simplePinBlocked\":  true,\r\n    \"minimumPinLength\":  6,\r\n    \"pinCharacterSet\":  \"numeric\",\r\n    \"periodBeforePinReset\":  \"PT0S\",\r\n    \"allowedDataStorageLocations\":  [\r\n                                        \"oneDriveForBusiness\",\r\n                                        \"sharePoint\"\r\n                                    ],\r\n    \"contactSyncBlocked\":  false,\r\n    \"printBlocked\":  true,\r\n    \"fingerprintBlocked\":  false,\r\n    \"disableAppPinIfDevicePinIsSet\":  false,\r\n    \"maximumRequiredOsVersion\":  null,\r\n    \"maximumWarningOsVersion\":  null,\r\n    \"maximumWipeOsVersion\":  null,\r\n    \"minimumRequiredOsVersion\":  null,\r\n    \"minimumWarningOsVersion\":  null,\r\n    \"minimumRequiredAppVersion\":  null,\r\n    \"minimumWarningAppVersion\":  null,\r\n    \"minimumWipeOsVersion\":  null,\r\n    \"minimumWipeAppVersion\":  null,\r\n    \"appActionIfDeviceComplianceRequired\":  \"block\",\r\n    \"appActionIfMaximumPinRetriesExceeded\":  \"block\",\r\n    \"pinRequiredInsteadOfBiometricTimeout\":  \"PT12H\",\r\n    \"allowedOutboundClipboardSharingExceptionLength\":  0,\r\n    \"notificationRestriction\":  \"blockOrganizationalData\",\r\n    \"previousPinBlockCount\":  0,\r\n    \"managedBrowser\":  \"microsoftEdge\",\r\n    \"maximumAllowedDeviceThreatLevel\":  \"notConfigured\",\r\n    \"mobileThreatDefenseRemediationAction\":  \"block\",\r\n    \"mobileThreatDefensePartnerPriority\":  null,\r\n    \"blockDataIngestionIntoOrganizationDocuments\":  false,\r\n    \"allowedDataIngestionLocations\":  [\r\n                                          \"oneDriveForBusiness\",\r\n                                          \"sharePoint\",\r\n                                          \"camera\"\r\n                                      ],\r\n    \"appActionIfUnableToAuthenticateUser\":  \"block\",\r\n    \"dialerRestrictionLevel\":  \"allApps\",\r\n    \"gracePeriodToBlockAppsDuringOffClockHours\":  null,\r\n    \"protectedMessagingRedirectAppType\":  \"anyApp\",\r\n    \"isAssigned\":  false,\r\n    \"targetedAppManagementLevels\":  \"unmanaged\",\r\n    \"appGroupType\":  \"allMicrosoftApps\",\r\n    \"appDataEncryptionType\":  \"whenDeviceLocked\",\r\n    \"minimumRequiredSdkVersion\":  null,\r\n    \"deployedAppCount\":  39,\r\n    \"faceIdBlocked\":  false,\r\n    \"allowWidgetContentSync\":  false,\r\n    \"minimumWipeSdkVersion\":  null,\r\n    \"allowedIosDeviceModels\":  null,\r\n    \"appActionIfIosDeviceModelNotAllowed\":  \"block\",\r\n    \"appActionIfAccountIsClockedOut\":  null,\r\n    \"thirdPartyKeyboardsBlocked\":  false,\r\n    \"filterOpenInToOnlyManagedApps\":  false,\r\n    \"disableProtectionOfManagedOutboundOpenInData\":  false,\r\n    \"protectInboundDataFromUnknownSources\":  false,\r\n    \"customBrowserProtocol\":  \"\",\r\n    \"customDialerAppProtocol\":  \"\",\r\n    \"managedUniversalLinks\":  [\r\n                                  \"http://*.sharepoint.com/*\",\r\n                                  \"http://*.sharepoint-df.com/*\",\r\n                                  \"http://*.yammer.com/*\",\r\n                                  \"http://*.onedrive.com/*\",\r\n                                  \"http://tasks.office.com/*\",\r\n                                  \"http://to-do.microsoft.com/sharing*\",\r\n                                  \"http://web.microsoftstream.com/video/*\",\r\n                                  \"http://msit.microsoftstream.com/video/*\",\r\n                                  \"http://*.powerbi.com/*\",\r\n                                  \"http://app.powerbi.cn/*\",\r\n                                  \"http://app.powerbigov.us/*\",\r\n                                  \"http://app.powerbi.de/*\",\r\n                                  \"http://*.service-now.com/*\",\r\n                                  \"http://*.appsplatform.us/*\",\r\n                                  \"http://*.powerapps.cn/*\",\r\n                                  \"http://*.powerapps.com/*\",\r\n                                  \"http://*.powerapps.us/*\",\r\n                                  \"http://*teams.microsoft.com/l/*\",\r\n                                  \"http://*devspaces.skype.com/l/*\",\r\n                                  \"http://*teams.live.com/l/*\",\r\n                                  \"http://*collab.apps.mil/l/*\",\r\n                                  \"http://*teams.microsoft.us/l/*\",\r\n                                  \"http://*teams-fl.microsoft.com/l/*\",\r\n                                  \"http://*.zoom.us/*\",\r\n                                  \"http://zoom.us/*\",\r\n                                  \"https://*.sharepoint.com/*\",\r\n                                  \"https://*.sharepoint-df.com/*\",\r\n                                  \"https://*.yammer.com/*\",\r\n                                  \"https://*.onedrive.com/*\",\r\n                                  \"https://tasks.office.com/*\",\r\n                                  \"https://to-do.microsoft.com/sharing*\",\r\n                                  \"https://web.microsoftstream.com/video/*\",\r\n                                  \"https://msit.microsoftstream.com/video/*\",\r\n                                  \"https://*.powerbi.com/*\",\r\n                                  \"https://app.powerbi.cn/*\",\r\n                                  \"https://app.powerbigov.us/*\",\r\n                                  \"https://app.powerbi.de/*\",\r\n                                  \"https://*.service-now.com/*\",\r\n                                  \"https://*.appsplatform.us/*\",\r\n                                  \"https://*.powerapps.cn/*\",\r\n                                  \"https://*.powerapps.com/*\",\r\n                                  \"https://*.powerapps.us/*\",\r\n                                  \"https://*teams.microsoft.com/l/*\",\r\n                                  \"https://*devspaces.skype.com/l/*\",\r\n                                  \"https://*teams.live.com/l/*\",\r\n                                  \"https://*collab.apps.mil/l/*\",\r\n                                  \"https://*teams.microsoft.us/l/*\",\r\n                                  \"https://*teams-fl.microsoft.com/l/*\",\r\n                                  \"https://*.zoom.us/*\",\r\n                                  \"https://zoom.us/*\"\r\n                              ],\r\n    \"exemptedUniversalLinks\":  [\r\n                                   \"http://maps.apple.com\",\r\n                                   \"https://maps.apple.com\",\r\n                                   \"http://facetime.apple.com\",\r\n                                   \"https://facetime.apple.com\"\r\n                               ],\r\n    \"minimumWarningSdkVersion\":  null,\r\n    \"messagingRedirectAppUrlScheme\":  null,\r\n    \"exemptedAppProtocols\":  [\r\n                                 {\r\n                                     \"name\":  \"Default\",\r\n                                     \"value\":  \"skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;\"\r\n                                 }\r\n                             ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  [
                    "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess"
                ],
        "Type":  "Add",
        "PolicyID":  [
                         "T_bcbd3ad2-1e73-481d-9a69-2e1c28b5d237",
                         "96cd3880-7554-4848-bd92-c77ef340f9d5",
                         "c9e24f6c-5535-4a0c-b6c6-bf4101418c2c",
                         "1117e724-4445-455e-acba-f99cc30dbd2d",
                         "21d2267e-d9f1-4e55-8b93-56cccd774347",
                         "f9c86fc9-0dcf-491d-8bf1-73581dc5b55f",
                         "66069f80-a425-41dc-9c16-48555aae6ca2",
                         "1ba886ae-d1ed-421e-a152-965428335c70",
                         "eac18aab-edc4-4f4f-bfc7-2ef35f8d7e5c",
                         "9343f8b6-2ea3-476e-8dc8-a7f381a73119"
                     ]
    },
    {
        "Name":  "iOS - Baseline - BYOD - App Protection",
        "Source":  {
                       "@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
                       "id":  "eac18aab-edc4-4f4f-bfc7-2ef35f8d7e5c",
                       "templateId":  null,
                       "displayName":  "Global Admin - Require FIDO for Sign ins outside Australia",
                       "createdDateTime":  "\/Date(1719717544080)\/",
                       "modifiedDateTime":  "\/Date(1719719234521)\/",
                       "state":  "enabled",
                       "partialEnablementStrategy":  null,
                       "sessionControls":  null,
                       "conditions":  {
                                          "userRiskLevels":  [

                                                             ],
                                          "signInRiskLevels":  [

                                                               ],
                                          "clientAppTypes":  [
                                                                 "all"
                                                             ],
                                          "platforms":  null,
                                          "times":  null,
                                          "deviceStates":  null,
                                          "devices":  null,
                                          "clientApplications":  null,
                                          "applications":  {
                                                               "includeApplications":  [
                                                                                           "All"
                                                                                       ],
                                                               "excludeApplications":  [

                                                                                       ],
                                                               "includeUserActions":  [

                                                                                      ],
                                                               "includeAuthenticationContextClassReferences":  [

                                                                                                               ],
                                                               "applicationFilter":  null
                                                           },
                                          "users":  {
                                                        "includeUsers":  [
                                                                             "4b19a055-6752-4da2-9ecf-c8d55bf4051d"
                                                                         ],
                                                        "excludeUsers":  [

                                                                         ],
                                                        "includeGroups":  [

                                                                          ],
                                                        "excludeGroups":  [

                                                                          ],
                                                        "includeRoles":  [

                                                                         ],
                                                        "excludeRoles":  [

                                                                         ],
                                                        "includeGuestsOrExternalUsers":  null,
                                                        "excludeGuestsOrExternalUsers":  null
                                                    },
                                          "locations":  {
                                                            "includeLocations":  [
                                                                                     "All"
                                                                                 ],
                                                            "excludeLocations":  [
                                                                                     "1d60f444-df17-41f7-ab40-3c47cc7630a9"
                                                                                 ]
                                                        }
                                      },
                       "grantControls":  {
                                             "operator":  "OR",
                                             "builtInControls":  [

                                                                 ],
                                             "customAuthenticationFactors":  [

                                                                             ],
                                             "termsOfUse":  [

                                                            ],
                                             "authenticationStrength":  {
                                                                            "id":  "00000000-0000-0000-0000-000000000004"
                                                                        }
                                         },
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  [
                    "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess"
                ],
        "Type":  "Add",
        "PolicyID":  [
                         "T_bcbd3ad2-1e73-481d-9a69-2e1c28b5d237",
                         "96cd3880-7554-4848-bd92-c77ef340f9d5",
                         "c9e24f6c-5535-4a0c-b6c6-bf4101418c2c",
                         "1117e724-4445-455e-acba-f99cc30dbd2d",
                         "21d2267e-d9f1-4e55-8b93-56cccd774347",
                         "f9c86fc9-0dcf-491d-8bf1-73581dc5b55f",
                         "66069f80-a425-41dc-9c16-48555aae6ca2",
                         "1ba886ae-d1ed-421e-a152-965428335c70",
                         "eac18aab-edc4-4f4f-bfc7-2ef35f8d7e5c",
                         "9343f8b6-2ea3-476e-8dc8-a7f381a73119"
                     ]
    },
    {
        "Name":  "iOS - Baseline - BYOD - App Protection",
        "Source":  {
                       "@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
                       "id":  "9343f8b6-2ea3-476e-8dc8-a7f381a73119",
                       "templateId":  null,
                       "displayName":  "Token Protection (testing)",
                       "createdDateTime":  "\/Date(1720005702421)\/",
                       "modifiedDateTime":  null,
                       "state":  "enabledForReportingButNotEnforced",
                       "grantControls":  null,
                       "partialEnablementStrategy":  null,
                       "conditions":  {
                                          "userRiskLevels":  [

                                                             ],
                                          "signInRiskLevels":  [

                                                               ],
                                          "clientAppTypes":  [
                                                                 "mobileAppsAndDesktopClients"
                                                             ],
                                          "locations":  null,
                                          "times":  null,
                                          "deviceStates":  null,
                                          "devices":  null,
                                          "clientApplications":  null,
                                          "applications":  {
                                                               "includeApplications":  [
                                                                                           "00000002-0000-0ff1-ce00-000000000000",
                                                                                           "00000003-0000-0ff1-ce00-000000000000"
                                                                                       ],
                                                               "excludeApplications":  [

                                                                                       ],
                                                               "includeUserActions":  [

                                                                                      ],
                                                               "includeAuthenticationContextClassReferences":  [

                                                                                                               ],
                                                               "applicationFilter":  null
                                                           },
                                          "users":  {
                                                        "includeUsers":  [

                                                                         ],
                                                        "excludeUsers":  [

                                                                         ],
                                                        "includeGroups":  [
                                                                              "9674c5d4-fdfe-4044-9858-60fb9c8d5d45"
                                                                          ],
                                                        "excludeGroups":  [

                                                                          ],
                                                        "includeRoles":  [

                                                                         ],
                                                        "excludeRoles":  [

                                                                         ],
                                                        "includeGuestsOrExternalUsers":  null,
                                                        "excludeGuestsOrExternalUsers":  null
                                                    },
                                          "platforms":  {
                                                            "includePlatforms":  [
                                                                                     "windows"
                                                                                 ],
                                                            "excludePlatforms":  [

                                                                                 ]
                                                        }
                                      },
                       "sessionControls":  {
                                               "disableResilienceDefaults":  null,
                                               "applicationEnforcedRestrictions":  null,
                                               "cloudAppSecurity":  null,
                                               "signInFrequency":  null,
                                               "persistentBrowser":  null,
                                               "continuousAccessEvaluation":  null,
                                               "secureSignInSession":  {
                                                                           "isEnabled":  true
                                                                       }
                                           },
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  [
                    "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess"
                ],
        "Type":  "Add",
        "PolicyID":  [
                         "T_bcbd3ad2-1e73-481d-9a69-2e1c28b5d237",
                         "96cd3880-7554-4848-bd92-c77ef340f9d5",
                         "c9e24f6c-5535-4a0c-b6c6-bf4101418c2c",
                         "1117e724-4445-455e-acba-f99cc30dbd2d",
                         "21d2267e-d9f1-4e55-8b93-56cccd774347",
                         "f9c86fc9-0dcf-491d-8bf1-73581dc5b55f",
                         "66069f80-a425-41dc-9c16-48555aae6ca2",
                         "1ba886ae-d1ed-421e-a152-965428335c70",
                         "eac18aab-edc4-4f4f-bfc7-2ef35f8d7e5c",
                         "9343f8b6-2ea3-476e-8dc8-a7f381a73119"
                     ]
    },
    {
        "Name":  "Adobe Acrobat Reader DC",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.winGetApp\",\r\n    \"displayName\":  \"Adobe Acrobat Reader DC\",\r\n    \"description\":  \"Adobe Acrobat Reader is the free, trusted global standard for viewing, printing, e-signing, sharing, and annotating PDFs.\\n\\nView PDFs:\\nOpen and interact with all types of PDF content including forms and multimedia.\\n\\nEasily leave comments or annotate PDFs:\\nSimply annotate documents using sticky notes, type text directly on the page, highlight, underline, or use strikethrough tools, and even draw on the screen with a freehand drawing tool.\\n\\nFill, e-sign, and lock your forms:\\nFill out and e-sign PDF forms fast and share locked copies that become invalid if they are edited.\\n\\nCollaborate better with PDFs:\\nShare PDFs and gather comments from multiple people in one file. Recipients get an email with a link to your PDF. They just click to open, view, and comment. Reviewers can respond to each other’s comments and you get notified of activity. It’s that easy.\\n\\nSuccessful installation requires Administrator access\",\r\n    \"publisher\":  \"ADOBE INC.\",\r\n    \"largeIcon\":  null,\r\n    \"isFeatured\":  false,\r\n    \"privacyInformationUrl\":  \"https://www.adobe.com/privacy/policy-linkfree.html\",\r\n    \"informationUrl\":  null,\r\n    \"owner\":  \"\",\r\n    \"developer\":  \"\",\r\n    \"notes\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"manifestHash\":  null,\r\n    \"packageIdentifier\":  \"XPDP273C0XHQH2\",\r\n    \"installExperience\":  {\r\n                              \"runAsAccount\":  \"system\"\r\n                          }\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/mobileApps",
        "Type":  "Add",
        "PolicyID":  "0162f7a3-9cec-4548-adf6-b06fb5633604"
    },
    {
        "Name":  "VLC",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.winGetApp\",\r\n    \"displayName\":  \"VLC\",\r\n    \"description\":  \"VLC media player (previously the VideoLAN Client and commonly known as simply VLC) is a free and open-source, portable, cross-platform media player software and streaming media server developed by the VideoLAN project. VLC is available for desktop operating systems and mobile platforms.\",\r\n    \"publisher\":  \"VideoLAN\",\r\n    \"largeIcon\":  null,\r\n    \"isFeatured\":  false,\r\n    \"privacyInformationUrl\":  \"https://www.videolan.org/privacy.html\",\r\n    \"informationUrl\":  null,\r\n    \"owner\":  \"\",\r\n    \"developer\":  \"\",\r\n    \"notes\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"manifestHash\":  null,\r\n    \"packageIdentifier\":  \"XPDM1ZW6815MQM\",\r\n    \"installExperience\":  {\r\n                              \"runAsAccount\":  \"system\"\r\n                          }\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/mobileApps",
        "Type":  "Add",
        "PolicyID":  "17557e01-936f-47d4-8022-1735ff518270"
    },
    {
        "Name":  "One Drive Auto Sign in and Backup",
        "Source":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"One Drive Auto Sign in and Backup\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  8,\r\n    \"technologies\":  \"mdm\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"\",\r\n                              \"templateFamily\":  \"none\",\r\n                              \"templateDisplayName\":  null,\r\n                              \"templateDisplayVersion\":  null\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonbatterysaver\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonbatterysaver_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"choiceSettingValue\":  {\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown_0\",\r\n                                                                                                                            \"children\":  [\r\n\r\n                                                                                                                                         ]\r\n                                                                                                                        }\r\n                                                                                             },\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_textbox\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"02b737dc-a491-4133-bb30-62c3d884bd2e\"\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"5\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_syncadminreports_textbox\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJodHRwOi8vc2NoZW1hcy5taWNyb3NvZnQuY29tL2lkZW50aXR5L2NsYWltcy90ZW5hbnRpZCI6IjAyYjczN2RjLWE0OTEtNDEzMy1iYjMwLTYyYzNkODg0YmQyZSIsImFwcGlkIjoiM2NmNmRmOTItMjc0NS00ZjZmLWJiY2YtMTliNTliY2RiNjJhIiwiaXNzIjoiSXNzdWVyIiwiYXVkIjoiQXVkaWVuY2UifQ.rvcMifpY8s3h5aHALyGwUKXMTsyoUFWjeAeg8r9XhNA\"\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"6\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"7\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_warningmindiskspacemb\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  500\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
        "Destination":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"One Drive Auto Sign in and Backup\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  10,\r\n    \"technologies\":  \"mdm\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"\",\r\n                              \"templateFamily\":  \"none\",\r\n                              \"templateDisplayName\":  null,\r\n                              \"templateDisplayVersion\":  null\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonbatterysaver\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonbatterysaver_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_enablesyncadminreports\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_enablesyncadminreports_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"5\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"choiceSettingValue\":  {\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown_0\",\r\n                                                                                                                            \"children\":  [\r\n\r\n                                                                                                                                         ]\r\n                                                                                                                        }\r\n                                                                                             },\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_textbox\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"db2ad788-3fbe-4c72-b8ba-0c9edcb57c4b\"\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"6\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"7\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_syncadminreports_textbox\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJodHRwOi8vc2NoZW1hcy5taWNyb3NvZnQuY29tL2lkZW50aXR5L2NsYWltcy90ZW5hbnRpZCI6IjAyYjczN2RjLWE0OTEtNDEzMy1iYjMwLTYyYzNkODg0YmQyZSIsImFwcGlkIjoiM2NmNmRmOTItMjc0NS00ZjZmLWJiY2YtMTliNTliY2RiNjJhIiwiaXNzIjoiSXNzdWVyIiwiYXVkIjoiQXVkaWVuY2UifQ.rvcMifpY8s3h5aHALyGwUKXMTsyoUFWjeAeg8r9XhNA\"\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"8\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"9\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_warningmindiskspacemb\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  500\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Update",
        "ID":  "dda21588-557a-498d-85a8-b76a4f1f0653"
    }
]