[
    {
        "Name":  "iOS device restriction to block Game Center",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.iosGeneralDeviceConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  \"\",\r\n    \"displayName\":  \"iOS device restriction to block Game Center\",\r\n    \"accountBlockModification\":  false,\r\n    \"activationLockAllowWhenSupervised\":  false,\r\n    \"airDropBlocked\":  false,\r\n    \"airDropForceUnmanagedDropTarget\":  false,\r\n    \"airPlayForcePairingPasswordForOutgoingRequests\":  false,\r\n    \"appleWatchBlockPairing\":  false,\r\n    \"appleWatchForceWristDetection\":  false,\r\n    \"appleNewsBlocked\":  false,\r\n    \"appsVisibilityListType\":  \"none\",\r\n    \"appStoreBlockAutomaticDownloads\":  false,\r\n    \"appStoreBlocked\":  false,\r\n    \"appStoreBlockInAppPurchases\":  false,\r\n    \"appStoreBlockUIAppInstallation\":  false,\r\n    \"appStoreRequirePassword\":  false,\r\n    \"autoFillForceAuthentication\":  false,\r\n    \"bluetoothBlockModification\":  false,\r\n    \"cameraBlocked\":  false,\r\n    \"cellularBlockDataRoaming\":  false,\r\n    \"cellularBlockGlobalBackgroundFetchWhileRoaming\":  false,\r\n    \"cellularBlockPerAppDataModification\":  false,\r\n    \"cellularBlockPersonalHotspot\":  false,\r\n    \"cellularBlockPlanModification\":  false,\r\n    \"cellularBlockVoiceRoaming\":  false,\r\n    \"certificatesBlockUntrustedTlsCertificates\":  false,\r\n    \"classroomAppBlockRemoteScreenObservation\":  false,\r\n    \"classroomAppForceUnpromptedScreenObservation\":  false,\r\n    \"classroomForceAutomaticallyJoinClasses\":  false,\r\n    \"classroomForceUnpromptedAppAndDeviceLock\":  false,\r\n    \"compliantAppListType\":  \"none\",\r\n    \"configurationProfileBlockChanges\":  false,\r\n    \"definitionLookupBlocked\":  false,\r\n    \"deviceBlockEnableRestrictions\":  false,\r\n    \"deviceBlockEraseContentAndSettings\":  false,\r\n    \"deviceBlockNameModification\":  false,\r\n    \"diagnosticDataBlockSubmission\":  false,\r\n    \"diagnosticDataBlockSubmissionModification\":  false,\r\n    \"documentsBlockManagedDocumentsInUnmanagedApps\":  false,\r\n    \"documentsBlockUnmanagedDocumentsInManagedApps\":  false,\r\n    \"emailInDomainSuffixes\":  [\r\n\r\n                              ],\r\n    \"enterpriseAppBlockTrust\":  false,\r\n    \"enterpriseAppBlockTrustModification\":  false,\r\n    \"esimBlockModification\":  false,\r\n    \"faceTimeBlocked\":  false,\r\n    \"findMyFriendsBlocked\":  false,\r\n    \"gamingBlockGameCenterFriends\":  false,\r\n    \"gamingBlockMultiplayer\":  false,\r\n    \"gameCenterBlocked\":  false,\r\n    \"hostPairingBlocked\":  false,\r\n    \"iBooksStoreBlocked\":  false,\r\n    \"iBooksStoreBlockErotica\":  false,\r\n    \"iCloudBlockActivityContinuation\":  false,\r\n    \"iCloudBlockBackup\":  false,\r\n    \"iCloudBlockDocumentSync\":  false,\r\n    \"iCloudBlockManagedAppsSync\":  false,\r\n    \"iCloudBlockPhotoLibrary\":  false,\r\n    \"iCloudBlockPhotoStreamSync\":  false,\r\n    \"iCloudBlockSharedPhotoStream\":  false,\r\n    \"iCloudRequireEncryptedBackup\":  false,\r\n    \"iTunesBlockExplicitContent\":  false,\r\n    \"iTunesBlockMusicService\":  false,\r\n    \"iTunesBlockRadio\":  false,\r\n    \"keyboardBlockAutoCorrect\":  false,\r\n    \"keyboardBlockDictation\":  false,\r\n    \"keyboardBlockPredictive\":  false,\r\n    \"keyboardBlockShortcuts\":  false,\r\n    \"keyboardBlockSpellCheck\":  false,\r\n    \"kioskModeAllowAssistiveSpeak\":  false,\r\n    \"kioskModeAllowAssistiveTouchSettings\":  false,\r\n    \"kioskModeAllowAutoLock\":  false,\r\n    \"kioskModeBlockAutoLock\":  false,\r\n    \"kioskModeAllowColorInversionSettings\":  false,\r\n    \"kioskModeAllowRingerSwitch\":  false,\r\n    \"kioskModeBlockRingerSwitch\":  false,\r\n    \"kioskModeAllowScreenRotation\":  false,\r\n    \"kioskModeBlockScreenRotation\":  false,\r\n    \"kioskModeAllowSleepButton\":  false,\r\n    \"kioskModeBlockSleepButton\":  false,\r\n    \"kioskModeAllowTouchscreen\":  false,\r\n    \"kioskModeBlockTouchscreen\":  false,\r\n    \"kioskModeEnableVoiceControl\":  false,\r\n    \"kioskModeAllowVoiceControlModification\":  false,\r\n    \"kioskModeAllowVoiceOverSettings\":  false,\r\n    \"kioskModeAllowVolumeButtons\":  false,\r\n    \"kioskModeBlockVolumeButtons\":  false,\r\n    \"kioskModeAllowZoomSettings\":  false,\r\n    \"kioskModeAppStoreUrl\":  null,\r\n    \"kioskModeBuiltInAppId\":  null,\r\n    \"kioskModeRequireAssistiveTouch\":  false,\r\n    \"kioskModeRequireColorInversion\":  false,\r\n    \"kioskModeRequireMonoAudio\":  false,\r\n    \"kioskModeRequireVoiceOver\":  false,\r\n    \"kioskModeRequireZoom\":  false,\r\n    \"kioskModeManagedAppId\":  null,\r\n    \"lockScreenBlockControlCenter\":  false,\r\n    \"lockScreenBlockNotificationView\":  false,\r\n    \"lockScreenBlockPassbook\":  false,\r\n    \"lockScreenBlockTodayView\":  false,\r\n    \"mediaContentRatingAustralia\":  null,\r\n    \"mediaContentRatingCanada\":  null,\r\n    \"mediaContentRatingFrance\":  null,\r\n    \"mediaContentRatingGermany\":  null,\r\n    \"mediaContentRatingIreland\":  null,\r\n    \"mediaContentRatingJapan\":  null,\r\n    \"mediaContentRatingNewZealand\":  null,\r\n    \"mediaContentRatingUnitedKingdom\":  null,\r\n    \"mediaContentRatingUnitedStates\":  null,\r\n    \"mediaContentRatingApps\":  \"allAllowed\",\r\n    \"messagesBlocked\":  false,\r\n    \"notificationsBlockSettingsModification\":  false,\r\n    \"passcodeBlockFingerprintUnlock\":  false,\r\n    \"passcodeBlockFingerprintModification\":  false,\r\n    \"passcodeBlockModification\":  false,\r\n    \"passcodeBlockSimple\":  false,\r\n    \"passcodeExpirationDays\":  null,\r\n    \"passcodeMinimumLength\":  null,\r\n    \"passcodeMinutesOfInactivityBeforeLock\":  null,\r\n    \"passcodeMinutesOfInactivityBeforeScreenTimeout\":  null,\r\n    \"passcodeMinimumCharacterSetCount\":  null,\r\n    \"passcodePreviousPasscodeBlockCount\":  null,\r\n    \"passcodeSignInFailureCountBeforeWipe\":  null,\r\n    \"passcodeRequiredType\":  \"deviceDefault\",\r\n    \"passcodeRequired\":  false,\r\n    \"podcastsBlocked\":  false,\r\n    \"proximityBlockSetupToNewDevice\":  false,\r\n    \"safariBlockAutofill\":  false,\r\n    \"safariBlockJavaScript\":  false,\r\n    \"safariBlockPopups\":  false,\r\n    \"safariBlocked\":  false,\r\n    \"safariCookieSettings\":  \"browserDefault\",\r\n    \"safariManagedDomains\":  [\r\n\r\n                             ],\r\n    \"safariPasswordAutoFillDomains\":  [\r\n\r\n                                      ],\r\n    \"safariRequireFraudWarning\":  false,\r\n    \"screenCaptureBlocked\":  false,\r\n    \"siriBlocked\":  false,\r\n    \"siriBlockedWhenLocked\":  false,\r\n    \"siriBlockUserGeneratedContent\":  false,\r\n    \"siriRequireProfanityFilter\":  false,\r\n    \"softwareUpdatesEnforcedDelayInDays\":  null,\r\n    \"softwareUpdatesForceDelayed\":  false,\r\n    \"spotlightBlockInternetResults\":  false,\r\n    \"voiceDialingBlocked\":  false,\r\n    \"wallpaperBlockModification\":  false,\r\n    \"wiFiConnectOnlyToConfiguredNetworks\":  false,\r\n    \"classroomForceRequestPermissionToLeaveClasses\":  false,\r\n    \"keychainBlockCloudSync\":  false,\r\n    \"pkiBlockOTAUpdates\":  false,\r\n    \"privacyForceLimitAdTracking\":  false,\r\n    \"enterpriseBookBlockBackup\":  false,\r\n    \"enterpriseBookBlockMetadataSync\":  false,\r\n    \"airPrintBlocked\":  false,\r\n    \"airPrintBlockCredentialsStorage\":  false,\r\n    \"airPrintForceTrustedTLS\":  false,\r\n    \"airPrintBlockiBeaconDiscovery\":  false,\r\n    \"filesNetworkDriveAccessBlocked\":  false,\r\n    \"filesUsbDriveAccessBlocked\":  false,\r\n    \"wifiPowerOnForced\":  false,\r\n    \"blockSystemAppRemoval\":  false,\r\n    \"vpnBlockCreation\":  false,\r\n    \"appRemovalBlocked\":  false,\r\n    \"usbRestrictedModeBlocked\":  false,\r\n    \"passwordBlockAutoFill\":  false,\r\n    \"passwordBlockProximityRequests\":  false,\r\n    \"passwordBlockAirDropSharing\":  false,\r\n    \"dateAndTimeForceSetAutomatically\":  false,\r\n    \"contactsAllowManagedToUnmanagedWrite\":  false,\r\n    \"contactsAllowUnmanagedToManagedRead\":  false,\r\n    \"cellularBlockPersonalHotspotModification\":  false,\r\n    \"continuousPathKeyboardBlocked\":  false,\r\n    \"findMyDeviceInFindMyAppBlocked\":  false,\r\n    \"findMyFriendsInFindMyAppBlocked\":  false,\r\n    \"iTunesBlocked\":  false,\r\n    \"sharedDeviceBlockTemporarySessions\":  false,\r\n    \"appClipsBlocked\":  false,\r\n    \"applePersonalizedAdsBlocked\":  false,\r\n    \"nfcBlocked\":  false,\r\n    \"autoUnlockBlocked\":  false,\r\n    \"unpairedExternalBootToRecoveryAllowed\":  false,\r\n    \"onDeviceOnlyDictationForced\":  false,\r\n    \"wiFiConnectToAllowedNetworksOnlyForced\":  false,\r\n    \"onDeviceOnlyTranslationForced\":  false,\r\n    \"managedPasteboardRequired\":  false,\r\n    \"iCloudPrivateRelayBlocked\":  false,\r\n    \"kioskModeAppType\":  \"notConfigured\",\r\n    \"appsSingleAppModeList\":  [\r\n\r\n                              ],\r\n    \"appsVisibilityList\":  [\r\n\r\n                           ],\r\n    \"compliantAppsList\":  [\r\n\r\n                          ],\r\n    \"networkUsageRules\":  [\r\n\r\n                          ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
        "Type":  "Add",
        "PolicyID":  "5440b0be-7da5-4898-84c7-45db42f3c936"
    },
    {
        "Name":  "Win - OIB - Windows LAPS - D - LAPS Configuration - v3.0",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"Win - OIB - Windows LAPS - D - LAPS Configuration - v3.0\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  5,\r\n    \"technologies\":  \"mdm\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1\",\r\n                              \"templateFamily\":  \"endpointSecurityAccountProtection\",\r\n                              \"templateDisplayName\":  \"Local admin password solution (Windows LAPS)\",\r\n                              \"templateDisplayVersion\":  \"Version 1\"\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_backupdirectory\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"a3270f64-e493-499d-8900-90290f61ed8a\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"device_vendor_msft_laps_policies_backupdirectory_1\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"4d90f03d-e14c-43c4-86da-681da96a2f92\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_passwordagedays_aad\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  7\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_passwordcomplexity\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"8a7459e8-1d1c-458a-8906-7b27d216de52\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"device_vendor_msft_laps_policies_passwordcomplexity_4\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"aa883ab5-625e-4e3b-b830-a37a4bb8ce01\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_passwordlength\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"da7a1dbd-caf7-4341-ab63-ece6f994ff02\"\r\n                                                                                      },\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                            \"value\":  21,\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"d08f1266-5345-4f53-8ae1-4c20e6cb5ec9\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              }\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_postauthenticationactions\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"d9282eb1-d187-42ae-b366-7081f32dcfff\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"device_vendor_msft_laps_policies_postauthenticationactions_3\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"68ff4f78-baa8-4b32-bf3d-5ad5566d8142\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_laps_policies_postauthenticationresetdelay\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"a9e21166-4055-4042-9372-efaf3ef41868\"\r\n                                                                                      },\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                            \"value\":  1,\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"0deb6aee-8dac-40c4-a9dd-c3718e5c1d52\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              }\r\n                                                                        }\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Add",
        "PolicyID":  "745d8146-3f37-4e60-a026-786da53d77f6"
    },
    {
        "Name":  "Windows Autopilot Device Preparation",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"Windows Autopilot Device Preparation\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  10,\r\n    \"technologies\":  \"enrollment\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"80d33118-b7b4-40d8-b15f-81be745e053f_1\",\r\n                              \"templateFamily\":  \"enrollmentConfiguration\",\r\n                              \"templateDisplayName\":  \"Device Preparation\",\r\n                              \"templateDisplayVersion\":  \"Version 1\"\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_deploymentmode\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"5180aeab-886e-4589-97d4-40855c646315\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_deploymentmode_0\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"5874c2f6-bcf1-463b-a9eb-bee64e2f2d82\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_deploymenttype\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"f4184296-fa9f-4b67-8b12-1723b3f8456b\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_deploymenttype_0\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"e0af022f-37f3-4a40-916d-1ab7281c88d9\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_jointype\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"6310e95d-6cfa-4d2f-aae0-1e7af12e2182\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_jointype_0\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"1fa84eb3-fcfa-4ed6-9687-0f3d486402c4\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_accountype\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"d4f2a840-86d5-4162-9a08-fa8cc608b94e\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_accountype_0\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"bf13bb47-69ef-4e06-97c1-50c2859a49c2\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_timeout\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"6dec0657-dfb8-4906-a7ee-3ac6ee1edecb\"\r\n                                                                                      },\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                            \"value\":  30,\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"0bbcce5b-a55a-4e05-821a-94bf576d6cc8\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              }\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"5\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_customerrormessage\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"2ddf0619-2b7a-46de-b29b-c6191e9dda6e\"\r\n                                                                                      },\r\n                                                 \"simpleSettingValue\":  {\r\n                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                            \"value\":  \"Contact your oganization\\u0027s support person for help.\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"fe5002d5-fbe9-4920-9e2d-26bfc4b4cc97\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              }\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"6\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_allowskip\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"2a71dc89-0f17-4ba9-bb27-af2521d34710\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_allowskip_1\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"a2323e5e-ac56-4517-8847-b0a6fdb467e7\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"7\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_allowdiagnostics\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"e2b7a81b-f243-4abd-bce3-c1856345f405\"\r\n                                                                                      },\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"value\":  \"enrollment_autopilot_dpp_allowdiagnostics_1\",\r\n                                                                            \"settingValueTemplateReference\":  {\r\n                                                                                                                  \"settingValueTemplateId\":  \"c59d26fd-3460-4b26-b47a-f7e202e7d5a3\",\r\n                                                                                                                  \"useTemplateDefault\":  false\r\n                                                                                                              },\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"8\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_allowedappids\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"70d22a8a-a03c-4f62-b8df-dded3e327639\"\r\n                                                                                      },\r\n                                                 \"simpleSettingCollectionValue\":  [\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"{\\\"id\\\":\\\"0162f7a3-9cec-4548-adf6-b06fb5633604\\\",\\\"type\\\":\\\"#microsoft.graph.winGetApp\\\"}\"\r\n                                                                                      },\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"{\\\"id\\\":\\\"8b1155c7-f157-4beb-a5f8-f381dbb283ca\\\",\\\"type\\\":\\\"#microsoft.graph.officeSuiteApp\\\"}\"\r\n                                                                                      },\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"{\\\"id\\\":\\\"17557e01-936f-47d4-8022-1735ff518270\\\",\\\"type\\\":\\\"#microsoft.graph.winGetApp\\\"}\"\r\n                                                                                      }\r\n                                                                                  ]\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"9\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                                                 \"settingDefinitionId\":  \"enrollment_autopilot_dpp_allowedscriptids\",\r\n                                                 \"settingInstanceTemplateReference\":  {\r\n                                                                                          \"settingInstanceTemplateId\":  \"1bc67702-800c-4271-8fd9-609351cc19cf\"\r\n                                                                                      },\r\n                                                 \"simpleSettingCollectionValue\":  [\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"d7324712-b33f-461b-908f-fb9fee877995\"\r\n                                                                                      },\r\n                                                                                      {\r\n                                                                                          \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                          \"settingValueTemplateReference\":  null,\r\n                                                                                          \"value\":  \"176e6114-3e23-457a-bb69-28a9e1cfe437\"\r\n                                                                                      }\r\n                                                                                  ]\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Add",
        "PolicyID":  "e8f9c7e8-4ea0-4571-bb3c-d80283d29523"
    },
    {
        "Name":  "Autopilot Profile",
        "Source":  {
                       "value":  "{\r\n    \"@odata.type\":  \"#microsoft.graph.azureADWindowsAutopilotDeploymentProfile\",\r\n    \"displayName\":  \"Autopilot Profile\",\r\n    \"description\":  \"\",\r\n    \"language\":  \"os-default\",\r\n    \"locale\":  \"os-default\",\r\n    \"enrollmentStatusScreenSettings\":  null,\r\n    \"extractHardwareHash\":  false,\r\n    \"hardwareHashExtractionEnabled\":  false,\r\n    \"deviceNameTemplate\":  \"\",\r\n    \"deviceType\":  \"windowsPc\",\r\n    \"enableWhiteGlove\":  false,\r\n    \"preprovisioningAllowed\":  false,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"managementServiceAppId\":  null,\r\n    \"outOfBoxExperienceSettings\":  {\r\n                                       \"hidePrivacySettings\":  true,\r\n                                       \"hideEULA\":  true,\r\n                                       \"userType\":  \"standard\",\r\n                                       \"deviceUsageType\":  \"singleUser\",\r\n                                       \"skipKeyboardSelectionPage\":  false,\r\n                                       \"hideEscapeLink\":  false\r\n                                   },\r\n    \"outOfBoxExperienceSetting\":  {\r\n                                      \"privacySettingsHidden\":  true,\r\n                                      \"eulaHidden\":  true,\r\n                                      \"userType\":  \"standard\",\r\n                                      \"deviceUsageType\":  \"singleUser\",\r\n                                      \"keyboardSelectionPageSkipped\":  false,\r\n                                      \"escapeLinkHidden\":  false\r\n                                  }\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles",
        "Type":  "Add",
        "PolicyID":  "eb85c0ac-b555-4b0f-89cf-9629c1a3119f"
    },
    {
        "Name":  "mbp+std Intune Policies",
        "Source":  {
                       "value":  "{\r\n    \"description\":  null,\r\n    \"displayName\":  \"mbp+std Intune Policies\",\r\n    \"groupTypes\":  [\r\n\r\n                   ],\r\n    \"mailEnabled\":  false,\r\n    \"mailNickname\":  \"eb753512-0\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  null,\r\n    \"membershipRuleProcessingState\":  null\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "7268f348-c4ef-4c6b-8f82-a7c489aa98fd"
    },
    {
        "Name":  "AutoPilot V2 User Group",
        "Source":  {
                       "value":  "{\r\n    \"description\":  null,\r\n    \"displayName\":  \"AutoPilot V2 User Group\",\r\n    \"groupTypes\":  [\r\n\r\n                   ],\r\n    \"mailEnabled\":  false,\r\n    \"mailNickname\":  \"a7de723d-d\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  null,\r\n    \"membershipRuleProcessingState\":  null\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "928e7f50-1c00-45e9-9808-3add53341ea7"
    },
    {
        "Name":  "Autopilot V2 Device Group",
        "Source":  {
                       "value":  "{\r\n    \"description\":  null,\r\n    \"displayName\":  \"Autopilot V2 Device Group\",\r\n    \"groupTypes\":  [\r\n\r\n                   ],\r\n    \"mailEnabled\":  false,\r\n    \"mailNickname\":  \"352f59d9-d\",\r\n    \"securityEnabled\":  true,\r\n    \"isAssignableToRole\":  null,\r\n    \"membershipRule\":  null,\r\n    \"membershipRuleProcessingState\":  null\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/groups",
        "Type":  "Add",
        "PolicyID":  "fa026533-80f9-4031-b187-49146a78c0df"
    },
    {
        "Name":  "Android - Baseline - BYOD - App Protection",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.androidManagedAppProtection\",\r\n    \"displayName\":  \"Android - Baseline - BYOD - App Protection\",\r\n    \"description\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"periodOfflineBeforeAccessCheck\":  \"PT12H\",\r\n    \"periodOnlineBeforeAccessCheck\":  \"PT30M\",\r\n    \"allowedInboundDataTransferSources\":  \"allApps\",\r\n    \"allowedOutboundDataTransferDestinations\":  \"managedApps\",\r\n    \"organizationalCredentialsRequired\":  false,\r\n    \"allowedOutboundClipboardSharingLevel\":  \"managedAppsWithPasteIn\",\r\n    \"dataBackupBlocked\":  true,\r\n    \"deviceComplianceRequired\":  true,\r\n    \"managedBrowserToOpenLinksRequired\":  true,\r\n    \"saveAsBlocked\":  true,\r\n    \"periodOfflineBeforeWipeIsEnforced\":  \"P90D\",\r\n    \"pinRequired\":  true,\r\n    \"maximumPinRetries\":  5,\r\n    \"simplePinBlocked\":  true,\r\n    \"minimumPinLength\":  6,\r\n    \"pinCharacterSet\":  \"numeric\",\r\n    \"periodBeforePinReset\":  \"PT0S\",\r\n    \"allowedDataStorageLocations\":  [\r\n                                        \"oneDriveForBusiness\",\r\n                                        \"sharePoint\"\r\n                                    ],\r\n    \"contactSyncBlocked\":  false,\r\n    \"printBlocked\":  true,\r\n    \"fingerprintBlocked\":  false,\r\n    \"disableAppPinIfDevicePinIsSet\":  false,\r\n    \"maximumRequiredOsVersion\":  null,\r\n    \"maximumWarningOsVersion\":  null,\r\n    \"maximumWipeOsVersion\":  null,\r\n    \"minimumRequiredOsVersion\":  null,\r\n    \"minimumWarningOsVersion\":  null,\r\n    \"minimumRequiredAppVersion\":  null,\r\n    \"minimumWarningAppVersion\":  null,\r\n    \"minimumWipeOsVersion\":  null,\r\n    \"minimumWipeAppVersion\":  null,\r\n    \"appActionIfDeviceComplianceRequired\":  \"block\",\r\n    \"appActionIfMaximumPinRetriesExceeded\":  \"block\",\r\n    \"pinRequiredInsteadOfBiometricTimeout\":  \"PT12H\",\r\n    \"allowedOutboundClipboardSharingExceptionLength\":  0,\r\n    \"notificationRestriction\":  \"blockOrganizationalData\",\r\n    \"previousPinBlockCount\":  0,\r\n    \"managedBrowser\":  \"microsoftEdge\",\r\n    \"maximumAllowedDeviceThreatLevel\":  \"notConfigured\",\r\n    \"mobileThreatDefenseRemediationAction\":  \"block\",\r\n    \"mobileThreatDefensePartnerPriority\":  null,\r\n    \"blockDataIngestionIntoOrganizationDocuments\":  false,\r\n    \"allowedDataIngestionLocations\":  [\r\n                                          \"oneDriveForBusiness\",\r\n                                          \"sharePoint\",\r\n                                          \"camera\"\r\n                                      ],\r\n    \"appActionIfUnableToAuthenticateUser\":  \"block\",\r\n    \"dialerRestrictionLevel\":  \"allApps\",\r\n    \"gracePeriodToBlockAppsDuringOffClockHours\":  null,\r\n    \"protectedMessagingRedirectAppType\":  \"anyApp\",\r\n    \"isAssigned\":  false,\r\n    \"targetedAppManagementLevels\":  \"unmanaged\",\r\n    \"appGroupType\":  \"allMicrosoftApps\",\r\n    \"screenCaptureBlocked\":  true,\r\n    \"disableAppEncryptionIfDeviceEncryptionIsEnabled\":  false,\r\n    \"encryptAppData\":  true,\r\n    \"deployedAppCount\":  41,\r\n    \"minimumRequiredPatchVersion\":  \"0000-00-00\",\r\n    \"minimumWarningPatchVersion\":  \"0000-00-00\",\r\n    \"minimumWipePatchVersion\":  \"0000-00-00\",\r\n    \"allowedAndroidDeviceManufacturers\":  null,\r\n    \"appActionIfAndroidDeviceManufacturerNotAllowed\":  \"block\",\r\n    \"appActionIfAccountIsClockedOut\":  null,\r\n    \"appActionIfSamsungKnoxAttestationRequired\":  null,\r\n    \"requiredAndroidSafetyNetDeviceAttestationType\":  \"basicIntegrityAndDeviceCertification\",\r\n    \"appActionIfAndroidSafetyNetDeviceAttestationFailed\":  \"block\",\r\n    \"requiredAndroidSafetyNetAppsVerificationType\":  \"enabled\",\r\n    \"appActionIfAndroidSafetyNetAppsVerificationFailed\":  \"block\",\r\n    \"customBrowserPackageId\":  \"\",\r\n    \"customBrowserDisplayName\":  \"\",\r\n    \"minimumRequiredCompanyPortalVersion\":  null,\r\n    \"minimumWarningCompanyPortalVersion\":  null,\r\n    \"minimumWipeCompanyPortalVersion\":  null,\r\n    \"keyboardsRestricted\":  false,\r\n    \"allowedAndroidDeviceModels\":  [\r\n\r\n                                   ],\r\n    \"appActionIfAndroidDeviceModelNotAllowed\":  \"block\",\r\n    \"customDialerAppPackageId\":  \"\",\r\n    \"customDialerAppDisplayName\":  \"\",\r\n    \"biometricAuthenticationBlocked\":  false,\r\n    \"requiredAndroidSafetyNetEvaluationType\":  \"hardwareBacked\",\r\n    \"blockAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"warnAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"wipeAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"deviceLockRequired\":  false,\r\n    \"appActionIfDeviceLockNotSet\":  \"block\",\r\n    \"connectToVpnOnLaunch\":  false,\r\n    \"appActionIfDevicePasscodeComplexityLessThanLow\":  null,\r\n    \"appActionIfDevicePasscodeComplexityLessThanMedium\":  \"block\",\r\n    \"appActionIfDevicePasscodeComplexityLessThanHigh\":  null,\r\n    \"requireClass3Biometrics\":  true,\r\n    \"requirePinAfterBiometricChange\":  true,\r\n    \"fingerprintAndBiometricEnabled\":  null,\r\n    \"messagingRedirectAppPackageId\":  null,\r\n    \"messagingRedirectAppDisplayName\":  null,\r\n    \"exemptedAppPackages\":  [\r\n\r\n                            ],\r\n    \"approvedKeyboards\":  [\r\n\r\n                          ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
        "Type":  "Add",
        "PolicyID":  "T_a70ad863-fbc3-4482-98fb-7ba5c609ebc8"
    },
    {
        "Name":  "Android apps data leak prevention policy",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.androidManagedAppProtection\",\r\n    \"displayName\":  \"Android apps data leak prevention policy\",\r\n    \"description\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"periodOfflineBeforeAccessCheck\":  \"PT12H\",\r\n    \"periodOnlineBeforeAccessCheck\":  \"PT30M\",\r\n    \"allowedInboundDataTransferSources\":  \"allApps\",\r\n    \"allowedOutboundDataTransferDestinations\":  \"managedApps\",\r\n    \"organizationalCredentialsRequired\":  false,\r\n    \"allowedOutboundClipboardSharingLevel\":  \"managedAppsWithPasteIn\",\r\n    \"dataBackupBlocked\":  true,\r\n    \"deviceComplianceRequired\":  true,\r\n    \"managedBrowserToOpenLinksRequired\":  true,\r\n    \"saveAsBlocked\":  true,\r\n    \"periodOfflineBeforeWipeIsEnforced\":  \"P90D\",\r\n    \"pinRequired\":  true,\r\n    \"maximumPinRetries\":  5,\r\n    \"simplePinBlocked\":  false,\r\n    \"minimumPinLength\":  4,\r\n    \"pinCharacterSet\":  \"alphanumericAndSymbol\",\r\n    \"periodBeforePinReset\":  \"PT0S\",\r\n    \"allowedDataStorageLocations\":  [\r\n                                        \"oneDriveForBusiness\",\r\n                                        \"sharePoint\"\r\n                                    ],\r\n    \"contactSyncBlocked\":  false,\r\n    \"printBlocked\":  false,\r\n    \"fingerprintBlocked\":  false,\r\n    \"disableAppPinIfDevicePinIsSet\":  false,\r\n    \"maximumRequiredOsVersion\":  null,\r\n    \"maximumWarningOsVersion\":  null,\r\n    \"maximumWipeOsVersion\":  null,\r\n    \"minimumRequiredOsVersion\":  null,\r\n    \"minimumWarningOsVersion\":  null,\r\n    \"minimumRequiredAppVersion\":  null,\r\n    \"minimumWarningAppVersion\":  null,\r\n    \"minimumWipeOsVersion\":  null,\r\n    \"minimumWipeAppVersion\":  null,\r\n    \"appActionIfDeviceComplianceRequired\":  \"block\",\r\n    \"appActionIfMaximumPinRetriesExceeded\":  \"block\",\r\n    \"pinRequiredInsteadOfBiometricTimeout\":  null,\r\n    \"allowedOutboundClipboardSharingExceptionLength\":  0,\r\n    \"notificationRestriction\":  \"allow\",\r\n    \"previousPinBlockCount\":  0,\r\n    \"managedBrowser\":  \"notConfigured\",\r\n    \"maximumAllowedDeviceThreatLevel\":  \"notConfigured\",\r\n    \"mobileThreatDefenseRemediationAction\":  \"block\",\r\n    \"mobileThreatDefensePartnerPriority\":  null,\r\n    \"blockDataIngestionIntoOrganizationDocuments\":  false,\r\n    \"allowedDataIngestionLocations\":  [\r\n\r\n                                      ],\r\n    \"appActionIfUnableToAuthenticateUser\":  null,\r\n    \"dialerRestrictionLevel\":  \"allApps\",\r\n    \"gracePeriodToBlockAppsDuringOffClockHours\":  null,\r\n    \"protectedMessagingRedirectAppType\":  \"anyApp\",\r\n    \"isAssigned\":  false,\r\n    \"targetedAppManagementLevels\":  \"unspecified\",\r\n    \"appGroupType\":  \"selectedPublicApps\",\r\n    \"screenCaptureBlocked\":  false,\r\n    \"disableAppEncryptionIfDeviceEncryptionIsEnabled\":  false,\r\n    \"encryptAppData\":  false,\r\n    \"deployedAppCount\":  0,\r\n    \"minimumRequiredPatchVersion\":  \"0000-00-00\",\r\n    \"minimumWarningPatchVersion\":  \"0000-00-00\",\r\n    \"minimumWipePatchVersion\":  \"0000-00-00\",\r\n    \"allowedAndroidDeviceManufacturers\":  null,\r\n    \"appActionIfAndroidDeviceManufacturerNotAllowed\":  \"block\",\r\n    \"appActionIfAccountIsClockedOut\":  null,\r\n    \"appActionIfSamsungKnoxAttestationRequired\":  null,\r\n    \"requiredAndroidSafetyNetDeviceAttestationType\":  \"none\",\r\n    \"appActionIfAndroidSafetyNetDeviceAttestationFailed\":  \"block\",\r\n    \"requiredAndroidSafetyNetAppsVerificationType\":  \"none\",\r\n    \"appActionIfAndroidSafetyNetAppsVerificationFailed\":  \"block\",\r\n    \"customBrowserPackageId\":  null,\r\n    \"customBrowserDisplayName\":  null,\r\n    \"minimumRequiredCompanyPortalVersion\":  null,\r\n    \"minimumWarningCompanyPortalVersion\":  null,\r\n    \"minimumWipeCompanyPortalVersion\":  null,\r\n    \"keyboardsRestricted\":  false,\r\n    \"allowedAndroidDeviceModels\":  [\r\n\r\n                                   ],\r\n    \"appActionIfAndroidDeviceModelNotAllowed\":  \"block\",\r\n    \"customDialerAppPackageId\":  null,\r\n    \"customDialerAppDisplayName\":  null,\r\n    \"biometricAuthenticationBlocked\":  false,\r\n    \"requiredAndroidSafetyNetEvaluationType\":  \"basic\",\r\n    \"blockAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"warnAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"wipeAfterCompanyPortalUpdateDeferralInDays\":  0,\r\n    \"deviceLockRequired\":  false,\r\n    \"appActionIfDeviceLockNotSet\":  \"block\",\r\n    \"connectToVpnOnLaunch\":  false,\r\n    \"appActionIfDevicePasscodeComplexityLessThanLow\":  null,\r\n    \"appActionIfDevicePasscodeComplexityLessThanMedium\":  null,\r\n    \"appActionIfDevicePasscodeComplexityLessThanHigh\":  null,\r\n    \"requireClass3Biometrics\":  false,\r\n    \"requirePinAfterBiometricChange\":  false,\r\n    \"fingerprintAndBiometricEnabled\":  null,\r\n    \"messagingRedirectAppPackageId\":  null,\r\n    \"messagingRedirectAppDisplayName\":  null,\r\n    \"exemptedAppPackages\":  [\r\n                                {\r\n                                    \"name\":  \"Default\",\r\n                                    \"value\":  \"\"\r\n                                }\r\n                            ],\r\n    \"approvedKeyboards\":  [\r\n\r\n                          ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
        "Type":  "Add",
        "PolicyID":  "T_d01e705d-4625-4dac-9adc-df0bb6831369"
    },
    {
        "Name":  "iOS - Baseline - BYOD - App Protection",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.iosManagedAppProtection\",\r\n    \"displayName\":  \"iOS - Baseline - BYOD - App Protection\",\r\n    \"description\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"periodOfflineBeforeAccessCheck\":  \"PT12H\",\r\n    \"periodOnlineBeforeAccessCheck\":  \"PT30M\",\r\n    \"allowedInboundDataTransferSources\":  \"allApps\",\r\n    \"allowedOutboundDataTransferDestinations\":  \"managedApps\",\r\n    \"organizationalCredentialsRequired\":  false,\r\n    \"allowedOutboundClipboardSharingLevel\":  \"managedAppsWithPasteIn\",\r\n    \"dataBackupBlocked\":  true,\r\n    \"deviceComplianceRequired\":  true,\r\n    \"managedBrowserToOpenLinksRequired\":  true,\r\n    \"saveAsBlocked\":  true,\r\n    \"periodOfflineBeforeWipeIsEnforced\":  \"P90D\",\r\n    \"pinRequired\":  true,\r\n    \"maximumPinRetries\":  5,\r\n    \"simplePinBlocked\":  true,\r\n    \"minimumPinLength\":  6,\r\n    \"pinCharacterSet\":  \"numeric\",\r\n    \"periodBeforePinReset\":  \"PT0S\",\r\n    \"allowedDataStorageLocations\":  [\r\n                                        \"oneDriveForBusiness\",\r\n                                        \"sharePoint\"\r\n                                    ],\r\n    \"contactSyncBlocked\":  false,\r\n    \"printBlocked\":  true,\r\n    \"fingerprintBlocked\":  false,\r\n    \"disableAppPinIfDevicePinIsSet\":  false,\r\n    \"maximumRequiredOsVersion\":  null,\r\n    \"maximumWarningOsVersion\":  null,\r\n    \"maximumWipeOsVersion\":  null,\r\n    \"minimumRequiredOsVersion\":  null,\r\n    \"minimumWarningOsVersion\":  null,\r\n    \"minimumRequiredAppVersion\":  null,\r\n    \"minimumWarningAppVersion\":  null,\r\n    \"minimumWipeOsVersion\":  null,\r\n    \"minimumWipeAppVersion\":  null,\r\n    \"appActionIfDeviceComplianceRequired\":  \"block\",\r\n    \"appActionIfMaximumPinRetriesExceeded\":  \"block\",\r\n    \"pinRequiredInsteadOfBiometricTimeout\":  \"PT12H\",\r\n    \"allowedOutboundClipboardSharingExceptionLength\":  0,\r\n    \"notificationRestriction\":  \"blockOrganizationalData\",\r\n    \"previousPinBlockCount\":  0,\r\n    \"managedBrowser\":  \"microsoftEdge\",\r\n    \"maximumAllowedDeviceThreatLevel\":  \"notConfigured\",\r\n    \"mobileThreatDefenseRemediationAction\":  \"block\",\r\n    \"mobileThreatDefensePartnerPriority\":  null,\r\n    \"blockDataIngestionIntoOrganizationDocuments\":  false,\r\n    \"allowedDataIngestionLocations\":  [\r\n                                          \"oneDriveForBusiness\",\r\n                                          \"sharePoint\",\r\n                                          \"camera\"\r\n                                      ],\r\n    \"appActionIfUnableToAuthenticateUser\":  \"block\",\r\n    \"dialerRestrictionLevel\":  \"allApps\",\r\n    \"gracePeriodToBlockAppsDuringOffClockHours\":  null,\r\n    \"protectedMessagingRedirectAppType\":  \"anyApp\",\r\n    \"isAssigned\":  false,\r\n    \"targetedAppManagementLevels\":  \"unmanaged\",\r\n    \"appGroupType\":  \"allMicrosoftApps\",\r\n    \"appDataEncryptionType\":  \"whenDeviceLocked\",\r\n    \"minimumRequiredSdkVersion\":  null,\r\n    \"deployedAppCount\":  39,\r\n    \"faceIdBlocked\":  false,\r\n    \"allowWidgetContentSync\":  false,\r\n    \"minimumWipeSdkVersion\":  null,\r\n    \"allowedIosDeviceModels\":  null,\r\n    \"appActionIfIosDeviceModelNotAllowed\":  \"block\",\r\n    \"appActionIfAccountIsClockedOut\":  null,\r\n    \"thirdPartyKeyboardsBlocked\":  false,\r\n    \"filterOpenInToOnlyManagedApps\":  false,\r\n    \"disableProtectionOfManagedOutboundOpenInData\":  false,\r\n    \"protectInboundDataFromUnknownSources\":  false,\r\n    \"customBrowserProtocol\":  \"\",\r\n    \"customDialerAppProtocol\":  \"\",\r\n    \"managedUniversalLinks\":  [\r\n                                  \"http://*.sharepoint.com/*\",\r\n                                  \"http://*.sharepoint-df.com/*\",\r\n                                  \"http://*.yammer.com/*\",\r\n                                  \"http://*.onedrive.com/*\",\r\n                                  \"http://tasks.office.com/*\",\r\n                                  \"http://to-do.microsoft.com/sharing*\",\r\n                                  \"http://web.microsoftstream.com/video/*\",\r\n                                  \"http://msit.microsoftstream.com/video/*\",\r\n                                  \"http://*.powerbi.com/*\",\r\n                                  \"http://app.powerbi.cn/*\",\r\n                                  \"http://app.powerbigov.us/*\",\r\n                                  \"http://app.powerbi.de/*\",\r\n                                  \"http://*.service-now.com/*\",\r\n                                  \"http://*.appsplatform.us/*\",\r\n                                  \"http://*.powerapps.cn/*\",\r\n                                  \"http://*.powerapps.com/*\",\r\n                                  \"http://*.powerapps.us/*\",\r\n                                  \"http://*teams.microsoft.com/l/*\",\r\n                                  \"http://*devspaces.skype.com/l/*\",\r\n                                  \"http://*teams.live.com/l/*\",\r\n                                  \"http://*collab.apps.mil/l/*\",\r\n                                  \"http://*teams.microsoft.us/l/*\",\r\n                                  \"http://*teams-fl.microsoft.com/l/*\",\r\n                                  \"http://*.zoom.us/*\",\r\n                                  \"http://zoom.us/*\",\r\n                                  \"https://*.sharepoint.com/*\",\r\n                                  \"https://*.sharepoint-df.com/*\",\r\n                                  \"https://*.yammer.com/*\",\r\n                                  \"https://*.onedrive.com/*\",\r\n                                  \"https://tasks.office.com/*\",\r\n                                  \"https://to-do.microsoft.com/sharing*\",\r\n                                  \"https://web.microsoftstream.com/video/*\",\r\n                                  \"https://msit.microsoftstream.com/video/*\",\r\n                                  \"https://*.powerbi.com/*\",\r\n                                  \"https://app.powerbi.cn/*\",\r\n                                  \"https://app.powerbigov.us/*\",\r\n                                  \"https://app.powerbi.de/*\",\r\n                                  \"https://*.service-now.com/*\",\r\n                                  \"https://*.appsplatform.us/*\",\r\n                                  \"https://*.powerapps.cn/*\",\r\n                                  \"https://*.powerapps.com/*\",\r\n                                  \"https://*.powerapps.us/*\",\r\n                                  \"https://*teams.microsoft.com/l/*\",\r\n                                  \"https://*devspaces.skype.com/l/*\",\r\n                                  \"https://*teams.live.com/l/*\",\r\n                                  \"https://*collab.apps.mil/l/*\",\r\n                                  \"https://*teams.microsoft.us/l/*\",\r\n                                  \"https://*teams-fl.microsoft.com/l/*\",\r\n                                  \"https://*.zoom.us/*\",\r\n                                  \"https://zoom.us/*\"\r\n                              ],\r\n    \"exemptedUniversalLinks\":  [\r\n                                   \"http://maps.apple.com\",\r\n                                   \"https://maps.apple.com\",\r\n                                   \"http://facetime.apple.com\",\r\n                                   \"https://facetime.apple.com\"\r\n                               ],\r\n    \"minimumWarningSdkVersion\":  null,\r\n    \"messagingRedirectAppUrlScheme\":  null,\r\n    \"exemptedAppProtocols\":  [\r\n                                 {\r\n                                     \"name\":  \"Default\",\r\n                                     \"value\":  \"skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;\"\r\n                                 }\r\n                             ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
        "Type":  "Add",
        "PolicyID":  "T_bcbd3ad2-1e73-481d-9a69-2e1c28b5d237"
    },
    {
        "Name":  "iOS apps data leak prevention policy",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.iosManagedAppProtection\",\r\n    \"displayName\":  \"iOS apps data leak prevention policy\",\r\n    \"description\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"periodOfflineBeforeAccessCheck\":  \"PT12H\",\r\n    \"periodOnlineBeforeAccessCheck\":  \"PT30M\",\r\n    \"allowedInboundDataTransferSources\":  \"allApps\",\r\n    \"allowedOutboundDataTransferDestinations\":  \"managedApps\",\r\n    \"organizationalCredentialsRequired\":  false,\r\n    \"allowedOutboundClipboardSharingLevel\":  \"managedAppsWithPasteIn\",\r\n    \"dataBackupBlocked\":  true,\r\n    \"deviceComplianceRequired\":  true,\r\n    \"managedBrowserToOpenLinksRequired\":  true,\r\n    \"saveAsBlocked\":  true,\r\n    \"periodOfflineBeforeWipeIsEnforced\":  \"P90D\",\r\n    \"pinRequired\":  true,\r\n    \"maximumPinRetries\":  5,\r\n    \"simplePinBlocked\":  false,\r\n    \"minimumPinLength\":  4,\r\n    \"pinCharacterSet\":  \"alphanumericAndSymbol\",\r\n    \"periodBeforePinReset\":  \"PT0S\",\r\n    \"allowedDataStorageLocations\":  [\r\n                                        \"oneDriveForBusiness\",\r\n                                        \"sharePoint\"\r\n                                    ],\r\n    \"contactSyncBlocked\":  false,\r\n    \"printBlocked\":  false,\r\n    \"fingerprintBlocked\":  false,\r\n    \"disableAppPinIfDevicePinIsSet\":  false,\r\n    \"maximumRequiredOsVersion\":  null,\r\n    \"maximumWarningOsVersion\":  null,\r\n    \"maximumWipeOsVersion\":  null,\r\n    \"minimumRequiredOsVersion\":  null,\r\n    \"minimumWarningOsVersion\":  null,\r\n    \"minimumRequiredAppVersion\":  null,\r\n    \"minimumWarningAppVersion\":  null,\r\n    \"minimumWipeOsVersion\":  null,\r\n    \"minimumWipeAppVersion\":  null,\r\n    \"appActionIfDeviceComplianceRequired\":  \"block\",\r\n    \"appActionIfMaximumPinRetriesExceeded\":  \"block\",\r\n    \"pinRequiredInsteadOfBiometricTimeout\":  null,\r\n    \"allowedOutboundClipboardSharingExceptionLength\":  0,\r\n    \"notificationRestriction\":  \"allow\",\r\n    \"previousPinBlockCount\":  0,\r\n    \"managedBrowser\":  \"notConfigured\",\r\n    \"maximumAllowedDeviceThreatLevel\":  \"notConfigured\",\r\n    \"mobileThreatDefenseRemediationAction\":  \"block\",\r\n    \"mobileThreatDefensePartnerPriority\":  null,\r\n    \"blockDataIngestionIntoOrganizationDocuments\":  false,\r\n    \"allowedDataIngestionLocations\":  [\r\n\r\n                                      ],\r\n    \"appActionIfUnableToAuthenticateUser\":  null,\r\n    \"dialerRestrictionLevel\":  \"allApps\",\r\n    \"gracePeriodToBlockAppsDuringOffClockHours\":  null,\r\n    \"protectedMessagingRedirectAppType\":  \"anyApp\",\r\n    \"isAssigned\":  false,\r\n    \"targetedAppManagementLevels\":  \"unspecified\",\r\n    \"appGroupType\":  \"selectedPublicApps\",\r\n    \"appDataEncryptionType\":  \"whenDeviceLocked\",\r\n    \"minimumRequiredSdkVersion\":  null,\r\n    \"deployedAppCount\":  0,\r\n    \"faceIdBlocked\":  false,\r\n    \"allowWidgetContentSync\":  false,\r\n    \"minimumWipeSdkVersion\":  null,\r\n    \"allowedIosDeviceModels\":  null,\r\n    \"appActionIfIosDeviceModelNotAllowed\":  \"block\",\r\n    \"appActionIfAccountIsClockedOut\":  null,\r\n    \"thirdPartyKeyboardsBlocked\":  false,\r\n    \"filterOpenInToOnlyManagedApps\":  false,\r\n    \"disableProtectionOfManagedOutboundOpenInData\":  false,\r\n    \"protectInboundDataFromUnknownSources\":  false,\r\n    \"customBrowserProtocol\":  null,\r\n    \"customDialerAppProtocol\":  null,\r\n    \"managedUniversalLinks\":  [\r\n                                  \"http://*.sharepoint.com/*\",\r\n                                  \"http://*.sharepoint-df.com/*\",\r\n                                  \"http://*.yammer.com/*\",\r\n                                  \"http://*.onedrive.com/*\",\r\n                                  \"http://tasks.office.com/*\",\r\n                                  \"http://to-do.microsoft.com/sharing*\",\r\n                                  \"http://web.microsoftstream.com/video/*\",\r\n                                  \"http://msit.microsoftstream.com/video/*\",\r\n                                  \"http://*.powerbi.com/*\",\r\n                                  \"http://app.powerbi.cn/*\",\r\n                                  \"http://app.powerbigov.us/*\",\r\n                                  \"http://app.powerbi.de/*\",\r\n                                  \"http://*.service-now.com/*\",\r\n                                  \"http://*.appsplatform.us/*\",\r\n                                  \"http://*.powerapps.cn/*\",\r\n                                  \"http://*.powerapps.com/*\",\r\n                                  \"http://*.powerapps.us/*\",\r\n                                  \"http://*teams.microsoft.com/l/*\",\r\n                                  \"http://*devspaces.skype.com/l/*\",\r\n                                  \"http://*teams.live.com/l/*\",\r\n                                  \"http://*collab.apps.mil/l/*\",\r\n                                  \"http://*teams.microsoft.us/l/*\",\r\n                                  \"http://*teams-fl.microsoft.com/l/*\",\r\n                                  \"http://*.zoom.us/*\",\r\n                                  \"http://zoom.us/*\",\r\n                                  \"https://*.sharepoint.com/*\",\r\n                                  \"https://*.sharepoint-df.com/*\",\r\n                                  \"https://*.yammer.com/*\",\r\n                                  \"https://*.onedrive.com/*\",\r\n                                  \"https://tasks.office.com/*\",\r\n                                  \"https://to-do.microsoft.com/sharing*\",\r\n                                  \"https://web.microsoftstream.com/video/*\",\r\n                                  \"https://msit.microsoftstream.com/video/*\",\r\n                                  \"https://*.powerbi.com/*\",\r\n                                  \"https://app.powerbi.cn/*\",\r\n                                  \"https://app.powerbigov.us/*\",\r\n                                  \"https://app.powerbi.de/*\",\r\n                                  \"https://*.service-now.com/*\",\r\n                                  \"https://*.appsplatform.us/*\",\r\n                                  \"https://*.powerapps.cn/*\",\r\n                                  \"https://*.powerapps.com/*\",\r\n                                  \"https://*.powerapps.us/*\",\r\n                                  \"https://*teams.microsoft.com/l/*\",\r\n                                  \"https://*devspaces.skype.com/l/*\",\r\n                                  \"https://*teams.live.com/l/*\",\r\n                                  \"https://*collab.apps.mil/l/*\",\r\n                                  \"https://*teams.microsoft.us/l/*\",\r\n                                  \"https://*teams-fl.microsoft.com/l/*\",\r\n                                  \"https://*.zoom.us/*\",\r\n                                  \"https://zoom.us/*\"\r\n                              ],\r\n    \"exemptedUniversalLinks\":  [\r\n                                   \"http://maps.apple.com\",\r\n                                   \"https://maps.apple.com\",\r\n                                   \"http://facetime.apple.com\",\r\n                                   \"https://facetime.apple.com\"\r\n                               ],\r\n    \"minimumWarningSdkVersion\":  null,\r\n    \"messagingRedirectAppUrlScheme\":  null,\r\n    \"exemptedAppProtocols\":  [\r\n                                 {\r\n                                     \"name\":  \"Default\",\r\n                                     \"value\":  \"skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;\"\r\n                                 }\r\n                             ]\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  [
                    "https://graph.microsoft.com/beta/deviceAppManagement/managedAppPolicies",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess",
                    "conditionalaccess"
                ],
        "Type":  "Add",
        "PolicyID":  [
                         "T_36a3a205-ca09-44d0-9e98-3745037134cb",
                         "96cd3880-7554-4848-bd92-c77ef340f9d5",
                         "c9e24f6c-5535-4a0c-b6c6-bf4101418c2c",
                         "1117e724-4445-455e-acba-f99cc30dbd2d",
                         "21d2267e-d9f1-4e55-8b93-56cccd774347",
                         "f9c86fc9-0dcf-491d-8bf1-73581dc5b55f",
                         "66069f80-a425-41dc-9c16-48555aae6ca2",
                         "1ba886ae-d1ed-421e-a152-965428335c70"
                     ]
    },
    {
        "Name":  "Adobe Acrobat Reader DC",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.winGetApp\",\r\n    \"displayName\":  \"Adobe Acrobat Reader DC\",\r\n    \"description\":  \"Adobe Acrobat Reader is the free, trusted global standard for viewing, printing, e-signing, sharing, and annotating PDFs.\\n\\nView PDFs:\\nOpen and interact with all types of PDF content including forms and multimedia.\\n\\nEasily leave comments or annotate PDFs:\\nSimply annotate documents using sticky notes, type text directly on the page, highlight, underline, or use strikethrough tools, and even draw on the screen with a freehand drawing tool.\\n\\nFill, e-sign, and lock your forms:\\nFill out and e-sign PDF forms fast and share locked copies that become invalid if they are edited.\\n\\nCollaborate better with PDFs:\\nShare PDFs and gather comments from multiple people in one file. Recipients get an email with a link to your PDF. They just click to open, view, and comment. Reviewers can respond to each other’s comments and you get notified of activity. It’s that easy.\\n\\nSuccessful installation requires Administrator access\",\r\n    \"publisher\":  \"ADOBE INC.\",\r\n    \"largeIcon\":  null,\r\n    \"isFeatured\":  false,\r\n    \"privacyInformationUrl\":  \"https://www.adobe.com/privacy/policy-linkfree.html\",\r\n    \"informationUrl\":  null,\r\n    \"owner\":  \"\",\r\n    \"developer\":  \"\",\r\n    \"notes\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"manifestHash\":  null,\r\n    \"packageIdentifier\":  \"XPDP273C0XHQH2\",\r\n    \"installExperience\":  {\r\n                              \"runAsAccount\":  \"system\"\r\n                          }\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/mobileApps",
        "Type":  "Add",
        "PolicyID":  "0162f7a3-9cec-4548-adf6-b06fb5633604"
    },
    {
        "Name":  "VLC",
        "Source":  {
                       "value":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.winGetApp\",\r\n    \"displayName\":  \"VLC\",\r\n    \"description\":  \"VLC media player (previously the VideoLAN Client and commonly known as simply VLC) is a free and open-source, portable, cross-platform media player software and streaming media server developed by the VideoLAN project. VLC is available for desktop operating systems and mobile platforms.\",\r\n    \"publisher\":  \"VideoLAN\",\r\n    \"largeIcon\":  null,\r\n    \"isFeatured\":  false,\r\n    \"privacyInformationUrl\":  \"https://www.videolan.org/privacy.html\",\r\n    \"informationUrl\":  null,\r\n    \"owner\":  \"\",\r\n    \"developer\":  \"\",\r\n    \"notes\":  \"\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"manifestHash\":  null,\r\n    \"packageIdentifier\":  \"XPDM1ZW6815MQM\",\r\n    \"installExperience\":  {\r\n                              \"runAsAccount\":  \"system\"\r\n                          }\r\n}",
                       "SideIndicator":  "=\u003e"
                   },
        "Destination":  "Missing from Source",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceAppManagement/mobileApps",
        "Type":  "Add",
        "PolicyID":  "17557e01-936f-47d4-8022-1735ff518270"
    },
    {
        "Name":  "One Drive Auto Sign in and Backup",
        "Source":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"One Drive Auto Sign in and Backup\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  8,\r\n    \"technologies\":  \"mdm\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"\",\r\n                              \"templateFamily\":  \"none\",\r\n                              \"templateDisplayName\":  null,\r\n                              \"templateDisplayVersion\":  null\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonbatterysaver\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonbatterysaver_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"choiceSettingValue\":  {\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown_0\",\r\n                                                                                                                            \"children\":  [\r\n\r\n                                                                                                                                         ]\r\n                                                                                                                        }\r\n                                                                                             },\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_textbox\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"02b737dc-a491-4133-bb30-62c3d884bd2e\"\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"5\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_syncadminreports_textbox\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJodHRwOi8vc2NoZW1hcy5taWNyb3NvZnQuY29tL2lkZW50aXR5L2NsYWltcy90ZW5hbnRpZCI6IjAyYjczN2RjLWE0OTEtNDEzMy1iYjMwLTYyYzNkODg0YmQyZSIsImFwcGlkIjoiM2NmNmRmOTItMjc0NS00ZjZmLWJiY2YtMTliNTliY2RiNjJhIiwiaXNzIjoiSXNzdWVyIiwiYXVkIjoiQXVkaWVuY2UifQ.rvcMifpY8s3h5aHALyGwUKXMTsyoUFWjeAeg8r9XhNA\"\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"6\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"7\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_warningmindiskspacemb\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  500\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
        "Destination":  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity\",\r\n    \"description\":  \"\",\r\n    \"name\":  \"One Drive Auto Sign in and Backup\",\r\n    \"platforms\":  \"windows10\",\r\n    \"priorityMetaData\":  null,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"settingCount\":  10,\r\n    \"technologies\":  \"mdm\",\r\n    \"templateReference\":  {\r\n                              \"templateId\":  \"\",\r\n                              \"templateFamily\":  \"none\",\r\n                              \"templateDisplayName\":  null,\r\n                              \"templateDisplayVersion\":  null\r\n                          },\r\n    \"settings\":  [\r\n                     {\r\n                         \"id\":  \"0\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"1\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonbatterysaver\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonbatterysaver_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"2\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_enablesyncadminreports\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_enablesyncadminreports_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"3\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"4\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"5\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"choiceSettingValue\":  {\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown_0\",\r\n                                                                                                                            \"children\":  [\r\n\r\n                                                                                                                                         ]\r\n                                                                                                                        }\r\n                                                                                             },\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_textbox\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"db2ad788-3fbe-4c72-b8ba-0c9edcb57c4b\"\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"6\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"7\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv5~policy~onedrivengsc_syncadminreports_syncadminreports_textbox\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  \"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJodHRwOi8vc2NoZW1hcy5taWNyb3NvZnQuY29tL2lkZW50aXR5L2NsYWltcy90ZW5hbnRpZCI6IjAyYjczN2RjLWE0OTEtNDEzMy1iYjMwLTYyYzNkODg0YmQyZSIsImFwcGlkIjoiM2NmNmRmOTItMjc0NS00ZjZmLWJiY2YtMTliNTliY2RiNjJhIiwiaXNzIjoiSXNzdWVyIiwiYXVkIjoiQXVkaWVuY2UifQ.rvcMifpY8s3h5aHALyGwUKXMTsyoUFWjeAeg8r9XhNA\"\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"8\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled_1\",\r\n                                                                            \"children\":  [\r\n\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     },\r\n                     {\r\n                         \"id\":  \"9\",\r\n                         \"settingInstance\":  {\r\n                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb\",\r\n                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                 \"choiceSettingValue\":  {\r\n                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                            \"value\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_1\",\r\n                                                                            \"children\":  [\r\n                                                                                             {\r\n                                                                                                 \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                                                                                                 \"settingDefinitionId\":  \"device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_warningmindiskspacelimitinmb_warningmindiskspacemb\",\r\n                                                                                                 \"settingInstanceTemplateReference\":  null,\r\n                                                                                                 \"simpleSettingValue\":  {\r\n                                                                                                                            \"@odata.type\":  \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                                                                                                                            \"settingValueTemplateReference\":  null,\r\n                                                                                                                            \"value\":  500\r\n                                                                                                                        }\r\n                                                                                             }\r\n                                                                                         ]\r\n                                                                        }\r\n                                             }\r\n                     }\r\n                 ]\r\n}",
        "Location":  "Added to Tenant",
        "URL":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies",
        "Type":  "Update",
        "ID":  "dda21588-557a-498d-85a8-b76a4f1f0653"
    }
]